{
  "version": "https://jsonfeed.org/version/1",
  "title": "brain dump",
  "home_page_url": "https://mufidu.com",
  "feed_url": "https://mufidu.com/feed/feed.json",
  "description": "Mufid&#39;s personal website",
  "author": {
    "name": "Mufid",
    "url": ""
  },
  "items": [{
      "id": "https://mufidu.com/get-rid-of-socmed/",
      "url": "https://mufidu.com/get-rid-of-socmed/",
      "title": "How to Get Rid of Social Media",
      "content_html": "<p><img src=\"/img/pexels-ready-made-3850250.webp\" alt=\"\"></p>\n<p>Being active on social media can overwhelm us, but we continue using it because of FOMO (fear of missing out). We feel like we have to open Instagram all the time because we are really afraid to miss the last Story from our friends.</p>\n<p>But even though we know social media has a negative impact on us, why do we still use it really often? That's because Instagram, Facebook, and other social media were designed by psychological engineers.</p>\n<p>They design social media in such a way so that we feel at home by spending our time on social media for a long time. The layout placement, likes system, and all other social media interfaces are deliberately designed to make us unable to escape.</p>\n<p>So it takes more effort to get rid of them. We must consciously avoid them. Because if we just trying to avoid them passively, we will be dragged into the system they have designed. So we need to dump them <strong>actively</strong>.</p>\n<p>One way that I think is the most effective is to use apps against apps. There are many apps that we can use to help us get away from social media. I'll give a few:</p>\n<h2 id=\"1.-digital-wellbeing-(android)\">1. <a href=\"https://play.google.com/store/apps/details?id=com.google.android.apps.wellbeing&amp;hl=en_US&amp;gl=US\">Digital Wellbeing</a> (Android) <a class=\"direct-link\" href=\"#1.-digital-wellbeing-(android)\">#</a></h2>\n<p><img src=\"/img/Pasted-image-20210705172129-1.webp\" alt=\"\"></p>\n<p>This is usually already installed by default on Android version Pie and above. I use this to limit my phone usage. This app can give you a look at the total hours of our phone usage, and it is divided per application. So we can see at a glance which applications are taking up the most of our time.</p>\n<p>Then these apps can also limit the use of applications per day. I myself limit Facebook, Twitter, Instagram, and TikTok each 5 minutes per day. This is really helpful, so I never go too far and waste my time mindlessly again.</p>\n<p>Websites on Chrome can also be limited, to prevent us from continuing to Twitter in the browser.</p>\n<p>There is also a Bedtime Mode feature, so the phone automatically enters Do Not Disturb mode and the screen will be black and white when it's night.</p>\n<h2 id=\"2.-rescuetime-(android%2C-pc)\">2. <a href=\"https://rescuetime.com/\">RescueTime</a> (Android, PC) <a class=\"direct-link\" href=\"#2.-rescuetime-(android%2C-pc)\">#</a></h2>\n<p><img src=\"/img/Pasted-image-20210705171815-1-1024x442.webp\" alt=\"\"></p>\n<p>This application also can record the time we spend per application, but it can be synchronized on a phone and on a laptop.</p>\n<p>For those who often use laptops, we can know the total time we spend on laptops and phone in one application. RescueTime also has <a href=\"https://chrome.google.com/webstore/detail/rescuetime-for-chrome-and/bdakmnplckeopfghnlpocafcepegjeap?hl=en-US\">extension for Chrome</a>, to monitor our time on all websites.</p>\n<h2 id=\"3.-limit-(chrome-extension)\">3. <a href=\"https://chrome.google.com/webstore/detail/limit-set-limits-for-dist/blcdfhbibkkjpfdddnmnmhfgjlicebba?hl=en\">Limit</a> (Chrome extension) <a class=\"direct-link\" href=\"#3.-limit-(chrome-extension)\">#</a></h2>\n<p><img src=\"/img/Pasted-image-20210705172824-1-1024x510.webp\" alt=\"\"></p>\n<p>This is an extension that can help us limit the time on a website we visit in Chrome. Similar to Digital Wellbeing earlier, but for Chrome in desktop.</p>\n<p>To complement, there is also <a href=\"https://chrome.google.com/webstore/detail/pause-stop-mindless-brows/ljfdccdjpfjpfjbpdiihanpodiloloph?hl=en\">Pause</a> which gives us a 5 second pause every time we want to open a distracting website like social media, so later we will be lazy to wait and finally won't often visit them anymore.</p>\n<p>In my opinion, these three apps above are enough to help us get away from social media. We can't access social media all the time because it will be banned by them. That's all, now you have to look for other activities.</p>\n",
      "date_published": "2021-07-05T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/lepas-dari-socmed/",
      "url": "https://mufidu.com/lepas-dari-socmed/",
      "title": "Cara Lepas dari Social Media",
      "content_html": "<p><img src=\"/img/pexels-ready-made-3850250.webp\" alt=\"\"></p>\n<p>Kebanyakan aktif di social media bisa bikin kita overwhelmed karena FOMO (fear of missing out). Kita jadi ngerasa harus buka Instagram terus karena takut banget ketinggalan story terakhir temen-temen kita.</p>\n<p>Tapi walaupun kita tau social media punya dampak yang negatif buat kita, kenapa kita tetep buka? Itu karena Instagram, Facebook, dan socmed lainnya itu didesain oleh para insinyur psikologi.</p>\n<p>Mereka ngedesain social media sedemikian rupa biar kita betah lama-lama ngabisin waktu di social media itu. Penempatan layout, sistem likes, dan semua antarmuka social media lainnya emang sengaja didesain buat bikin kita ga bisa lepas.</p>\n<p>Makanya butuh usaha lebih buat bisa lepas dari mereka. Kita harus secara sadar ngehindarin mereka. Kalo kita ikutin aja, kita bakal keseret ke sistem yang udah mereka desain itu.</p>\n<p>Salah satu cara yang menurut gua paling efektif adalah dengan menggunakan apps untuk melawan apps. Ada banyak apps yang bisa kita pake buat ngebantu kita lepas dari social media. Ini gua kasih beberapa:</p>\n<h2 id=\"1.-digital-wellbeing-(android)\">1. <a href=\"https://play.google.com/store/apps/details?id=com.google.android.apps.wellbeing&amp;hl=en_US&amp;gl=US\">Digital Wellbeing</a> (Android) <a class=\"direct-link\" href=\"#1.-digital-wellbeing-(android)\">#</a></h2>\n<p><img src=\"/img/Pasted-image-20210705172129-1.webp\" alt=\"\"></p>\n<p>Ini biasanya udah terinstall default di Android versi Pie ke atas. Gua pake ini buat ngebatesin pemakaian HP gua. Apps ini bisa ngasih liat total jam penggunaan HP kita, dan dibagi per aplikasi. Jadi kita bisa liat secara sekilas aplikasi mana yang paling nyedot waktu kita.</p>\n<p>Terus apps ini juga bisa ngelimit penggunaan aplikasi per hari. Kalo gua ngebatesin Facebook, Twitter, Instagram, sama TikTok masing-masing 5 menit per hari. Ini ngebantu banget sih, gua jadi ga pernah kebablasan lagi.</p>\n<p>Website di Chrome juga bisa dilimit, buat ngehindarin kita lanjutin twitteran di browser.</p>\n<p>Ada juga fitur Bedtime Mode, jadi HP otomatis masuk mode Do Not Disturb dan layar hitam putih kalo udah malem.</p>\n<h2 id=\"2.-rescuetime-(android%2C-pc)\">2. <a href=\"https://rescuetime.com/\">RescueTime</a> (Android, PC) <a class=\"direct-link\" href=\"#2.-rescuetime-(android%2C-pc)\">#</a></h2>\n<p><img src=\"/img/Pasted-image-20210705171815-1-1024x442.webp\" alt=\"\"></p>\n<p>Aplikasi ini juga fitur utamanya ngerekam waktu yang kita habisin per aplikasi, tapi bisa sinkron buat di HP sama di laptop.</p>\n<p>Buat yang sering pake laptop, kita jadi bisa tau total waktu yang kita habisin di laptop sama HP di satu aplikasi. RescueTime juga punya <a href=\"https://chrome.google.com/webstore/detail/rescuetime-for-chrome-and/bdakmnplckeopfghnlpocafcepegjeap?hl=en-US\">ekstensi buat Chrome</a>, buat monitor waktu kita di semua website.</p>\n<h2 id=\"3.-limit-(chrome-extension)\">3. <a href=\"https://chrome.google.com/webstore/detail/limit-set-limits-for-dist/blcdfhbibkkjpfdddnmnmhfgjlicebba?hl=en\">Limit</a> (Chrome extension) <a class=\"direct-link\" href=\"#3.-limit-(chrome-extension)\">#</a></h2>\n<p><img src=\"/img/Pasted-image-20210705172824-1-1024x510.webp\" alt=\"\"></p>\n<p>Kalau ini extension yang bisa bantu kita limit waktu di suatu website yang dibuka di Chrome. Mirip kaya Digital Wellbeing tadi.</p>\n<p>Buat ngelengkapin, ada juga <a href=\"https://chrome.google.com/webstore/detail/pause-stop-mindless-brows/ljfdccdjpfjpfjbpdiihanpodilolofh?hl=en\">Pause</a> yang ngasih jeda dulu 5 detik tiap kita mau buka website yang ngeganggu kaya social media, jadinya kita bakal males nungguin dan akhirnya gajadi buka.</p>\n<p>Tiga apps tadi menurut gua cukup sih buat ngebantu kita lepas dari social media. Kita jadi gabisa ngakses social media terus-terusan soalnya dibatesin. Secara ga langsung jadi harus cari kegiatan lain.</p>\n",
      "date_published": "2021-07-05T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/bored/",
      "url": "https://mufidu.com/bored/",
      "title": "The Good Part of Being Bored",
      "content_html": "<p><img src=\"/img/pexels-photo-4114905.webp\" alt=\"bored\"></p>\n<p>It seems like everyone have experienced suddenly thought of a really cool idea or plan when they were taking a shower, taking a relaxing walk, or whenever the brain was not in the focus state.</p>\n<p>Actually, there is an explanation. Watch this video below. I highly recommend it if you haven't watched it before.</p>\n<p><a href=\"https://www.youtube.com/watch?v=Hu4Yvq-g7_Y&amp;t=261s\">https://www.youtube.com/watch?v=Hu4Yvq-g7_Y&amp;t=261s</a></p>\n<p>It explains that,</p>\n<blockquote>\n<p>Our brain will come up with cool ideas and plans when we relax and aren't thinking about anything.</p>\n</blockquote>\n<p>&quot;Not thinking about anything&quot; is a condition that we usually know as &quot;bored&quot;. Yeah, it sounds quiet negative. It doesn't feel very productive, because we think there must be something we can do instead of being idle and just lying on the sofa.</p>\n<p>So we keep being busy, keep on opening the laptop, scrolling Twitter for fear of missing out on information, and a myriad of other activities that keep our brains working to avoid being &quot;bored&quot;.</p>\n<p>Even though in fact, if our brains are forced to be busy and work continuously, <mark>it will not have the opportunity to process the inputs that we have received</mark>, and produce ideas and plans that can be useful for us.</p>\n<p>I myself really feel the effects of this boredom. Actually, almost all of my writings come from my brain when I'm not using it for hard task, and then suddenly thoughts-that-are-a-pity-to-be-forgotten come, which I finally write and share here.</p>\n<p>Once, for a month I was really focused on completing an online course, and in that month I finally didn't write any single post like this. And I just realized that it is the reason. I didn't give my brain its &quot;me time&quot;.</p>\n<p>But too much bored are also not good, for sure. We still need input, such as reading a book, learning new things, or completing an online course. Because our brains need materials to be processed.</p>\n<p>Also try to complete our work as much as possible, so that we can set aside time for &quot;boring&quot;. Focus. Don't put your cellphone nearby when you're working. There is research that says that our brain can only focus <strong>40 seconds</strong> when there is a cellphone near us.</p>\n<p>But why are we so easily tempted to open our phone? Because our brains really like things that are fun and easy to do. That's our natural behavior. But we can try to break free from our phone every now and then to get rid of the reflex habit of opening your phone when your hands are empty.</p>\n<p>There is a term <mark>scatter focus</mark>, which means &quot;bored&quot; on purpose. We can do this instead of keep scrolling our phone, letting our brains wander while generating ideas for us. See also <a href=\"/dopamine/\">dopamine detox</a>.</p>\n<p>If you're stuck doing something, try forcing yourself to go for a walk, so that your brain can also go for a walk, see your problem from another point of view and ✨, suddenly the solution is found for you.</p>\n<p><mark>Embrace the boredom!</mark></p>\n",
      "date_published": "2021-06-21T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/bosen/",
      "url": "https://mufidu.com/bosen/",
      "title": "Bosen Itu Baik, Beneran",
      "content_html": "<p><img src=\"/img/pexels-photo-4114905.webp\" alt=\"bored\"></p>\n<p>Semua orang kayanya pernah tiba-tiba kepikiran ide atau rencana yang keren banget pas lagi mandi, jalan santai, atau kapan pun pas otak lagi ga fokus.</p>\n<p>Sebenernya itu ada penjelasannya. Coba tonton deh video ini.</p>\n<p><a href=\"https://www.youtube.com/watch?v=Hu4Yvq-g7_Y&amp;t=261s\">https://www.youtube.com/watch?v=Hu4Yvq-g7_Y&amp;t=261s</a></p>\n<p>Di situ dijelasin kalo,</p>\n<blockquote>\n<p>Otak kita emang bakal ngehasilin ide dan rencana-rencana keren kalo kita lagi santai dan ga mikirin apa-apa.</p>\n</blockquote>\n<p>Kondisi &quot;ga mikirin apa-apa&quot; itu yang biasa kita kenal dengan nama &quot;bosen&quot;. Ya emang keliatannya negatif ya bosen itu. Rasanya ga produktif banget, karena kita mikirnya pasti ada sesuatu yang bisa dikerjain daripada nganggur liatin jalan.</p>\n<p>Jadilah kita sibuk terus, lanjut buka laptop, scroll Twitter takut ketinggalan info, dan segudang kegiatan lain yang bikin otak kita kerja terus buat ngehindarin &quot;bosen.&quot;</p>\n<p>Padahal kalo otak kita paksa sibuk dan kerja terus, <mark>otak jadi gapunya kesempatan buat ngolah input yang udah kita terima</mark>, dan ngehasilin ide-ide dan rencana yang bisa guna buat kita.</p>\n<p>Saya sendiri ngerasain banget efek dari bosen ini. Sebenernya hampir semua tulisan saya itu berasal dari otak saya yang lagi gabut, dan tiba-tiba munculin pikiran-pikiran yang sayang kalo dilupain, yang akhirnya saya tulis dan share di sini.</p>\n<p>Pernah satu bulan saya fokus banget nyelesain satu online course, dan di bulan itu akhirnya saya gada satu pun nulis kaya gini. Dan saya baru sadar ternyata penyebabanya ini. Ga ngasih otak &quot;me time&quot;.</p>\n<p>Tapi kebanyakan bosen juga ga baik pastinya. Kita tetep butuh inputan kaya baca buku, belajar hal baru, atau selesain online course. Karena otak kita butuh bahan buat diolah.</p>\n<p>Usahain juga buat nyelesain kerjaan kita semaksimal mungkin, biar bisa nyisihin waktu buat &quot;bosen&quot;. Fokus. Jangan taro HP di deket kita kalo lagi kerja. Ada riset yang bilang kalo otak kita cuman bisa fokus <strong>40 detik</strong> kalo ada HP di deket kita.</p>\n<p>Tapi kenapa kita gampang banget tergiur buka HP? Karena otak kita emang suka hal-hal yang nyenengin dan gampang dilakuin. Coba sesekali bebasin diri dari HP buat ngilangin kebiasaan reflek buka HP kalo tangan lagi kosong.</p>\n<p>Ada istilah <em>scatter focus</em>, yaitu &quot;bosen&quot; dengan sengaja. Kita bisa lakuin ini daripada buka HP terus, biarin otak kita nerawang sambil ngehasilin ide buat kita. Sempetin juga <a href=\"/dopamin/\">dopamine detox</a>.</p>\n<p>Kalo lagi <em>stuck</em> ngerjain sesuatu, coba paksain buat jalan-jalan dulu, biar otak kita juga bisa jalan-jalan, ngeliat masalah kita dari sudut pandang lain dan ✨, tiba-tiba solusinya ketemu.</p>\n<p><mark>Embrace the boredom!</mark></p>\n",
      "date_published": "2021-06-21T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/wordpress-optimization/",
      "url": "https://mufidu.com/wordpress-optimization/",
      "title": "Getting The Perfect Score with Wordpress",
      "content_html": "<p><img src=\"/img/stephen-phillips-hostreviews-co-uk-sSPzmL7fpWc-unsplash.webp\" alt=\"wordpress\"></p>\n<blockquote>\n<p>This post is written when I was still using Wordpress. I'm no longer using it, but I think the experience is still worth sharing and still relevant.</p>\n</blockquote>\n<p>It's been about a year since I've hosted my blog on Blogger. All I need to do is just write and publish. I don't need to worry about the configuration because it's all done for me. There is not much we can customize in Blogger either.</p>\n<p>Because I want to be able to optimize this blog (and I really want to mess up the configs), I then bought a cheap hosting and move the blog to Wordpress.</p>\n<p>The process is not simple, as I can expect. I spent about 5 days to finish setting up the blog on WordPress, as I'm actually new to cPanel et al.</p>\n<p>Every day I focus on working on one aspect, the first day is setting up hosting, continuing to install and set up WordPress for the first time, continue to install Themes, continue to install plugins, and finally SEO.</p>\n<p>I spend most of my time browsing, there are lots of tools that can be used and I have to choose the best one. I prioritize the speed to be as high as possible, because I use shared hosting, so it has to be optimal.</p>\n<p>Now I want to share some of the configurations that I use on this blog, who knows, it might save time for people who need it. It can also be a guide for those who want to move or just want to try WordPress on their blog.</p>\n<h2 id=\"installing-wordpress\">Installing Wordpress <a class=\"direct-link\" href=\"#installing-wordpress\">#</a></h2>\n<p>First, what you have to do is install the WordPress. Usually hosting providers already provide Softaculous on cPanel so that you can install WordPress in one click.</p>\n<p>But if it doesn't exist, you can install it yourself, download the files you need and upload them to your hosting via FTP. There is a complete guide on the <a href=\"https://wordpress.org\">Wordpress official website</a>.</p>\n<h2 id=\"installing-theme\">Installing theme <a class=\"direct-link\" href=\"#installing-theme\">#</a></h2>\n<p>Secondly, after installing WordPress, in my opinion, the best thing to do is to select and install a theme. There are so many choices, some are free, some are paid. But there are a lot of free ones that are good, we just need to modify it.</p>\n<p>The difference between free and paid themes is that they are usually can be highly customized, sometimes if there is a paid version of the theme, the free version is very limited if you want to customize it.</p>\n<p>Make your own choice of theme depending on your individual needs. What do you want to prioritize first? For me, the important thing is that it's light (the size is small) and can be modified until I like it.</p>\n<p>The choices at that time were <a href=\"https://wordpress.org/themes/astra/\">Astra</a> and <a href=\"https://wordpress.org/themes/neve/\">Neve</a>, but in the end I chose Neve because it was more suitable for me.</p>\n<p>When you modify the theme, keep in mind that everything is must be easy to read, the navigation is clear (users must know how to get back to Home), and the menu doesn't get crowded.</p>\n<p>I myself deleted the menu on the right sidebar, so that when a user is reading a post, they just see the post. Then, I created a new page to display categories.</p>\n<p>If you want, before modifying the Theme you can make a <a href=\"https://codeable.io/what-is-a-child-theme-wordpress/#:~:text=A%20child%20theme%20is%20a,of%20modifying%20an%20existing%20theme.\">Child Theme</a> first, so that when the Theme is updated, your modifications will not be lost.</p>\n<h2 id=\"installing-plugins\">Installing Plugins <a class=\"direct-link\" href=\"#installing-plugins\">#</a></h2>\n<p>Third, plugins. One of the things that makes Wordpress superior to Blogger is these plugins. We can add features that don't exist in the default Wordpress, without having to understand coding.</p>\n<p>In addition to adding features, plugins are also important for optimizing our blog, especially in speed.</p>\n<p>There are lots of plugins that we can install to add features to our website. But if we install a lot, the web can actually be slow, or even worse, the plugins clash with each other. Sometimes there are problems because the plugins don't match each other.</p>\n<p>It will be better if we just use some of them, according to what we prioritize, like when we chose the theme earlier. For example, if we make this website as just a landing page, we don't need to install a comment plugin like Disqus.</p>\n<p>For blogs, I will give some recommendations for plugins, that I use here. I group them according to their function.</p>\n<h3 id=\"caching\">Caching <a class=\"direct-link\" href=\"#caching\">#</a></h3>\n<p>By default if we access a web that use Wordpress, the server will build the web from scratch, each visit. Now this cache provides the finished web version, so the server doesn't have to build from scratch every time we open the web.</p>\n<p>This of course reduces the load on our servers because it doesn't have to do many process to display the web in the browser.</p>\n<p>For caching, I've tried a lot of plugins, first I tried <a href=\"https://wordpress.org/plugins/w3-total-cache/\">W3 Total Cache</a> because they say it has the most complete features. Then I moved to <a href=\"https://wordpress.org/plugins/wp-super-cache/\">WP Super Cache</a> because the settings are simpler, so it minimizes the possibility of conflicts with other plugins.</p>\n<p>But in the end, I found out that my hosting uses Litespeed Web Server and it says that it will be more optimal if I use <a href=\"https://id.wordpress.org/plugins/litespeed-cache/\">Litespeed Cache</a>, so until now I'm using it.</p>\n<p>After I explored again, there is one cooler cache plugin, so it can save our cache on Cloudflare's CDN automatically. CDN is like a backup hosting that exists everywhere, so our website can be opened smoothly even by people from different continents, too.</p>\n<p>Well, it's usually really complicated to set up a CDN like that, that's why I immediately installed it as soon as there was <a href=\"https://wordpress.org/plugins/wp-cloudflare-page-cache/\">WP Cloudflare Super Page Cache</a>. Just connect your Cloudflare account, and this plugin will do the rest.</p>\n<p>For the setup, I followed <a href=\"https://webspeedtools.com/litespeed-cache-cloudflare/\">this guide</a>, which explains the details. Actually, it is recommended to turn off Litespeed Cache if you already use this plugin, to avoid conflict on the caching. But we can be set them up so that the local cache remains from the Litespeed plugin and then deployed to Cloudflare by the WP Cloudflare Super Page Cache. Just try it and find which works best for you.</p>\n<h3 id=\"security\">Security <a class=\"direct-link\" href=\"#security\">#</a></h3>\n<p>Initially I installed <a href=\"https://wordpress.org/plugins/all-in-one-wp-security-and-firewall/\">All in One WP Security</a>, but then I can't login to the admin page. So I replaced it with <a href=\"https://wordpress.org/plugins/jetpack/\">Jetpack</a> and <a href=\"https://wordpress.org/plugins/akismet/\" title=\"https://wordpress.org/plugins/akismet/\">Akismet</a>.</p>\n<p>The Jetpack plugin actually has a lot of <a href=\"https://jetpack.com/support/features/\">features</a>, but I only use the security features (anti brute-force), related posts, and for commenting system. Akismet is for anti-spam.</p>\n<h3 id=\"seo\">SEO <a class=\"direct-link\" href=\"#seo\">#</a></h3>\n<p>To increase rankings in Google Search, we can use <a href=\"https://wordpress.org/plugins/all-in-one-seo-pack/\">All in One SEO</a>, it has complete features, just install and follow the guide .</p>\n<p>And because my blog is also moved from Blogger, the URL that links to the old Blogger post must also be redirected so that when users still access, they don't get a 404 error. It's important, because your rank will drop if there is 404s in your website. I used <a href=\"https://wordpress.org/plugins/redirection/\">Redirection</a> for handling theme.</p>\n<h3 id=\"optimization\">Optimization <a class=\"direct-link\" href=\"#optimization\">#</a></h3>\n<p>Before the file is cached, it should be optimized first, especially images and static files (CSS, JavaScript) that can be minified. I use <a href=\"https://wordpress.org/plugins/autoptimize/\">Autoptimize</a>, this plugin is most likely will not conflict with other plugins, because many people are using it.</p>\n<p>In the Litespeed Cache settings, there is actually an option to minify and optimize images, so I use both. Autoptimize to optimize HTML, CSS, JavaScript. Litespeed Cache to optimize the image.</p>\n<h3 id=\"addition\">Addition <a class=\"direct-link\" href=\"#addition\">#</a></h3>\n<p>I also installed <a href=\"https://wordpress.org/plugins/amp/\">AMP</a> to make the web mobile-friendly, and <a href=\"https://wordpress.org/plugins/updraftplus/\">UpdraftPlus</a> for backup purposes.</p>\n<hr>\n<p>Done. Don't install too many plugins, they will bloat your site and they can clash. Installing everything that I mentioned earlier is more than enough. Using them, this blog can already get a pretty good score in tests.</p>\n<p><img src=\"/img/lighthouse.webp\" alt=\"pagespeed test result\"><br>\n<img src=\"/img/gtmetrix.webp\" alt=\"gtmetrix test result\"></p>\n<p>But this site is usually reach the maximum results in the second test. The problem is that in the first test sometimes the caching has not been completed. Yes, there are still many things that can be optimized, that's one of them. But I think it's enough today.</p>\n",
      "date_published": "2021-05-23T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/optimasi-wordpress/",
      "url": "https://mufidu.com/optimasi-wordpress/",
      "title": "Optimasi Wordpress untuk Blog",
      "content_html": "<p><img src=\"/img/stephen-phillips-hostreviews-co-uk-sSPzmL7fpWc-unsplash.webp\" alt=\"wordpress\"></p>\n<blockquote>\n<p>Tulisan ini ditulis pas saya masih pakai Wordpress. Sekarang saya udah gapakai lagi, tapi tulisan ini masih tetap relevan buat yang masih atau baru pakai Wordpress.</p>\n</blockquote>\n<p>Udah sekitar setaun lah saya host blog saya di Blogger, saya cuman tinggal nulis upload nulis upload, gausah setting apa-apa karena emang gabisa juga.</p>\n<p>Karena pengen bisa ngoptimasiin blog ini (dan emang seneng ngoprek aja), saya nyoba buat beli hosting dan pindahin blog ke Wordpress.</p>\n<p>Prosesnya ga simpel. Saya ngabisin sekitar 5 harian lah buat selesai set up blog di Wordpress, karena saya juga emang baru di cPanel dkk.</p>\n<p>Tiap hari saya fokus ngerjain satu aspek, hari pertama set up hosting, lanjut install dan set up Wordpress pertama kali, terus install Themes, lanjut install plugins, dan yang terakhir SEO.</p>\n<p>Sebagian besar waktunya sih saya abisin buat browsing, banyak banget tools yang bisa dipake dan saya harus milih yang terbaik. Saya ngutamain speed pokonya harus setinggi mungkin, soalnya saya pakai shared hosting, jadi harus optimal.</p>\n<p>Sekarang saya mau share beberapa konfigurasi yang saya pakai di blog ini, siapa tau bisa hemat waktu orang yang lagi butuh. Bisa jadi panduan juga buat yang mau pindah atau baru mau coba Wordpress di blognya.</p>\n<h2 id=\"install-wordpress\">Install Wordpress <a class=\"direct-link\" href=\"#install-wordpress\">#</a></h2>\n<p>Pertama, yang harus dilakuin ya install Wordpressnya. Biasanya provider hosting udah nyediain Softaculous di cPanel biar bisa install Wordpress sekali klik.</p>\n<p>Tapi kalo emang gada, bisa install sendiri, download file yang dibutuhin dan upload ke hosting lewat FTP. Ada panduan lengkapnya di <a href=\"https://wordpress.org\">web resmi Wordpress</a>.</p>\n<h2 id=\"pasang-theme\">Pasang theme <a class=\"direct-link\" href=\"#pasang-theme\">#</a></h2>\n<p>Kedua, selesai install Wordpress, menurut saya yang paling baik dilakuin itu pilih dan pasang satu Theme. Banyak banget pilihannya, ada yang gratis, ada yang bayar. Tapi yang gratis aja udah banyak yang bagus ko, tinggal gimana modifikasi kita aja.</p>\n<p>Yang ngebedain Theme yang gratis sama yang bayar itu biasanya di kustomisasinya, kadang kalau Themenya ada yang versi berbayar, versi gratisnya dibatesin banget kalo mau dimodif.</p>\n<p>Buat pilihan Theme sendiri tergantung ke kebutuhan masing-masing ya. Apa dulu yang mau diprioritasin. Kalo saya sih yang penting harus enteng (ga gede filenya) dan bisa dimodif sampe saya suka.</p>\n<p>Pilihannya waktu itu ada <a href=\"https://wordpress.org/themes/astra/\">Astra</a> sama <a href=\"https://wordpress.org/themes/neve/\">Neve</a>, tapi akhirnya pakai Neve soalnya lebih cocok aja.</p>\n<p>Pas modif Theme, kalo bisa utamain biar semuanya gampang dibaca, navigasi jelas (jangan sampe bikin bingung cara balik ke Home gimana), dan ga sumpek kebanyakan menu.</p>\n<p>Saya sendiri ngehapus menu yang di sidebar kanan, biar pas lagi di post itu yang keliatan cuman postnya aja. Saya buat page baru buat nampilin kategori.</p>\n<p>Kalo mau dan bisa, sebelum modif Theme bikin <a href=\"https://codeable.io/what-is-a-child-theme-wordpress/#:~:text=A%20child%20theme%20is%20a,of%20modifying%20an%20existing%20theme.\">Child Theme</a>nya dulu, biar nanti kalo Themenya diupdate, ga modif lagi dari awal.</p>\n<h2 id=\"install-plugins\">Install Plugins <a class=\"direct-link\" href=\"#install-plugins\">#</a></h2>\n<p>Ketiga, plugins. Salah satu yang bikin unggul Wordpress daripada Blogger ya plugins ini. Kita jadi bisa nambahin fitur-fitur yang gada di bawaan Wordpressnya, tanpa harus ngerti coding-codingan.</p>\n<p>Selain nambah fitur, plugins juga penting buat ngoptimalin blog kita, terutama di kecepatan loading (speed).</p>\n<p>Ada banyak banget plugins yang bisa kita pasang buat nambah fitur di web kita. Tapi kalo kita install kebanyakan, web malah bisa jadi lelet, atau yang lebih parah pluginnya bentrokan satu sama lain. Kadang suka ada aja masalah gara-gara plugin yang saling ga cocok gitu.</p>\n<p>Bakal lebih bagus kalo kita install secukupnya aja, sesuain sama apa yang kita utamain, kaya pas milih Theme tadi. Misalnya, kalo kita buat web ini cuman jadi landing page aja, ga perlu install plugin comment kaya Disqus.</p>\n<p>Buat blog, saya bakal kasih beberapa rekomendasi plugins, apa aja semua yang saya pakai di sini. Saya kelompokin berdasarkan fungsinya ya.</p>\n<h3 id=\"caching\">Caching <a class=\"direct-link\" href=\"#caching\">#</a></h3>\n<p>Secara default kalo kita ngakses web yang pakai Wordpress, server bakal ngerender webnya dari awal. Nah cache ini nyediain versi web yang udah jadinya, jadi server ga harus ngerender dari awal tiap kita buka web itu.</p>\n<p>Ini pastinya ngeringanin beban server kita soalnya jadi gabanyak proses yang harus dijalanin buat nampilin web di browser.</p>\n<p>Buat caching, saya udah nyoba banyak plugins, pertama saya coba <a href=\"https://id.wordpress.org/plugins/w3-total-cache/\">W3 Total Cache</a> soalnya katanya fiturnya paling lengkap. Lalu, saya pindah ke <a href=\"https://id.wordpress.org/plugins/wp-super-cache/\">WP Super Cache</a> karena settingannya lebih simpel, jadi ngecilin kemungkinan bentrok sama plugin lain.</p>\n<p>Tapi akhirnya saya nemu kalo hosting saya itu pakai Litespeed Web Server dan katanya paling optimal kalo plugin cachenya pakai <a href=\"https://id.wordpress.org/plugins/litespeed-cache/\">Litespeed Cache</a>, jadi sampe sekarang saya pakai itu.</p>\n<p>Setelah saya explore lagi, ada satu plugin cache lagi yang keren, jadi dia bisa nyimpen cache kita di CDN Cloudflare secara otomatis. CDN itu kaya hosting backingan yang ada dimana-mana, jadi web kita bisa dibuka lancar juga sama orang yang beda benua.</p>\n<p>Nah biasanya ribet banget kalo mau set up CDN gitu gitu, makanya saya langsung install begitu ada <a href=\"https://wordpress.org/plugins/wp-cloudflare-page-cache/\">WP Cloudflare Super Page Cache</a>. Tinggal hubungin akun Cloudflare, sisanya dia yang ngerjain.</p>\n<p>Buat setupnya, saya ngikutin <a href=\"https://webspeedtools.com/litespeed-cache-cloudflare/\">panduan ini</a>, yang ngejelasin detail-detailnya. Sebenernya direkomendasiin buat matiin Litespeed Cache kalo udah pakai plugin itu, biar ga numpuk yang ngerjain cachenya. Tapi bisa juga disetting biar cache lokalnya tetep dari plugin Litespeed, coba-coba aja.</p>\n<h3 id=\"security\">Security <a class=\"direct-link\" href=\"#security\">#</a></h3>\n<p>Awalnya saya install <a href=\"https://wordpress.org/plugins/all-in-one-wp-security-and-firewall/\">All in One WP Security</a>, tapi gatau kenapa saya malah gabisa login. Jadi saya uninstall itu, ganti pakai <a href=\"https://wordpress.org/plugins/jetpack/\">Jetpack</a> sama <a href=\"https://wordpress.org/plugins/akismet/\">Akismet</a>.</p>\n<p>Jetpack ini sebenernya ada banyak banget <a href=\"https://jetpack.com/support/features/\">fiturnya</a>, tapi yang saya pakai cuman securitynya (anti brute force), related post, sama buat commentnya aja. Kalo Akismet itu buat anti spam.</p>\n<h3 id=\"seo\">SEO <a class=\"direct-link\" href=\"#seo\">#</a></h3>\n<p>Buat ningkatin peringkat di Google Search, kita bisa pakai <a href=\"https://wordpress.org/plugins/all-in-one-seo-pack/\">All in One SEO</a>, fiturnya lengkap, tinggal install terus ikutin aja saran-sarannya.</p>\n<p>Dan karena blog saya ini juga pindahan dari Blogger, link yang ngehubungin postnya juga harus diredirect biar kalo diakses ga error 404, kalo ga bisa drop banget ranknya. Buat ini saya pakai <a href=\"https://wordpress.org/plugins/redirection/\">Redirection</a>.</p>\n<h3 id=\"optimization\">Optimization <a class=\"direct-link\" href=\"#optimization\">#</a></h3>\n<p>Sebelum file dicache, harusnya bisa dioptimalin dulu, terutama gambar sama static filenya (CSS, JavaScript) yang bisa diminify. Saya pakai <a href=\"https://wordpress.org/plugins/autoptimize/\">Autoptimize</a>, plugin ini banyak banget yang make jadi ga bentrok sama plugin lain, soalnya emang udah bisa kerja bareng dari sananya.</p>\n<p>Di settingan Litespeed Cache juga sebenernya bisa ngeminify sama ngoptimasiin gambar, jadi saya pakai dua-duanya. Autoptimize buat optimalin HTML, CSS, JavaScript. Litespeed Cache buat optimalin gambarnya.</p>\n<h3 id=\"tambahan\">Tambahan <a class=\"direct-link\" href=\"#tambahan\">#</a></h3>\n<p>Saya juga install <a href=\"https://wordpress.org/plugins/amp/\">AMP</a> buat bikin web jadi mobile-friendly, sama <a href=\"https://wordpress.org/plugins/updraftplus/\">UpdraftPlus</a> buat keperluan backup.</p>\n<hr>\n<p>Selesai. Plugins yang diinstall jangan banyak-banyak, nanti malah jadi beban doang sama bisa bentrok. Install semua yang tadi aja udah lebih dari cukup. Blog ini udah bisa dapet nilai yang lumayan kalo dites.</p>\n<p><img src=\"/img/lighthouse.webp\" alt=\"hasil tes lighthouse\"><br>\n<img src=\"/img/gtmetrix.webp\" alt=\"hasil tes gtmetrix\"></p>\n<p>Tapi test itu biasanya baru maksimal hasilnya di tes kedua. Soalnya di tes pertama kadang cachingnya belum selesai. Ya emang masih banyak banget sih yang bisa dioptimalin, itu salah satunya. Kalo dibandingin sama pas awal tadi, ini sih udah cukup lah ya.</p>\n",
      "date_published": "2021-05-23T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/advice/",
      "url": "https://mufidu.com/advice/",
      "title": "Don&#39;t Ask Advice from The Expert",
      "content_html": "<p><img src=\"/img/neonbrand-y_6rqStQBYQ-unsplash.webp\" alt=\"\"></p>\n<p>For people who are new in a field, the most effective way to grow is to ask for advice from people who are already considered good at that field, as many said.</p>\n<p>If you want to start a business, then seek advice from Sandiaga Uno or Erick Thohir. If you want to be good at writing, follow Tere Liye. If you want to be singer, ask Raisa.</p>\n<p>But actually, <mark>their suggestions may not even be relevant for us</mark>. Why?</p>\n<p>No offense, but they are already far above our level, so all the steps, tactics, strategies they use are also at a different level from us. Doesn't even fit.</p>\n<p>The things that are important for beginners like us, they probably don't know anymore. They have been in their field for a long time and <strong>no longer need</strong> to go through the &quot;beginners&quot; period.</p>\n<p>Even if they still know, usually there must be certain conditions that we must fulfill first if we want to carry out their advice. And yes, it just mean that it doesn't fit with us.</p>\n<p>As beginners we should need advice that is practical, can be done and proven to have an effect on our growth.</p>\n<p>In my opinion, such rich suggestions can only be obtained from people who are <mark>slightly</mark> above us.</p>\n<p>They've passed everything we will be through, but not too far. Just a step or two ahead of us.</p>\n<p>So they still really understand what is important and what beginners really need to do, so we can grow well without having to go through the problems they have gone through.</p>\n<p>They can guide us so we don't fall into the same hole they've been in.</p>\n<p>And for people who are already legend at the field, the hole they've been before may have been closed a long time ago, thus irrelevant to us.</p>\n",
      "date_published": "2021-05-09T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/saran/",
      "url": "https://mufidu.com/saran/",
      "title": "Jangan Minta Saran ke Ahlinya",
      "content_html": "<p><img src=\"/img/neonbrand-y_6rqStQBYQ-unsplash.webp\" alt=\"\"></p>\n<p>Buat orang yang lagi ngegelutin bidang baru, cara paling efektif buat berkembang adalah dengan minta saran ke orang yang udah dianggep jago di bidang itu, katanya.</p>\n<p>Kalau mau mulai bisnis, ya cari-cari nasehat dari Sandiaga Uno atau Erick Thohir. Kalau mau jago nulis, contoh Tere Liye. Kalau mau karier nyanyi, tanya Raisa.</p>\n<p>Tapi sebenernya, <mark>saran-saran dari mereka bisa jadi malah ga relevan buat kita</mark>.</p>\n<p>No offense, tapi mereka udah jauh levelnya di atas kita, jadi semua langkah, taktik, strategi yang mereka pake juga levelnya beda sama kita. Ga cocok.</p>\n<p>Hal-hal yang penting buat pemula kaya kita, mereka mungkin udah gatau lagi. Mereka kan udah lama mulai di bidangnya dan ga perlu lagi ngejalanin masa-masa &quot;pemula&quot;.</p>\n<p>Kalaupun masih tau, biasanya saran dari mereka itu kalo mau dijalanin, harus ada syarat yang kita penuhin dulu. Dan ya sama aja berati ga cocok kan.</p>\n<p>Sebagai pemula kita harusnya butuh saran yang praktis, bisa dilakuin dan terbukti ngefek ke perkembangan kita.</p>\n<p>Saran-saran yang kaya gitu menurut gua cuman bisa didapet dari orang-orang yang ada <mark>sedikit</mark> di atas kita.</p>\n<p>Mereka udah ngelewatin apa-apa yang kita jalanin, tapi ga terlalu jauh. Satu atau dua langkah aja di depan kita.</p>\n<p>Jadi mereka masih paham bener apa-apa yang penting dan harus banget dilakuin orang baru, supaya bisa berkembang dengan baik tanpa harus ngelewatin masalah-masalah yang udah mereka lewatin.</p>\n<p>Mereka bisa nuntun kita biar ga jatuh di lubang yang sama yang pernah mereka masukin.</p>\n<p>Dan buat orang yang udah jago, lubang yang mereka masukin dulu mungkin udah ketutup dari lama, udah gada lagi.</p>\n",
      "date_published": "2021-05-09T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/what-to-read/",
      "url": "https://mufidu.com/what-to-read/",
      "title": "How to Pick What to Read Next",
      "content_html": "<p><img src=\"/img/2aa91-pexels-ma25c325abl-balland-3457273.webp\" alt=\"kid-reading\"></p>\n<p>We can be whatever we want if we read a lot. Elon Musk, founder of SpaceX who is now <a href=\"https://www.bbc.com/news/technology-55578403#:~:text=Elon%20Musk%20has%20become%20the,had%20held%20it%20since%202017.\">the richest person in the world</a>, when asked how he understood the world of rocketry, his answer was, &quot;I read books&quot;.</p>\n<p>Almost all billionaires in the world are people who really love to read books. Warren Buffet claims he reads <a href=\"http://www.usatoday.com/story/money/personalfinance/2014/08/24/peculiar-habits-of-successful-people/14447531/\">500 pages per day</a>, Bill Gates reads <a href=\"http://www.businessinsider.com/why-bill-gates-reads-50-books-a-year-2015-11\">50 books per year</a>, and Mark Zuckerberg finishes <a href=\"http://www.businessinsider.com/end-of-year-mark-zuckerberg-book-recommendations-2015-12/#the-idea-factory-bell-labs-and-the-\">one book per two weeks</a>.</p>\n<p>That's a lot. I guess it's time for us to start to love reading, too. Especially in this age, almost all books already have its digital version and we can read it anytime, anywhere, as long as we hold our cellphone. It's not just books, there are also lots of cool articles that we can find on the internet, it's just a matter of whether we want to read it or not.</p>\n<p>But, there one common excuse for all of us, which is <mark><strong>&quot;I don't have the time&quot;</strong></mark>. It's true, beside that it's just us who don't want to spend the time, no matter what, our time in this world is indeed limited. We can't read all the books or articles in the world.</p>\n<p>So we have to make the best use of the time we have by reading what we really need, at the present, not later. Don't bait the cool article title and think &quot;Who knows, I might need this later, let's read.&quot;</p>\n<p>Prioritize looking for any information that can provide the greatest benefit to us <strong>now</strong>, not tomorrow, or the day after. Because with the many streams of information available on the internet, the information &quot;we'll need later&quot; is countless.</p>\n<p>We don't need an investment guide if we are still students and have no income. It's better to find out how to get the maximum possible outcome at that time.</p>\n<p>And if, for example, we find an article or book that relates to us, but it doesn't meet our expectations, just leave it. If the first paragraphs are not interesting enough, don't expect the rest will be good.</p>\n<p>Charles Munger, Warren Buffet's partner once said,</p>\n<blockquote>\n<p>&quot;Most books I don't read past the first chapter. I'm not burdened by bad books,&quot;</p>\n</blockquote>\n<p>and this is true. We can find many other books that can satisfy our thirst.</p>\n<p>However, some people say that if we only read books that most people read, we will also have thoughts like most people. So maybe we should open our mind and don't limit our input, but still, because of our limited time, we also need a strong filter to choose what we will finish.</p>\n<p>It's not &quot;we can't read everything&quot;, but <strong>&quot;we can't finish everything&quot;</strong>. It will be an advantage for us if we can know not just one, but from many points of view. And we also need to filter our reading so that our time is not wasted.</p>\n<p><mark>Increase the input, strengthen the filter.</mark></p>\n<p>This article was created with the initial idea from ​​<a href=\"https://www.samuelthomasdavies.com/words-into-works/june-25-2020/\">here</a> and <a href=\"http://www.collaborativefund.com/blog/how-to-read-lots-of-inputs-and-a-strong-filter/\">here</a>.</p>\n",
      "date_published": "2021-01-27T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/baca-apa-ya/",
      "url": "https://mufidu.com/baca-apa-ya/",
      "title": "Cara Memilih Bacaan",
      "content_html": "<p><img src=\"/img/2aa91-pexels-ma25c325abl-balland-3457273.webp\" alt=\"anak-baca-buku\"></p>\n<p>Kita bisa jadi apa aja yang kita mau kalo banyak baca. Elon Musk, founder SpaceX yang sekarang adalah <a href=\"https://www.bbc.com/news/technology-55578403#:~:text=Elon%20Musk%20has%20become%20the,had%20held%20it%20since%202017.\">orang terkaya di dunia</a>, ketika ditanya gimana dia bisa paham dunia peroketan, jawabannya, &quot;I read books&quot;.</p>\n<p>Hampir semua biliuner adalah orang yang rajin banget baca buku. Warren Buffet mengklaim dia membaca <a href=\"http://www.usatoday.com/story/money/personalfinance/2014/08/24/peculiar-habits-of-successful-people/14447531/\">500 halaman per hari</a>, Bill Gates membaca <a href=\"http://www.businessinsider.com/why-bill-gates-reads-50-books-a-year-2015-11\">50 buku per tahun</a>, dan Mark Zuckerberg menamatkan <a href=\"http://www.businessinsider.com/end-of-year-mark-zuckerberg-book-recommendations-2015-12/#the-idea-factory-bell-labs-and-the-\">satu buku per dua minggu</a>.</p>\n<p>Banyak banget ya. Kayanya udah waktunya kita rajin baca juga. Apalagi di zaman ini, hampir semua buku udah ada versi digitalnya dan bisa kita baca kapanpun dimanapun selama pegang HP. Bukan cuman buku, ada banyak juga artikel-artikel keren yang bisa kita temuin di internet, tinggal kitanya aja yang mau baca apa ngga.</p>\n<p>Tapi, pasti ada satu alesan yang jadi excuse buat kita semua, <mark><strong>&quot;Ga punya waktu luang&quot;</strong></mark>. Emang bener sih, selain kitanya aja yang gamau luangin waktu, mau gimanapun waktu kita di dunia emang terbatas. Ga semua buku dan artikel bisa kita baca.</p>\n<p>Jadi kita harus manfaatin waktu yang kita punya sebaik mungkin dengan membaca apa-apa yang emang kita butuhin, di waktu sekarang, bukan nanti. Jangan kemakan judul artikel yang keren dan mikir &quot;Siapa tau butuh nih nanti, baca ah.&quot;</p>\n<p>Utamain buat cari informasi apapun yang bisa ngasih manfaat sebesar-besarnya buat kita sekarang, bukan besok, atau lusa. Karena dengan banyaknya aliran informasi yang tersedia di internet, informasi yang &quot;nanti kita butuh&quot; itu gabakal ada habisnya.</p>\n<p>Kita gabutuh panduan investasi kalau masih pelajar dan belum ada penghasilan. Lebih baik cari tau gimana caranya bisa ngehasilin outcome semaksimal mungkin di waktu itu.</p>\n<p>Dan kalau misalnya kita nemu artikel atau buku yang relate sama kita ternyata ga sesuai ekspektasi, langsung tinggalin aja. Kalau paragraf-paragraf awalnya aja udah ga menarik, jangan harap aja semua isinya bakal bagus.</p>\n<p>Charles Munger, partner Warren Buffet pernah bilang,</p>\n<blockquote>\n<p>&quot;Most books I don’t read past the first chapter. I’m not burdened by bad books,”</p>\n</blockquote>\n<p>dan ini benar. Kita bisa cari banyak buku lain yang bisa muasin rasa haus kita.</p>\n<p>Tapi, ada orang bilang kalau kita hanya baca buku yang dibaca kebanyakan orang, kita juga bakal punya pikiran yang seperti kebanyakan orang. Jadi mungkin kita harus buka luasin dan jangan batesin input, tapi tetep, karena waktu kita yang terbatas, kita juga harus punya filter yang kuat buat nyaring apa yang harus kita tamatin.</p>\n<p>Bukan &quot;ga semua bisa kita baca&quot;. Tapi <strong>&quot;ga semua bisa kita tamatin&quot;</strong>. Bakal jadi keuntungan buat kita kalo kita bisa tau bukan cum satu, tapi dari banyak sudut pandang. Dan kita juga perlu menyaring bacaan kita biar waktu kita ga sia-sia.</p>\n<p><mark>Perbanyak input, perkuat filter.</mark></p>\n<p>Artikel ini dibuat dengan ide awal dari <a href=\"https://www.samuelthomasdavies.com/words-into-works/june-25-2020/\">sini</a> dan <a href=\"http://www.collaborativefund.com/blog/how-to-read-lots-of-inputs-and-a-strong-filter/\">sini</a>.</p>\n",
      "date_published": "2021-01-27T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/apps/",
      "url": "https://mufidu.com/apps/",
      "title": "Best Apps I&#39;m Using",
      "content_html": "<p><img src=\"/img/pexels-pixabay-38544.webp\" alt=\"apps\"></p>\n<p>In my daily life, I always use various applications to support my productivity. There are so many different apps developed and available for us to use, and I always want to use the best apps for each task. I'm even willing to spend a few hours trying to figure out which app is the best for me.</p>\n<p>I'm writing this because I want to share my so-called research results, so that people might be able to save some time without having to research for other apps again. Here are the best applications that I use according to their use case. All of them are Android apps, some are also on Windows.</p>\n<h2 id=\"note-taking\">Note-taking <a class=\"direct-link\" href=\"#note-taking\">#</a></h2>\n<p>I usually use a notetaking app as a place for documenting everything, from ideas that I have to write down because it's a shame if they get lost, cool articles I find on the internet, to the thoughts of my brain that are passing through but are unique and cool. I document them in one application, namely <strong><a href=\"https://play.google.com/store/apps/details?id=notion.id&amp;hl=en&amp;gl=US\">Notion</a></strong>.</p>\n<p>I've tried various other note-taking apps, such as Evernote, OneNote, Slite, and Google Keep. For me, Notion remains the best.</p>\n<p>Indeed, I used to go back to Evernote, but in the end I still moved to Notion, because its very diverse features can't be found in other note-taking applications. The drawback is only one, there must be an internet connection. But today, who doesn't have internet?</p>\n<p><img src=\"/img/notion.webp\" alt=\"Notion\"></p>\n<p>But maybe most of the features can be confusing to use, so if you only use it for simple regular notes, I recommend Evernote. It looks really good. Unfortunately there is an upload limit which is only 60 MB per month, so I can't upload a lot of photos.</p>\n<p>Overall, <a href=\"https://play.google.com/store/apps/details?id=notion.id&amp;hl=en&amp;gl=US\">Notion</a>.</p>\n<p><em>Update:</em> Now I use <a href=\"https://obsidian.md/\">Obsidian</a>. I started to hate that all my notes are only exist on one online platform that I don't know how long it will last. In Obsidian, I can set up my notes to be saved locally and regularly backed up to several cloud storages. I can also set up my notes to be encrypted.</p>\n<p>However, Notion is still very good if you want many features and collaboration.</p>\n<h2 id=\"to-do-list\">To-do-list <a class=\"direct-link\" href=\"#to-do-list\">#</a></h2>\n<p>The to-do-list application is important so that we don't have to think too much about something that must be done but the deadline is still next week.</p>\n<p>If there is a task like that, we can put it on the to-do-list instead.</p>\n<p>I've tried Todoist, Google Task, Microsoft To Do, <a href=\"http://Any.do\">Any.do</a>, and TickTick. Just tried the free tier btw, because I still don't need to pay just for a to-do-list. The app with the best free tier in my opinion is <strong><a href=\"https://play.google.com/store/apps/details?id=notion.id&amp;hl=en&amp;gl=US\">TickTick</a></strong>.</p>\n<p>Other apps' free tier always have flaws that make me unable to continue using it. There are those who can't repeat tasks, and some can't even send reminder.</p>\n<p><img src=\"/img/tick.webp\" alt=\"TickTick\"></p>\n<p>There are two things that I really like about TickTick, first it can sync on phones and laptops and other devices, so you can create and view your tasks anywhere.</p>\n<p>Second, it has widgets on phones and laptops, and we can create new tasks without having to open the application using the shortcut. This is really helpful, so we can always see the list on the home screen.</p>\n<h2 id=\"money-manager\">Money manager <a class=\"direct-link\" href=\"#money-manager\">#</a></h2>\n<p>I used to be quite a spendthrift, so I decided to keep track of all my expenses and income.</p>\n<p><img src=\"/img/wallet.webp\" alt=\"Wallet\"></p>\n<p>The applications that I have tried are Wallet, Money Manager, Monefy, Money Lover, and Spendee. In my opinion the best is <a href=\"https://play.google.com/store/apps/details?id=com.droid4you.application.wallet&amp;hl=en&amp;gl=US\">Wallet</a>, because there are no ads and the features are complete, you can even connect to your bank account if you buy the premium one for about $18 (lifetime!).</p>\n<h2 id=\"book\">Book <a class=\"direct-link\" href=\"#book\">#</a></h2>\n<p>Since in high school, I really like reading books, and after graduating I prefer e-books because they are very flexible. I can read anything anywhere as long as I bring my phone.</p>\n<p>At first I bought several books on Google Play Books, until recently I found an application that you can subscribe and then get access to thousands of Indonesian fiction and non-fiction books, namely <a href=\"https://play.google.com/store/apps/details?id=com.droid4you.application.wallet&amp;hl=en&amp;gl=US\">Gramedia Digital</a>.</p>\n<p><img src=\"/img/gramed.webp\" alt=\"Gramedia\"></p>\n<p>The subscription price is really good, IDR 89K for the fiction + nonfiction package. But one account can have 5 people, so if you share an account it can be just around IDR 18K per person.</p>\n<p><em>Update:</em> Now a Gramedia Digital account can only be used by two people. Because the price becomes quite expensive, I now use <a href=\"https://play.google.com/store/apps/details?id=mam.reader.ipusnas&amp;hl=en_US&amp;gl=US\">iPusnas</a> which is quite good, even though we have to struggle sometimes :).</p>\n<h2 id=\"quran-%26-prayer-times\">Quran &amp; Prayer times <a class=\"direct-link\" href=\"#quran-%26-prayer-times\">#</a></h2>\n<p>There are so many qur'an applications and prayer schedules available, and most of them are all-in-one applications, so in an app there is the quran, prayer schedule, Qibla, prayers, dhikr, etc.</p>\n<p>But usually all-in-one applications have ads that are quite annoying and require us to pay to get rid of those ads. So I prefer one application for the qur'an, and another one application for the prayer schedule.</p>\n<p>The qur'an application that I use is <a href=\"https://play.google.com/store/apps/details?id=com.quran.labs.androidquran&amp;hl=en&amp;gl=US\">Qur'an for Android</a> from <a href=\"https://quran.com\">quran. com</a>. In this app, the quran is per page, not per verse like other applications. There are also many murottals that can be played per verse. Very cool. No more ads.</p>\n<p><img src=\"https://mufidu.files.wordpress.com/2021/05/fd869-image.png\" alt=\"quran\"></p>\n<p>For prayer schedule I'm using <a href=\"https://play.google.com/store/apps/details?id=com.reworewo.prayertimes&amp;hl=en&amp;gl=US\">Prayer Times and Qibla</a>. It can show prayer schedules on the home screen that we can customize according through a widget.</p>\n<p><img src=\"https://mufidu.files.wordpress.com/2021/05/26fd8-image.png\" alt=\"prayer-times\"></p>\n<p>We can also set the notification so that it is always on even if our phone is in Silent or Do Not Disturb (DND) mode. In App Purchase is not really needed because it only adds Themes and can play adhan from our phones.</p>\n<h2 id=\"brain-trainer\">Brain trainer <a class=\"direct-link\" href=\"#brain-trainer\">#</a></h2>\n<p>I've tried Lumosity, Peak, Elevate, and NeuroNation. Most of them require a membership, usually costs hundreds of thousands IDR per year.</p>\n<p>The free tier often limits the games we can try, and the games aren't adapting to our abilities (it means same start point every day). Except <a href=\"https://play.google.com/store/apps/details?id=air.nn.mobile.app.main&amp;hl=en&amp;gl=US\">NeuroNation</a>. This is what I use.</p>\n<p><a href=\"https://play.google.com/store/apps/details?id=air.nn.mobile.app.main&amp;hl=en&amp;gl=US\">NeuroNation</a>'s free tier can give us a recommendation of 5 games per day according to our abilities level, so we can monitor our progress continuously. But one of the five games will be locked.</p>\n<p><img src=\"/img/neuronation.webp\" alt=\"NeuroNation\"></p>\n<p>For the paid version, I think the most worth it is <a href=\"https://play.google.com/store/apps/details?id=com.brainbow.peak.app&amp;hl=en&amp;gl=US\">Peak</a>, with a price of IDR 250K per person or IDR 500K for 5 people, and both are lifetime.</p>\n<h2 id=\"language-learning\">Language learning <a class=\"direct-link\" href=\"#language-learning\">#</a></h2>\n<p>I've only tried two apps in this category, Duolingo and Memrise. But it seems pretty clear that the winner is <a href=\"https://play.google.com/store/apps/details?id=com.duolingo&amp;hl=en&amp;gl=US\">Duolingo</a>.</p>\n<p>The free version of Memrise is very limited while Duolingo in the free version already provides everything. Starting from grammar, vocabulary, to stories for teaching how to use the sentences in everyday life.</p>\n<p><img src=\"/img/duolingo.webp\" alt=\"Duolingo\"></p>\n<p>Duolingo Plus itself only adds offline learning features and removes ads, but I've never seen the ads even though they're always connected to the internet, so there's no need to upgrade.</p>\n<hr>\n<p>These are some of the applications that I use on a daily basis. All of them are the best apps in their category, at least in my opinion. You can try it for your consideration.</p>\n",
      "date_published": "2021-01-05T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/aplikasi/",
      "url": "https://mufidu.com/aplikasi/",
      "title": "Aplikasi Terbaik yang Saya Pakai",
      "content_html": "<p><img src=\"/img/pexels-pixabay-38544.webp\" alt=\"aplikasi\"></p>\n<p>Dalam keseharian, saya selalu memakai berbagai macam aplikasi untuk menunjang produktivitas saya. Banyak sekali aplikasi dari berbagai yang dikembangkan developer dan tersedia untuk kita pakai, dan saya selalu ingin memakai aplikasi terbaik untuk setiap tugasnya. Saya bahkan rela menghabiskan beberapa jam untuk memastikan mana aplikasi yang terbaik bagi saya.</p>\n<p>Saya menulis ini karena ingin berbagi hasil pencarian saya, sehingga orang-orang mungkin bisa menghemat waktunya tanpa perlu mencari-cari aplikasi lain lagi. Berikut aplikasi-aplikasi terbaik yang saya pakai sesuai kategorinya. Semuanya adalah aplikasi Android, beberapa ada juga di Windows. Sudah saya sediakan link Play Storenya.</p>\n<h2 id=\"note-taking\">Note-taking <a class=\"direct-link\" href=\"#note-taking\">#</a></h2>\n<p>Untuk aplikasi sebagai tempat mencatat segala sesuatu, mulai dari ide-ide yang harus saya catat karena sayang jika hilang, artikel-artikel keren yang saya temui di internet, hingga hasil pikiran otak saya yang numpang lewat tapi unik, semuanya saya catat di satu aplikasi, yaitu <strong><a href=\"https://play.google.com/store/apps/details?id=notion.id&amp;hl=en&amp;gl=US\">Notion</a></strong>.</p>\n<p>Saya sudah mencoba berbagai aplikasi note-taking lainnya, seperti Evernote, OneNote, Slite, dan Google Keep. Bagi saya, Notion tetap yang terbaik.</p>\n<p>Memang dulu saya sempat balik lagi ke Evernote, tapi akhirnya tetap pindah ke Notion, karena fiturnya yang sangat beragam gabisa ditemuin lagi di aplikasi note-taking lainnya. Kekurangannya cuman satu, harus ada koneksi internet. Tapi hari gini siapa sih yang gapunya internet?</p>\n<p><img src=\"/img/notion.webp\" alt=\"Notion\"></p>\n<p>Tapi mungkin kebanyakan fitur bisa buat bingung memakainya, sehingga kalau cuman digunakan untuk catatan biasa yang simple, saya rekomendasiin Evernote. Tampilannya bagus banget. Sayang ada batasan upload yang cuman 60 MB per bulan, jadi ga bisa banyak upload foto.</p>\n<p>Overall, <a href=\"https://play.google.com/store/apps/details?id=notion.id&amp;hl=en&amp;gl=US\">Notion</a>.</p>\n<p>Update: Sekarang saya menggunakan <a href=\"https://obsidian.md/\">Obsidian</a>. Saya sempet ngerasa khawatir karena semua catetan saya cuman ada di satu platform online yang saya ga tau bakal ada sampai kapan. Di Obsidian, saya bisa mengatur catatan saya untuk disimpan secara lokal dan disalin ke beberapa cloud storage. Saya juga bisa mengatur catatan saya untuk dienkripsi.</p>\n<p>Tapi, Notion tetep bagus kalo kita masih pengen pakai banyak fitur dan kolaborasi sama orang lain.</p>\n<h2 id=\"to-do-list\">To-do-list <a class=\"direct-link\" href=\"#to-do-list\">#</a></h2>\n<p>Aplikasi to-do-list penting supaya kita ga terlalu banyak mikirin sesuatu yang harus dikerjain tapi deadlinenya masih lama, jadi biar ga kepikiran catet aja dulu di to-do-list.</p>\n<p>Saya sudah mencoba Todoist, Google Task, Microsoft To Do, <a href=\"http://Any.do\">Any.do</a>, dan TickTick. Aplikasi terbaik menurut saya adalah <strong><a href=\"https://play.google.com/store/apps/details?id=notion.id&amp;hl=en&amp;gl=US\">TickTick</a></strong>. Ini untuk yang versi gratisnya ya, semuanya baru saya coba versi gratisnya saja karena saya masih belum butuh untuk bayar buat sekedar to-do-list.</p>\n<p>Aplikasi selain TickTick di versi gratisnya selalu punya kekurangan yang membuat saya gabisa pakai aplikasi itu terus. Ada yang gabisa repeat task, gabisa reminder, dan lainnya yang ngebuat saya kurang nyaman.</p>\n<p><img src=\"/img/tick.webp\" alt=\"TickTick\"></p>\n<p>Ada dua yang buat saya suka banget sama TickTick, dia bisa sinkron di hp dan laptop dan device lain, jadi bisa buat dan liat list dimana aja.</p>\n<p>Satu lagi, dia punya widget di hp dan laptop, dan kita bisa buat task baru tanpa harus buka aplikasinya. Ini ngebantu banget, jadi list selalu bisa kita liat di home screen.</p>\n<h2 id=\"money-manager\">Money manager <a class=\"direct-link\" href=\"#money-manager\">#</a></h2>\n<p>Saya dulu termasuk orang yang cukup boros, jadi saya mutusin untuk ngelacak semua pengeluaran dan pemasukan.</p>\n<p><img src=\"/img/wallet.webp\" alt=\"Wallet\"></p>\n<p>Aplikasi yang sudah saya coba yaitu Wallet, Money Manager, Monefy, Money Lover, dan Spendee. Menurut saya yang terbaik adalah <a href=\"https://play.google.com/store/apps/details?id=com.droid4you.application.wallet&amp;hl=en&amp;gl=US\">Wallet</a>, karena gada iklan dan fiturnya sudah komplit, bahkan bisa connect ke Bank kalau beli yang premiumnya seharga 250rban (lifetime!).</p>\n<h2 id=\"book-service\">Book service <a class=\"direct-link\" href=\"#book-service\">#</a></h2>\n<p>Dari SMA saya suka banget baca buku, dan setelah lulus saya lebih suka e-book karena fleksibel banget. Kalo saya bawa hp, bisa baca apapun dimanapun.</p>\n<p>Awalnya saya beli beberapa buku di Google Play Books, sampe akhirnya baru-baru ini nemu aplikasi yang bisa langganan ribuan buku fiksi dan nonfiksi bahasa Indonesia, yaitu <a href=\"https://play.google.com/store/apps/details?id=com.droid4you.application.wallet&amp;hl=en&amp;gl=US\">Gramedia Digital</a>.</p>\n<p><img src=\"/img/gramed.webp\" alt=\"Gramedia Digital\"></p>\n<p>Harga subscriptionnya memang lumayan, 89rb buat paket fiksi + nonfiksi. Tapi satu akun bisa 5 orang, jadi kalo sharing bisa 18rban doang per orangnya.</p>\n<p><em>edit:</em> Sekarang satu akun Gramedia Digital cuman bisa dipakai sama dua orang. Karena harganya jadi lumayan mahal, saya sekarang pakai <a href=\"https://play.google.com/store/apps/details?id=mam.reader.ipusnas&amp;hl=en_US&amp;gl=US\">iPusnas</a> yang lumayan komplit, walau kadang rebutan :).</p>\n<h2 id=\"quran-%26-prayer-times\">Quran &amp; Prayer times <a class=\"direct-link\" href=\"#quran-%26-prayer-times\">#</a></h2>\n<p>Banyak banget aplikasi qur'an dan jadwal solat yang ada, dan kebanyakannya itu aplikasi all-in-one, jadi di satu aplikasi ada quran, jadwal solat, kiblat, doa-doa, dzikir, dll.</p>\n<p>Tapi biasanya aplikasi yang all-in-one gitu ada iklannya yang lumayan ganggu dan ngeharusin kita bayar buat ngilangin iklan itu. Jadi saya sendiri lebih memilih satu aplikasi buat qur'an, satu aplikasi lain buat jadwal solat.</p>\n<p>Aplikasi qur'an yang saya pakai itu <a href=\"https://play.google.com/store/apps/details?id=com.quran.labs.androidquran&amp;hl=en&amp;gl=US\">Qur'an for Android</a> dari <a href=\"http://quran.com\">quran.com</a>. Disitu qurannya per halaman, bukan per ayat kaya aplikasi lain, dan ada banyak murottalnya juga yang bisa diplay per ayat. Keren banget. Gada iklan lagi.</p>\n<p><img src=\"https://mufidu.files.wordpress.com/2021/05/fd869-image.png\" alt=\"quran\"></p>\n<p>Buat jadwal solat saya pakai <a href=\"https://play.google.com/store/apps/details?id=com.reworewo.prayertimes&amp;hl=en&amp;gl=US\">Prayer Times and Qibla</a>, fiturnya yang paling saya suka itu widgetnya yang bisa nampilin jadwal solat di home screen yang bisa kita customize nyesuain sama home screen kita.</p>\n<p><img src=\"https://mufidu.files.wordpress.com/2021/05/26fd8-image.png\" alt=\"prayer-times\"></p>\n<p>Notifikasinya juga bisa kita setting biar selalu nyala walau lagi di mode Silent atau Do Not Disturb (DND). In App Purchase ga terlalu dibutuhin karena cuman nambah Themes dan bisa play azan dari HP kita.</p>\n<h2 id=\"brain-trainer\">Brain trainer <a class=\"direct-link\" href=\"#brain-trainer\">#</a></h2>\n<p>Saya udah coba Lumosity, Peak, Elevate, dan NeuroNation. Dari semua itu kebanyakan ngeharusin banget jadi membershipnya, biasanya ratusan ribu per tahun.</p>\n<p>Kalo cuman di versi gratisan aja, rata-rata ngebatesin game-game yang bisa kita coba, atau gamenya ga disesuain sama kemampuan kita. Kecuali <a href=\"https://play.google.com/store/apps/details?id=air.nn.mobile.app.main&amp;hl=en&amp;gl=US\">NeuroNation</a>. Ini yang saya pakai.</p>\n<p><a href=\"https://play.google.com/store/apps/details?id=air.nn.mobile.app.main&amp;hl=en&amp;gl=US\">NeuroNation</a> di versi gratisnya bisa ngasih kita rekomendasi 5 game per hari yang disesuain sama tingkat kita, jadi kita bisa mantau perkembangannya terus. Cuman dari 5 game itu biasanya ada satu yang kelock.</p>\n<p><img src=\"/img/neuronation.webp\" alt=\"NeuroNation\"></p>\n<p>Kalau buat versi berbayarnya itu yang paling worth it menurut saya <a href=\"https://play.google.com/store/apps/details?id=com.brainbow.peak.app&amp;hl=en&amp;gl=US\">Peak</a>, dengan harga 250rb per orang atau 500rb untuk 5 orang, dua-duanya lifetime.</p>\n<h2 id=\"language-learning\">Language learning <a class=\"direct-link\" href=\"#language-learning\">#</a></h2>\n<p>Saya baru coba dua, Duolingo dan Memrise. Tapi kayanya udah jelas banget ya yang menang <a href=\"https://play.google.com/store/apps/details?id=com.duolingo&amp;hl=en&amp;gl=US\">Duolingo</a>.</p>\n<p>Memrise versi gratisnya terbatas banget sementara Duolingo di versi gratisnya udah nyediain semuanya. Mulai dari grammar, kosa kata, sampai story buat penggunaan kata-kata di keseharian.</p>\n<p><img src=\"/img/duolingo.webp\" alt=\"Duolingo\"></p>\n<p>Duolingo Plus sendiri cuman nambahin fitur belajar offline dan ngilangin iklan, tapi saya belum pernah dapet iklannya padahal selalu terhubung sama internet, jadi gada kebutuhan buat upgrade.</p>\n<hr>\n<p>Itu beberapa aplikasi yang saya pakai di keseharian. Semuanya adalah aplikasi terbaik di kategorinya, paling ngga menurut saya. Silakan dicoba sebagai pertimbangan.</p>\n",
      "date_published": "2021-01-05T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/antisocial/",
      "url": "https://mufidu.com/antisocial/",
      "title": "Antisocial",
      "content_html": "<p><img src=\"/img/pexels-pietro-jeng-360622.webp\" alt=\"antisocial\"></p>\n<p>After buying a new cellphone yesterday, the first thing I did was to set the cellphone in such a way so that it could help me become a more productive person, not the other way around.</p>\n<p>I turn off all notifications on Instagram, Twitter, and other social medias. I only turn on notifications for important things like WhatsApp and Gojek (there is often a chat from the driver, right). I also limit the use of social medias between 5 or 10 minutes and after that the application will be paused automatically and I can't open them again until the next day.</p>\n<p>The result? Maybe I can't really feel the effects on my productivity because I'm currently on vacation, but it's obvious that I feel more relax and &quot;more present&quot;. I can choose what I want to read and watch without any recommendations from Netflix or Google.</p>\n<p>Recently, I also watched The Social Dilemma on <a href=\"https://www.netflix.com/title/81254224\">Netflix</a> which is really cool. In my opinion, everyone especially those who often interact on social media, really need to watch this one.</p>\n<p>In the documentary, there are many social media engineers explaining how social media works. How does social media get money? We don't spend a dime to be able to use that service, right? But companies need money, they need profit. That's inevitable.</p>\n<p>And there is a quote that quitely answers this question,</p>\n<blockquote>\n<p>&quot;If you are not paying for the product, then you are the product.&quot;</p>\n</blockquote>\n<p>They sell and even auction our attention to the biggest paying advertisers. The longer we stare at our screen, using their service, the more profitable it is for them.</p>\n<p>The biggest reason of our addiction to social media is not because we can't control ourselves, but <mark>because engineers designed it indeed to be addicting, intentionally</mark>. They know that they are manipulating us psychologically and they continue to do so. After all, the business must keep going and the shareholders must be satisfied.</p>\n<p>Everything that exists and appears as recommendations on social media is not a coincidence, but is indeed the result of the design made by engineers so that we click again and again, so that more ads can be sold. Social media is like a magician who seems to give us the freedom to choose what we want to see when in fact everything has been arranged.</p>\n<p>Social media has also been designing us, so that if we feel uneasy, afraid, or stressed, we feel that we have our own digital tranquilizer and continue scrolling to get that feeling of comfort again.</p>\n<p>Of course, there are some things we can do so we don't get too used to it, by limiting ourselves, being fully aware of what we choose to see, and not following the recommendations too much. Do <a href=\"/dopamine/\">dopamine detox</a> every few weeks to keep us sane.</p>\n",
      "date_published": "2020-12-22T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/ansosmed/",
      "url": "https://mufidu.com/ansosmed/",
      "title": "Ansosmed",
      "content_html": "<p><img src=\"/img/pexels-pietro-jeng-360622.webp\" alt=\"ansosmed\"></p>\n<p>Setelah beli hp baru kemarin, hal pertama yang saya lakuin adalah setting itu hp sedemikian rupa biar bisa bantu saya jadi orang yang lebih produktif, bukan sebaliknya.</p>\n<p>Saya matiin semua notifikasi instagram, twitter, dll dan cuman nyisain notif buat hal-hal penting kaya whatsapp dan gojek (suka ada chat dari drivernya kan). Saya juga batesin pemakaian socmed antara 5 atau 10 menit dan setelah itu aplikasinya bakal pause gabisa dibuka lagi sampe besoknya.</p>\n<p>Hasilnya? Mungkin buat produktivitas sendiri ga terlalu kerasa karena sekarang lagi libur, tapi buat saya sendiri rasanya jadi jauh lebih tenang. Saya bisa milih apa yang saya mau baca dan tonton tanpa ada rekomendasi dari YouTube atau Google.</p>\n<p>Baru-baru ini juga saya nonton The Social Dilemma di <a href=\"https://www.netflix.com/title/81254224\">Netflix</a> yang isinya keren banget. Semua orang apalagi mereka yang sering berinteraksi di sosmed wajib banget nonton ini.</p>\n<p>Di film dokumenter itu ada banyak insinyur-insinyur social media yang ngejelasin gimana socmed itu bekerja. Gimana socmed itu nyari duit. Kita ga ngeluarin sepeser pun buat bisa pake layanan itu, kan. Tapi perusahaan butuh uang, mereka butuh profit.</p>\n<p>Dan ada sebuah perkataan yang cukup jelas ngejawab pertanyaan itu,</p>\n<blockquote>\n<p>&quot;If you are not paying for the product, then you are the product.&quot;</p>\n</blockquote>\n<p>Mereka menjual dan bahkan melelang perhatian kita kepada pengiklan yang membayar terbesar. Semakin lama kita natap layar di layanan mereka, semakin menguntungkan juga buat mereka.</p>\n<p>Penyebab terbesar adiksi kita terhadap social media bukan kita yang gabisa ngontrol diri, tapi <mark>karena para insinyur memang ngedesainnya untuk itu, secara sengaja</mark>. Mereka tau kalo mereka sebenernya memanipulasi psikologis kita dan mereka tetep ngelanjutin itu. Karena gimanapun, bisnis harus tetep jalan dan pemegang saham harus tetap puas.</p>\n<p>Semua yang ada dan muncul sebagai rekomendasi di sosmed itu bukan kebetulan, melainkan emang hasil rancangan para insinyur biar kita ngeklik lagi dan lagi, agar lebih banyak iklan yang bisa di jual. Sosmed kaya pesulap yang seolah-olah ngasih kita kebebasan milih mau buka apa padahal sebenernya semua udah diatur.</p>\n<p>Sosmed juga mendesain kita agar kalo kita ngerasa ga tenang, takut, stress kita ngerasa punya penenang digital sendiri dan lanjut scrolling demi dapet rasa kenyamanan itu lagi.</p>\n<p>Tentu ada beberapa hal yang bisa kita lakuin biar ga terlalu diperalat, yaitu dengan membatasi diri kita dan sadar penuh apa yang kita pilih untuk kita liat, jangan terlalu nurut sama rekomendasi. Lakuin <a href=\"/dopamin/\">dopamine detox</a> beberapa minggu sekali juga biar kita tetep waras.</p>\n",
      "date_published": "2020-12-22T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/language/",
      "url": "https://mufidu.com/language/",
      "title": "Language Is More than Words",
      "content_html": "<p><img src=\"/img/pexels-pixabay-267669.webp\" alt=\"language\"></p>\n<p>We all need to communicate with other people for getting what we can't get ourselves. For that, we need a tool that can connect us all. And we have already have that, its name is <mark><strong>language</strong></mark>. However, it turns out that language is not just for that.</p>\n<p>Language is perhaps the greatest human invention, because one of the things that makes humans superior to other creatures on earth even though we are much smaller than elephants or giraffes is our <mark>ability to work together</mark>. Not just working together to build something, but also sharing thoughts so that we can gather all knowledge from everyone, even from our ancestors.</p>\n<p>Other animals, when they die, they cannot pass on their knowledge, unless through their genes. On the other side, humans can pass on their knowledge through many media, ranging from inscriptions, notes, and there is now digital tools, which are very helpful for later generations to avoid the same mistakes as their ancestors, can always envolving and do not need to start everything from scratch, because they can continue what has been achieved by previous generations.</p>\n<p>Our logic is also growing really fast, many things were used to be only understood in the brain and could not be expressed by words and scientific explanations. But now almost everything can be described and explained by science, of course using language that is even easy for novice people to understand.</p>\n<p>Let's just be grateful that we were born to be humans, not mosquitoes.</p>\n",
      "date_published": "2020-12-07T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/bahasa/",
      "url": "https://mufidu.com/bahasa/",
      "title": "Bahasa Bukan Cuma Kata",
      "content_html": "<p><img src=\"/img/pexels-pixabay-267669.webp\" alt=\"bahasa\"></p>\n<p>Kita semua perlu komunikasi dengan orang lain untuk mendapatkan apa-apa yang ga bisa kita dapatkan sendiri. Untuk itu, kita memerlukan suatu alat yang bisa menghubungkan kita semua. Dan kita punya satu, namanya <mark><strong>bahasa</strong></mark>. Namun, ternyata bahasa bukan cuma buat itu.</p>\n<p>Bahasa mungkin menjadi penemuan terbesar manusia, karena salah satu hal yang membuat manusia menjadi makhluk superior dibandingkan dengan makhluk-makhluk lain di bumi walaupun dengan ukuran kita yang jauh lebih kecil dibandingkan gajah atau jerapah adalah <mark>kemampuan kita untuk bekerja sama</mark>. Bukan sekedar bekerja sama membangun sesuatu, tetapi juga saling berbagi isi pikiran sehingga kita bisa mengumpulkan semua ilmu dari semua orang, bahkan dari leluhur kita.</p>\n<p>Berbeda dengan hewan lain yang bila mati, mereka gabisa warisin ilmu, paling cuman bisa lewat gen. Manusia bisa warisin ilmunya lewat banyak media, mulai dari prasasti, catatan-catatan, sampai sekarang jejak digital, yang sangat membantu generasi setelahnya agar bisa terhindar dari kesalahan yang sama dari kejadian lalu, bisa selalu berkembang dan tidak perlu mulai lagi segala sesuatunya dari awal, karena tinggal melanjutkan apa-apa yang sudah dicapai generasi sebelumnya.</p>\n<p>Makin kesini juga logika kita semakin berkembang, banyak hal yang dulunya cuman bisa dipahamin di otak dan gabisa diungkapin oleh kata-kata dan gada penjelasan ilmiahnya, tetapi sekarang hampir semua hal bisa dijabarkan dan dijelaskan oleh sains, tentunya menggunakan bahasa yang bahkan mudah dipahami oleh orang awam.</p>\n<p>Bersyukur aja kita dilahirin jadi manusia, bukannya nyamuk.</p>\n",
      "date_published": "2020-12-07T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/game/",
      "url": "https://mufidu.com/game/",
      "title": "Work First, Then Play",
      "content_html": "<p><img src=\"/img/pexels-jeshootscom-442576.webp\" alt=\"\"></p>\n<p>This morning I just installed PES 2017 on my laptop. Yea, even though it's 2017 but it's been modded so it's similar to the 2020 one. The players have also been transferred. It was so fun. But then I spent too much time on it. I'm little bit panicked because I already have a class schedule today. I regret.</p>\n<p>At that time, I watched Hutata's video, the content was really good, even though I had read the concept before, but it was presented in a new way and apparently I didn't understand the point before. About a jar filled with balls, gravel and sand.</p>\n<p>It's true, if we do things that aren't really important first (like playing, chatting, etc.) we won't have time to do things that are really important.</p>\n<p>But if we do things that are important first, <mark>we will still have time to do things that are not essential</mark>.</p>\n<p>In fact, there will be a sense of pride because we feel successful in carrying out our obligations. On the other hand, if we just keep playing, we will end up with regret.</p>\n<p>The main thing is to complete the obligation first, then you can play, or even better continue working on the work so that you can get much better results.</p>\n",
      "date_published": "2020-10-23T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/main/",
      "url": "https://mufidu.com/main/",
      "title": "Tugas Baru Game",
      "content_html": "<p><img src=\"/img/pexels-jeshootscom-442576.webp\" alt=\"\"></p>\n<p>Pagi tadi gua baru install PES 2017 di laptop gua. Ya walaupun 2017 tapi udah di mod jadi mirip-mirip lah ama yang 2020. Pemainnya juga udah ditransfer. Terus gua keasikan. Gila padahal gua udah ada jadwal kuliah hari ini. Rasa nyesel sih ada.</p>\n<p>Gua waktu itu pernah nonton video Hutata, bagus banget isinya, walaupun gua udah pernah baca konsepnya dulu, tapi disampain pake cara baru dan ternyata intinya itu belum gua pahamin dulu. Tentang toples yang diisi bola, kerikil, dan pasir.</p>\n<p>Ternyata bener, kalo kita ngerjain yang gapenting sama sekali duluan (kaya main, ngobrol, dkk) kita gabakal punya waktu buat ngerjain hal-hal yang bener penting.</p>\n<p>Tapi kalo kita ngerjain hal-hal yang penting duluan, <mark>kita bakal tetep punya waktu buat ngerjain hal-hal yang sifatnya hiburan itu</mark>.</p>\n<p>Malah bakal ada rasa kebanggaan tersendiri karena kita ngerasa sukses ngejalanin kewajiban-kewajiban kita. Kebalikannya kalo kita cuman main terus, pasti ada nyesek di akhir.</p>\n<p>Pokonya selesain dulu kewajiban, baru abis itu bisa main, atau bahkan ngembangin kewajiban itu biar dapet hasil yang jauh lebih bagus.</p>\n",
      "date_published": "2020-10-23T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/hello/",
      "url": "https://mufidu.com/hello/",
      "title": "Hello, there",
      "content_html": "<p><img src=\"/img/pexels-moose-photos-1036627.webp\" alt=\"\"></p>\n<p>A few months ago, when I started writing here, I was able to write a post once a day, writings that weren't posted could even be up to three times a day. I was very diligent in writing at that time because after graduating from high school, I feel that I have learned a lot of lessons, thank God. I will regret if they just disappear, so I wrote it down and posted it here.</p>\n<p>I first started this blog in June 2018, to make my post about organization, because at that time, I was just about to start joining organizations when I was in high school. But, in 2018 I only posted two posts, and 2019 was the same, two posts too. It started to be more active since July 1, 2020.</p>\n<p>But writing once a day only lasted until the 17th of that month, then it decrease to every three days, once a week, three times a month, until last September until now, I haven't posted anything at all.</p>\n<p>There are many factors. I have a many tryouts' schedules for my college test preparation almost every day, and I take care of many registrations. Moreover, I am unable to make time and just really lazy.</p>\n<p>I want to start writing again because I feel like I already have ideas that I can write about. I've always written based on my writing itch, write what I want to write. So I don't have a schedule. Last July, I just happened to have a lot that I wanted to write about.</p>\n<p>In this website I also don't choose a particular niche, because all posts are really what I want to write about, and they can be anything.</p>\n<p>Moreover, I also don't make money here, although actually I can because this blog has been approved by Google Adsense so I can post ads, but I don't really care about it, because ads are really annoying sometimes and make very little money, I just checked yesterday I got 300 from Adsense. IDR 300 (about 0.021 USD).</p>\n<p>I write and post here just because I want to, I want to have something that I built from <strong>zero</strong>, which I actually built myself, so there are things I can do when I have free time, and it has results, it has forms.</p>\n",
      "date_published": "2020-10-16T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/halo/",
      "url": "https://mufidu.com/halo/",
      "title": "Halo lagi",
      "content_html": "<p><img src=\"/img/pexels-moose-photos-1036627.webp\" alt=\"\"></p>\n<p>Beberapa bulan lalu pas pertama kali mulai niat aktif lagi nulis disini, saya bisa post tulisan sehari sekali, tulisan yang ga dipost bahkan bisa ada sampai tiga kali sehari. Saya rajin banget nulis waktu itu karena abis lulus SMA, saya ngerasa alhamdulillah banyak banget pelajaran yang saya dapet dan sayang kalo ilang begitu aja, jadi saya tulis dan saya post disini.</p>\n<p>Saya pertama buat blog ini Juni 2018, buat bikin post saya yang tentang keorganisasian, karena pas itu saya baru mau mulai terjun ke organisasi pas SMA. Tapi, taun 2018 saya cuma post dua tulisan, dan 2019 juga sama, dua tulisan juga. Bener-bener baru mulai aktif 1 Juli 2020.</p>\n<p>Tapi nulis sehari sekali cuman bertahan sampai tanggal 17, lalu mulai tiga hari sekali, seminggu sekali, sebulan tiga kali, sampai akhirnya September kemarin sampai sekarang sama sekali ga post apa-apa.</p>\n<p>Banyak faktor sih. Saya hampir tiap hari punya jadwal TO persiapan UTBK, dan ngurus daftar mandiri juga dimana-mana. Apalagi sayanya juga gabisa bagi waktu dan emang malesan.</p>\n<p>Saya mau mulai nulis lagi soalnya saya ngerasa udah ada ide-ide yang bisa saya tulisin lagi. Dari dulu emang saya nulis berdasarkan writing itch aja, nulis apa yang emang lagi gatel pengen ditulis, jadi gada jadwalnya. Cuman Juli kemarin kebetulan aja banyak yang pengen saya tulis.</p>\n<p>Disini saya juga ga milih niche tertentu, karena emang bener-bener apa yang mau saya tulis, dan itu bisa apa aja.</p>\n<p>Apalagi saya juga ga nyari duit disini, walaupun sebenernya bisa soalnya ini blog udah di-acc Google Adsense jadi udah bisa pasang iklan, tapi ga terlalu saya urusin, karena iklan ganggu banget kadang dan ngasilin duitnya dikit banget, saya cek kemarin cuman dapet 300 dari Adsense. 300 perak.</p>\n<p>Saya nulis dan post disini cuman karena pengen aja, saya pengen punya sesuatu yang saya bangun dari 0, yang bener-bener saya bangun sendiri, jadi ada hal yang bisa saya kerjain kalo lagi waktu luang, dan ada hasilnya, ada wujudnya.</p>\n",
      "date_published": "2020-10-16T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/overthink/",
      "url": "https://mufidu.com/overthink/",
      "title": "Hello, Mr. Brain",
      "content_html": "<p><img src=\"/img/pexels-martin-pechy-594610.webp\" alt=\"\"></p>\n<p>I think we all have experienced this. When we are lying down, going to sleep, suddenly our brains think about something heavy or things that are not comfortable to think about so that it becomes difficult for us to sleep. But when it's time to learn, it can't even think.</p>\n<p>Our brains often think about embarrassing things from the past that make us nervous, &quot;How can I be like that?&quot; I suddenly remembered that I used to cry in 4th grade just because the teacher called me. Even though now that I have graduated from high school, no one will remember anymore. <strong>But I still think about it!</strong></p>\n<p>Our thoughts sometimes act weirdly and very difficult to be controlled. But luckily we can just leave it alone, let it go because that's what it does. The brain was created to think. Accept it, but don't take it to heart and think about it further. Maybe the memory just appears because we accidentally trigger something that makes us remember it again. It's just an accident, don't worry about it.</p>\n<p>Separate our thoughts from our feelings. Don't let your feelings be controlled by thoughts that suddenly come. We can't really control it and <mark>it's also illogical if our feelings rely on random thoughts</mark>. Be present.</p>\n<p>We can give the name of our mind to be a differentiator and limiter with feelings. For example, if we suddenly think of peeing in our pants in second grade and our classmates find out, we can say,</p>\n<blockquote>\n<p>&quot;OK, Mr. Brain, thanks for remembering that incident. It's really funny. But don't be shy anymore because it's pretty reasonable for an elementary school kid. Now your classmates have graduated from high school, so definitely no one still remember that.&quot;</p>\n</blockquote>\n",
      "date_published": "2020-08-24T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/pikir/",
      "url": "https://mufidu.com/pikir/",
      "title": "Halo, Mr. Brain",
      "content_html": "<p><img src=\"/img/pexels-martin-pechy-594610.webp\" alt=\"\"></p>\n<p>Ga jarang pas kita udah rebahan pengen tidur, tapi tiba-tiba otak kita malah mikirin sesuatu yang berat atau hal-hal yang ga nyaman dipikirin sehingga kita jadi susah tidur. Giliran pengen belajar, gabisa mikir.</p>\n<p>Sering juga otak kita mikirin hal-hal memalukan dari masa lalu yang ngebikin kita geregetan, &quot;Ko bisa ya dulu gua gitu is.&quot; Tiba-tiba keingetan kalo dulu pernah nangis kelas 4 cuman gara-gara dipanggil guru. Padahal sekarang udah lulus SMA juga, gabakal ada yang inget lagi.</p>\n<p>Pikiran emang suka aneh-aneh, dan kadang susah banget dikendaliin. Tapi untungnya kita bisa biarin aja, lepasin karena emang itu fungsinya. Otak diciptakan untuk berpikir. Ya terima aja, tapi gausah dimasukin ke hati dan dipikirin lebih lanjut lagi. Mungkin ingetan itu cuman muncul karena ga sengaja ketrigger sesuatu yang bikin kita inget itu lagi. Namanya juga ga sengaja, gausah diambil pusing.</p>\n<p>Pisahin pikiran kita dari perasaan. Jangan sampe perasaan kita dikendaliin sama pikiran yang tiba-tiba dateng. Itu emang gabisa kita kendaliin dan <mark>ga logis juga kalo perasaan kita bersandar ke pikiran-pikiran random</mark>. Be present.</p>\n<p>Kita bisa ngasih nama pikiran kita buat jadi pembeda dan pembatas dengan perasaan. Misalnya kalo kita tiba-tiba kepikiran kencing di celana pas kelas 2 dan ketauan temen sekelas, kita bisa bilang,</p>\n<blockquote>\n<p>&quot;OK, Mr. Brain, makasih udah nginget peristiwa itu. Lucu banget ya. Tapi gausah malu lagi karena wajar anak SD begitu. Sekarang temen sekelas udah pada lulus SMA juga, gabakal ada yang inget.&quot;</p>\n</blockquote>\n",
      "date_published": "2020-08-24T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/focus/",
      "url": "https://mufidu.com/focus/",
      "title": "How to Focus",
      "content_html": "<p><img src=\"/img/pexels-jessica-lewis-2381853.webp\" alt=\"\"></p>\n<p>Being focused when doing something whatever it is, will really help us in getting it done. The time and energy required is less than doing it while multitasking. That's because every time we start doing it again, there will be more energy needed to start again from the beginning. If we focus and finish in one start, then the activation energy is only needed once.</p>\n<p>Unfortunately, we naturally find it very hard to focus on something, there are so many things that can disturb our focus. The most disturbing example is our phone. If there's a notification popping up it seems very hard to ignore it, even though we know that it isn't that important. Fortunately, it's not just us who have struggle on focusing, there are also many people out there who feel the same way, and there have also been many studies discussing the best way to focus.</p>\n<h2 id=\"stay-away-from-sources-of-distraction\">Stay away from sources of distraction <a class=\"direct-link\" href=\"#stay-away-from-sources-of-distraction\">#</a></h2>\n<p>If we will definitely check our phone every notification comes, there's nothing wrong with keeping the phone away. Throw it away until we have to spend extra effort to pick it up. If possible, hide it in a different room.</p>\n<p>If you're still afraid to miss something, install WhatsApp on your laptop and connect it to your cellphone, so you can still reply to important chats via your laptop, without distracted by your phone.</p>\n<h2 id=\"create-challenges\">Create Challenges <a class=\"direct-link\" href=\"#create-challenges\">#</a></h2>\n<p>One of the things that makes us really addicted to is playing games, because behind the game there are developers who really design the game in such a way that it is difficult for people to stop playing when they play.</p>\n<p>They design the game with levels which have difficulties that continue to rise as time goes on. But we can still pass it, so that we have a sense of success, pride, and feel challenged to continue playing the game. We can make our tasks to be like that, too. Make the task a bit difficult, but don't make it too difficult so that you don't feel anxious at first. Don't make it too easy, too, as it will make us bored.</p>\n<h2 id=\"create-an-awkward-target\">Create an Awkward Target <a class=\"direct-link\" href=\"#create-an-awkward-target\">#</a></h2>\n<p>For example, we have 10 question. We set a target to do 7 questions. When we are tired on the 5th question, we can say, &quot;C'mon, 2 more then we finish.&quot; And later when we reach 7th question, we can still say, &quot;Just a little bit more, and all questions will be done.&quot; And so on.</p>\n<p>Just three for now, will be added later if there are more.</p>\n",
      "date_published": "2020-08-10T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/fokus/",
      "url": "https://mufidu.com/fokus/",
      "title": "Cara Fokus Ngapain Aja",
      "content_html": "<p><img src=\"/img/pexels-jessica-lewis-2381853.webp\" alt=\"\"></p>\n<p>Menjadi fokus ketika mengerjakan sesuatu, apapun itu, akan sangat membantu kita dalam menyelesaikannya. Waktu dan tenaga yang dibutuhkan jadi lebih sedikit dibanding melakukannya secara multitasking atau pindah-pindah, ga fokus. Itu karena setiap kita mau mulai ngerjain itu lagi, bakal ada energi lebih yang dibutuhinn buat mulai lagi dari awal, beda kalo misalnya kita fokus, selesain dalam sekali mulai, maka energi aktivasinya cuma dibutuhin sekali aja.</p>\n<p>Sayangnya, kita ditakdirin buat jadi ga gampang fokus, banyak banget hal-hal yang bisa ganggu fokus kita dan kita emang susah ngelepasinnya, contoh paling riil ya HP. Ada aja notif muncul yang rasanya sayang banget buat dilewatin, padahal isinya ga penting. Untungnya, bukan cuma kita yang susah fokus, banyak juga orang di luar sana ngerasain hal yang sama, dan udah banyak juga penelitian yang ngebahas gimana caranya biar bisa fokus.</p>\n<h2 id=\"jauhin-sumber-distraksi\">Jauhin Sumber Distraksi <a class=\"direct-link\" href=\"#jauhin-sumber-distraksi\">#</a></h2>\n<p>Kalo emang tiap HP ada notif pasti kita buka, gada salahnya jauhin HPnya sampe kita harus ngeluarin usaha ekstra buat ambil itu, kalo bisa beda ruangan. Jadinya keburu males. Kalo masih takut ketinggalan, install WhatsApp di laptop dan connect ke HP, jadi kita masih bisa balesin chat yang sekiranya penting lewat laptop.</p>\n<h2 id=\"bikin-tantangan\">Bikin Tantangan <a class=\"direct-link\" href=\"#bikin-tantangan\">#</a></h2>\n<p>Salah satu yang bikin kita ketagihan banget main game, karena dibalik game itu ada developer yang emang ngedesain game itu sedemikian rupa biar orang kalo udah main susah berentinya. Mereka desain level yang tingkat kesusahannya terus naik tapi masih bisa kita lewatin, sehingga di kita ada rasa berhasil, bangga dll dan ngerasa tertantang terus buat namatin gamenya. Kita bisa bikin tugas kita juga kaya gitu, cari dan buat tugasnya agak susah, tapi jangan terlalu susah biar ga eneg duluan liatnya. Tugas yang terlalu mudah juga bisa buat kita bosen.</p>\n<h2 id=\"buat-target-nanggung\">Buat Target Nanggung <a class=\"direct-link\" href=\"#buat-target-nanggung\">#</a></h2>\n<p>Misalnya, kita buat target ngerjain 7 soal. Pas soal ke-5 kita udah capek, kita bisa bilang,&quot;Tanggung nih, 2 lagi nyampe target.&quot; Dan pas udah nyampe target 7, kita masih bisa bilang, &quot;Tanggung nih dikit lagi, nomor 10 babnya selesai.&quot; dstrts.</p>\n<p>3 dulu nanti kalo ada lagi ditambah.</p>\n",
      "date_published": "2020-08-10T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/happiness/",
      "url": "https://mufidu.com/happiness/",
      "title": "Our Happiness and Theirs",
      "content_html": "<p><img src=\"/img/child-jumping-into-body-of-water-2387702.webp\" alt=\"happy\"></p>\n<p>Our happiness standard is indeed different. So don't be surprised that even if we are richer, more handsome, smarter than someone, and we see how he look really happier than us even though they are less rich, less handsome, and less smarter than us.</p>\n<p>They don't care if they are stupid or ugly, they will be happy in their own way. There are those who are happy by meeting their friends, by eating delicious street food, by winning chess match, and various other things that we might consider very trivial, simple, and pretty impossible making us happy.</p>\n<p>But that's how it is, people's standards of happiness are different.</p>\n<p>Some say the purpose of life is wealth, power, rank, a happy family, with all its luxuries. And there are also those whose life goals are simpler, such as being able to be happy with friends, being able to eat enough, not having many friends but very close and solid, and other simple things.</p>\n<p>Which one is correct? And which is wrong?</p>\n<p>The right one, the wrong one. It depends on you. If you are really ambitious and have a really big goal, go for it with all our might. That's OK.</p>\n<p>And if you don't really want a hectic life and always feel enough, a simple life with simple purpose is not a problem.</p>\n<p>When our environment makes us uncomfortable with our goals, maybe we want a simple life but our environment demands us to be ambitious, or vice versa, moving is always an option. Or you can try to adapt.</p>\n",
      "date_published": "2020-07-30T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/bahagia/",
      "url": "https://mufidu.com/bahagia/",
      "title": "Bahagia Kita Beda",
      "content_html": "<p><img src=\"/img/child-jumping-into-body-of-water-2387702.webp\" alt=\"bahagia\"></p>\n<p>Standar kebahagiaan manusia emang beda-beda. Jadi walaupun misalnya kita lebih kaya, lebih ganteng, lebih pintar dari seseorang atau dari sekelompok orang, dan kita liat kok mereka keliatannya malah bahagia banget padahal kalah kaya, kalah pinter dari kita, ya jangan heran.</p>\n<p>Mereka bodo amat mau bego atau jelek, tapi mereka happy dengan cara masing-masing. Ada yang happynya ketemu temen, sekedar makan jajanan pinggir jalan yang enak, sekedar menang catur, dan berbagai hal-hal lain yang mungkin kita anggap sangat sepele, bukan apa-apa, dan ga mungkin buat kita bahagia.</p>\n<p>Tapi gitulah, standar bahagia orang beda-beda.</p>\n<p>Ada yang bilang tujuan hidup itu kekayaan, kekuasaan, kepangkatan, keluarga yang bahagia, dengan segala kemewahannya. Ada juga yang tujuan hidupnya lebih sederhana, seperti bisa bahagia bersama teman, bisa makan cukup, punya temen ga banyak tapi deket banget dan solid, dan hal sederhana lainnya.</p>\n<p>Mana yang bener? Mana yang salah?</p>\n<p>Gada yang bener gada yang salah. It depends on you. Kalo kita emang ambis, tujuan besar harus kita raih, ya kejar sekuat tenaga. Dan bila kita sederhana, mudah bersyukur dan selalu merasa cukup, hidup sederhana bukan masalah.</p>\n<p>Kalau lingkungan kita ngebuat kita ga nyaman sama tujuan kita, kita mau sederhana tapi lingkungan nuntut kita jadi ambis, atau sebaliknya, kita mau ambis tapi lingkungan ga ngedukung, pindah selalu bisa jadi pilihan. Bisa juga adaptasi.</p>\n",
      "date_published": "2020-07-30T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/noise/",
      "url": "https://mufidu.com/noise/",
      "title": "Social Media Noise",
      "content_html": "<p><img src=\"/img/news-typewritten-on-white-paper-4057663.webp\" alt=\"noise\"></p>\n<p>Lately, if you take a look at Twitter, there's a lot of fuss. Lots. Because I will take the college exam, I think I need to do more positive vibes, so I move my Explore's region to the US, where the trending is cooler and there is little to no fuss.</p>\n<p>I also filter some keywords that provoke a fuss. Genuinely speaking, Indonesia's trending is very toxic. Maybe we are collectively toxic.</p>\n<p>I started looking for people who write good blogs, and I found <a href=\"https://gitasav.com/\">Gita Savitri</a>. Her posts are very good, critical, and clear. She can express her thoughts through writing without ambiguity and we can get the meaning. Very cool. She has written two books and one of them has been made into a movie.</p>\n<p>However, I still often go through Instagram and do some scrolling, because it;s very hard to get rid of this FOMO. Well, there's a friend of mine who really like to talk about religious issues, usually it's already been viral on Twitter, but he just saw it because he doesn't have Twitter and someone just uploaded it on Instagram. Because I'm very active on Twitter (so to speak), when I saw his IG story, it seemed really stale.</p>\n<p>First, what he discussed has been discussed very often by the public figures who have thousands of followers. And he discussed it like he was the first to discuss it haha. I don't mean to belittle or forbid people from telling others to do something good. Because after all, don't wait for your perfection to spread the truth.</p>\n<p>I myself don't want to give my personal opinion about a problem on social media that everyone can see, let alone to convince people to follow my opinion, especially on things that I'm not very good at.</p>\n<p>Only if, for example, I'm asked for my opinion on things that I'm really good at, I will go ahead. When I was in high school, I was often asked things about student council affairs by the new student council members, sometimes asked to get together for discussing the problems. If it's about then, then I'm down.</p>\n<p>I'm willing to in, simply because I really know about student council affairs. When in 11th grade we have a team that holds a lot of events. Many have succeeded, thank God, and some have failed. But from the failed and successful ones, there must something can be learned.</p>\n<p>At the student council, I've performed, people already know who I am and what I've been doing, that's why I dare to talk about it. It's a different story if I comment on social media. For example about religion. I'm not like Ustadz Firanda who is already well-known in the community as one of the big ustadz, I'm just a former student from a boarding school and no one knows me personally.</p>\n<p>I'm afraid, if I, a nobody joing to comment and my comments accidentally go viral, people will be like, &quot;Wow, he is a nobody but he dare to comment like this? And it's viral? Hey I think this is wrong, I have to comment too.&quot;</p>\n<p>And because I'm a nobody but I can comment and even go viral, they then think that they're also allowed to speak up. Finally, it's not uncommon to have debates ala Twitter indo which if you read it, it just makes you say wtf.</p>\n<p>Even though it's not viral, it's still possible for our friends to comment, and because we are the ones who deliver, things that should be discussed seriously become jokes. I'd rather not to talk about it than invite our friends to joke about things like that.</p>\n<p>The point is, if we really don't really know much about something or we even don't have any experience in that field, it's so better if we don't talk about it too much. <mark>We'd better give time and place for the people who really understand the field to explain</mark>.</p>\n",
      "date_published": "2020-07-22T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/ribut/",
      "url": "https://mufidu.com/ribut/",
      "title": "Biar Socmed Ga Ribut",
      "content_html": "<p><img src=\"/img/news-typewritten-on-white-paper-4057663.webp\" alt=\"noise\"></p>\n<p>Belakangan ini kalo liat di Twitter, lagi banyak banget yang diributin. Banyak. Karena gua lagi mau ngadepin UTBK, gua rasa gua harus banyakin positive vibes, jadi gua pindahin region explore ke US, yang trendingnya keren-keren dan gada ributnya, damai.</p>\n<p>Gua juga ngefilter beberapa keywords yang mancing ribut. Asli, trending indo toxic banget. Mana kita toxicnya kolektif.</p>\n<p>Gua mulai cari-cari orang yang ngeblog dan blognya bagus, dan ketemu <a href=\"https://gitasav.com/\">Gita Savitri</a>. Isinya bagus banget, kritis, dan jelas. Dia bisa ngungkapin pikirannya lewat tulisan tanpa rancu dan kita bisa dapet maksudnya. Keren banget. Dia udah nulis dua buku dan salah satunya udah dibuat filmnya.</p>\n<p>Ya tapi gua masih sering buka-buka IG, karena mau ngilangin ni FOMO ga bisa-bisa, masih bertahap lah pelan-pelan. Nah, ada satu temen gua yang gacor banget ngebahas persoalan-persoalan agama gitu, biasanya pertama udah viral di Twitter, tapi dia baru liat karena dia gapunya Twitter baru ada yang nge-up di Instagram. Karena gua aktif banget buka Twitter, gua liat storynya ya jadi kaya basi banget.</p>\n<p>Pertama, apa yang dia bahas udah sering banget dibahas sama public figure yang followersnya ribuan. Dan dia nekeninnya kaya dia yang baru pertama ngebahas itu haha. Gua ga maksud ngerendahin atau ngelarang orang buat menyuruh ke kebaikan gitu apa gimana ya. Karena gimanapun gausah nunggu sempurna untuk bisa menyebarkan kebaikan.</p>\n<p>Gua sendiri ga mau ngeluarin pendapat pribadi tentang suatu masalah di social media yang semua orang bisa liat, apalagi sampe ngeyakinin orang buat ngikutin pendapat gua, terutama di hal-hal yang ga gua kuasain banget.</p>\n<p>Baru kalo misalnya gua dimintain pendapat tentang hal-hal yang emang gua kuasain banget, gua mau maju. Kelas 12 kemaren gua sering banget ditanyain urusan OSIS sama anak-anak OSIS yang baru, kadang diminta ikut ngumpul dan bahas masalah bareng. Kalo itu gua ayo aja.</p>\n<p>Gua mau maju, karena gua emang ngerti banget urusan OSIS. Kelas 11 kita punya tim yang banyak banget ngadain acara dan program kerja. Banyak yang berhasil, alhamdulillah, ada juga yang gagal. Tapi dari yang berhasil dan yang gagal semua bisa diambil pelajarannya.</p>\n<p>Di OSIS, gua udah tampil, orang-orang udah tau siapa gua dan apa yang udah gua kerjain, makanya gua berani ngomongin itu. Beda cerita kalau gua komen di social media. Misalnya tentang agama. Gua ga kaya Ustadz Firanda yang emang udah masyhur di masyarakat sebagai salah satu ustadz kibar, gua cuman mantan santri salah satu boarding school dan itupun gada yang tau, ga terkenal sama sekali (guanya, ya).</p>\n<p>Gua takut, kalo gua yang bukan siapa-siapa ini ikut-ikutan komentar dan komentar gua sampe ga sengaja viral, orang-orang bakal kayak, &quot;Wah, ni orang bukan siapa-siapa tapi ngomentarin beginian, viral lagi, menurut gua salah ni, harus bales komen juga gua.&quot;</p>\n<p>Dan karena mereka nganggep gua yang bukan siapa-siapa aja bisa komentar bahkan sampe viral, mereka juga boleh dong, bersuara. Akhirnya ga jarang terjadilah debat ala-ala Twitter indo yang kalo dibaca cuman bikin gregetan.</p>\n<p>Walaupun ga viral juga, tetep mungkin temen-temen kita yang komen, hal-hal yang harusnya dibahas serius jadi bahan becandaan karena kita yang nyampein, atau minimalnya kita dikata sok iye. Gua sih lebih baik gabahas daripada ngundang temen kita becandain hal begituan.</p>\n<p>Intinya, kalau kita emang ga nguasain banget suatu hal dan gada karya di bidang itu, ada baiknya kita gausah ikut-ikutan ngebahas biar sekedar edgy. <mark>Mending kita kasih waktu dan tempat buat orang yang emang bener-bener paham bidang itu buat ngejelasin</mark>.</p>\n",
      "date_published": "2020-07-22T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/efficient/",
      "url": "https://mufidu.com/efficient/",
      "title": "Being More Efficient",
      "content_html": "<p><img src=\"/img/blades-conservation-ecology-efficiency-213798.webp\" alt=\"efficient\"></p>\n<p>Sometimes there are times when we really want to do something and be busy be doing it. We have time and energy that we want to give into something, but we don't know what, because we don't want our time and energy to be wasted; doing something which has little to no benefit for us. To avoid that, there is one principle that we must know.</p>\n<p>It is the <em>pareto principal</em>, which says that <mark>80% of the results come from 20% of the effort</mark>, and the remaining 80% of the effort only gives 20% of the results.</p>\n<p>For example, 80% of the book's content is in 20% of the pages, the rest is just the story, and 80% of the movie's main story is in 20% of the plot, the rest is just character development, etc.</p>\n<p>Before we do or work on something, it would be much more efficient if we first identify which 20% is the most essential of it that contains 80% of the results, and then focus on that.</p>\n<p>We don't need to carry out the remaining 80% because it only provides 20% of the results, it's not really worth it, is it? We can move on to other things, find the other main 20%, and so on.</p>\n<p>What makes us move forward is not just hard work, but also smart work, by putting our efforts into the right things. Don't forget we only have such limited time in our life.</p>\n<p>If we can apply this to everything in our lives, we will be able to have a lot of free time. Well, we have to look for other useful things, make sure everything we do is not in vain. It's useless for us to save our time on things that are useful, but instead we waste a lot of time on things that are not useful.</p>\n",
      "date_published": "2020-07-20T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/efisien/",
      "url": "https://mufidu.com/efisien/",
      "title": "Cara Jadi Lebih Efisien",
      "content_html": "<p><img src=\"/img/blades-conservation-ecology-efficiency-213798.webp\" alt=\"efficient\"></p>\n<p>Kadang ada beberapa waktu dimana kita pengen banget ngelakuin sesuatu dan disibukin sama hal itu, kita punya waktu dan tenaga yang pengen kita salurin ke sesuatu, tapi kita gatau kemana, karena kita gamau waktu dan tenaga kita kebuang sia-sia, tersalur tapi ke suatu hal yang kecil manfaatnya, atau malah gaada. Untuk itu, ada satu prinsip yang harus kita tau.</p>\n<p>Namanya <em>pareto principal,</em> bunyinya adalah bahwa <mark>80% hasil datang dari 20% usaha</mark>, dan 80% usaha sisanya hanya memberikan 20% hasil.</p>\n<p>Contohnya, 80% isi buku ada di 20% halamannya, sisanya hanya cerita, dan 80% isi film ada di 20% alurnya, sisanya hanya pendalaman karakter, dll.</p>\n<p>Sebelum kita ngelakuin atau ngerjain sesuatu, bakal jauh lebih efisien kalo kita mengidentifikasi dulu mana 20% yang paling esensial dari hal itu yang mengandung 80% hasilnya, dan fokusin kesana.</p>\n<p>Kita ga perlu ngejalanin 80% sisanya karena itu cuman ngedatengin 20% hasil, ga <em>worth it</em> banget kan. Kita bisa pindah ngerjain hal-hal lain, cari 20% intinya, dstrs.</p>\n<p>Yang bikin kita maju itu bukan cuman kerja keras, tapi ngerahin usaha ke hal-hal yang benar. Jangan lupa kita cuman punya waktu yang terbatas.</p>\n<p>Kalo kita bisa nerapin ini ke semua hal di hidup kita, kita bakal bisa punya waktu luang yang banyak banget. Nah, kita harus cari hal lain yang bermanfaat, pastiin semua yang kita kerjain ga sia-sia. Percuma kita ngehemat waktu kita di hal-hal yang bermanfaat, tapi malah banyak nyia-nyian waktu di hal-hal yang gada manfaatnya.</p>\n",
      "date_published": "2020-07-20T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/halo-effect/",
      "url": "https://mufidu.com/halo-effect/",
      "title": "Halo Effect",
      "content_html": "<p><img src=\"/img/man-wearing-black-and-teal-tuxedo-883362.webp\" alt=\"\"></p>\n<p>If we look at people whose clothes are neat, fragrant, polite, it is very likely that we will think of that person as someone who is intelligent, rich, and friendly. On the other hand, when we see people who are not good looking and dress carelessly, we will think that people are stupid, poor, and even mean.</p>\n<p>This effect has been discussed since about 100 years ago, and was given the name <strong>Halo Effect</strong>.</p>\n<p>It happens when <mark>we generalize all of a person's traits based on a single trait, usually from first impressions</mark>. Like in the example earlier. We can think of someone as rich just by their clothes.</p>\n<p>The <strong>halo effect</strong> is one of the biggest cognitive biases and what we do the most, unconsciously. The bad thing is, if we assume that someone is such and such, we tend to act and do things that make that person really such and such.</p>\n<p>For example, take a look at the school. It is not uncommon for teachers to prefer and think that students who are physically good are also good academically, although that is not necessarily true. Because when we're young, our academic abilities are still developing, and that development is highly dependent on the surrounding environment.</p>\n<p>Well, the teacher usually tends to give more attention to the physically good child and pay less attention to other children. So as the result, eventually the good looking child becomes really good academically, just like the teacher thought.</p>\n<p>But this effect is not 100% wrong. There are some cases when this effect can be true and help us make decisions more quickly. There are indeedn some people's traits that can be caught at a glance.</p>\n<p>For example, a person who wears buttons on a shirt randomly. Using this effect we know that that person really doesn't care about appearance, and that's true. So, the first impression is really important and we must pay attention to that.</p>\n",
      "date_published": "2020-07-16T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/efek-halo/",
      "url": "https://mufidu.com/efek-halo/",
      "title": "Halo Effect",
      "content_html": "<p><img src=\"/img/man-wearing-black-and-teal-tuxedo-883362.webp\" alt=\"\"></p>\n<p>Kalo kita liat orang yang bajunya rapih, wangi, sopan, gede kemungkinannya kita bakal nganggep orang itu termasuk orang yang cerdas, kaya, dan ramah. Sebaliknya, ngeliat orang yang ga rapih dan bajunya asal-asalan, kita bakal nganggep orang itu bodoh, miskin, dan jahat.</p>\n<p>Hal ini udah pernah dibahas dari sekitar 100 tahun lalu, dan diberi nama <em>Halo Effect</em>.</p>\n<p>Ini terjadi ketika <mark>kita menggeneralisasikan seluruh sifat seseorang berdasarkan satu sifatnya saja, biasanya dari kesan pertama</mark>. Contohnya tadi. Kita bisa nganggep seseorang kaya cuman dari pakaiannya aja.</p>\n<p><em>Halo effect</em> adalah salah satu bias kognitif yang paling gede dan paling sering kita lakuin secara ga sadar. Bahayanya, kalau kita berasumsi bahwa seseorang itu begitu dan begini, kita cenderung bertindak dan melakukan hal-hal yang membuat seseorang itu jadi beneran begitu dan begini.</p>\n<p>Misalnya di sekolah. Ga jarang guru lebih suka dan nganggep murid yang bagus secara fisik bagus juga secara akademik, walaupun belum tentu benar / salah karena di sekolah kemampuan akademik memang lagi berkembang, dan perkembangan itu sangat bergantung ke lingkungan sekitarnya.</p>\n<p>Nah, guru tadi biasanya cenderung ngasih perhatian lebih ke anak yang bagus secara fisik tadi dan kurang merhatiin anak lainnya. Sehingga hasilnya, ya anak itu jadi beneran bagus akademiknya.</p>\n<p>Tapi efek ini ga 100% salah. Bahkan di beberapa keadaan efek ini bisa bener, dan ngebantu kita ngambil keputusan secara lebih cepat. Tentu memang ada beberapa sifat orang yang bisa ketauan dalam sekali liat.</p>\n<p>Misalnya orang yang pakai kancing baju aja ga rapih nunjukin kalo orang itu emang ga peduli ke penampilan, dan itu benar. Jadi, kesan pertama emang penting dan tetep harus kita jaga.</p>\n",
      "date_published": "2020-07-16T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/morning/",
      "url": "https://mufidu.com/morning/",
      "title": "What to Do in The Morning",
      "content_html": "<p><img src=\"/img/photo-of-person-holding-alarm-clock-1028741.webp\" alt=\"\"></p>\n<p>The saying goes,</p>\n<blockquote>\n<p>Don't sleep in the morning or your sustenance will be pecked by the chicken.</p>\n</blockquote>\n<p>Although many respond with, &quot;No, I don't wake up in the morning, but it's because my class schedule is in the afternoon, and I have nothing to do in the morning,&quot; and other reasons that do not agree with the above saying, in my opinion in general the parable used in this proverb is very true.</p>\n<p>I always try to write every morning. Write anything. Something to post here, or just abstract ideas and thoughts from my brain. It helps me turning on my brain in the morning. Usually after that, even until night, I'll still be productive.</p>\n<p>Meanwhile, if I play PES in the morning or scroll through Instagram and Twitter, I'll end up doing nothing that day. Even though I supposed to study all day, because my college entrance exam is near.</p>\n<p>We really should maximizing our time in the morning. <mark>At that time our brains are still in its freshest state</mark>, after a full night of rest, they are not used to think about anything.</p>\n<p>It's a shame if you only use it in the morning for playing games and non-productive activities, because we don't take full advantage of our brain's performance.</p>\n<p>It will be even better if the heavy work is done in the morning. Because in the afternoon, we are already tired and will be really lazy to do things, especially heavy ones.</p>\n<p>But if we can't do work in the morning, we can replace it with light work that can provoke activity in our brain. Like, for example, writing something like this, or doing other things.</p>\n<p>So that we'll get a sense of achievement for something that we managed to finish in the morning, and this will give us motivation to do anything until the evening.</p>\n",
      "date_published": "2020-07-14T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/pagi/",
      "url": "https://mufidu.com/pagi/",
      "title": "Di Pagi Hari",
      "content_html": "<p><img src=\"/img/photo-of-person-holding-alarm-clock-1028741.webp\" alt=\"\"></p>\n<p>Pepatah bilang,</p>\n<blockquote>\n<p>Jangan tidur di pagi hari atau nanti rezekinya dipatok ayam.</p>\n</blockquote>\n<p>Walaupun banyak yang bilang, &quot;Ngga ah, gua bangun siang gapapa kan emang jadwal kelas gua siang.&quot; dan alasan lain yang ga setuju dengan pepatah tadi, menurut gua secara garis besar perumpamaan yang dipake di pepatah ini bener banget.</p>\n<p>Gua selalu usahain nulis setiap pagi. Nulis apa aja. Bisa buat dipost disini, atau sekedar ide-ide dan pikiran abstrak dari otak gua. Buat mancing otak gua pas pagi, dan biasanya kalo paginya gua nulis, sampe siang, sore, bahkan malem di hari itu gua bakal jadi produktif.</p>\n<p>Sedangkan kalau pagi gua langsung main PES atau scroll IG dan Twitter, ga jarang seharian itu akhirnya gada yang gua kerjain, malah bisa seharian ga belajar, padahal mau UTBK.</p>\n<p>Bener banget pagi hari tu harus dimanfaatin. Sebaik-baiknya. <mark>Di waktu itu otak kita lagi berada di keadaan paling fresh, setelah semaleman penuh istirahat</mark>, ga dipake buat mikir apa-apa.</p>\n<p>Sayang banget kalau pagi cuman dipake buat main-main doang dan kegiatan-kegiatan non produktif karena kita jadi ga manfaatin kinerja maksimal otak.</p>\n<p>Lebih bagus lagi kalo kerjaan-kerjaan berat dikerjain pas pagi, karena kalo udah siang biasanya udah banyak pikiran dan jadi males banget ngelakuin hal-hal begituan, apalagi yang berat. Tapi kalo gabisa kerjain kerjaan pas pagi, kita bisa ganti pake kerjaan ringan yang bisa mancing aktivitas di otak. Kaya misalnya nulis gini, atau bikin apa kek gitu. Biar kita dapet rasa achievement atas sesuatu yang berhasil kita selesain di pagi hari, dan ini bakal ngasih kita motivasi buat ngejalanin apa aja sampai malem.</p>\n",
      "date_published": "2020-07-14T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/mind-stucked/",
      "url": "https://mufidu.com/mind-stucked/",
      "title": "Don&#39;t Stuck with Mind",
      "content_html": "<p><img src=\"/img/sebastian-herrmann-mkQsoiskWSg-unsplash.webp\" alt=\"debate\"></p>\n<p>One of the things that makes we hate <em>socmed</em> is a lot of noise in that place. There is a discussion for any single thing. Every time someone talks about it, chance are someone will deny it. Discuss, deny, repeat. Why would we waste our time like that?</p>\n<p>The biggest cause of this endless debate is difference of opinion, which is caused by different point of view. Why do many people desperately defend their opinion and point of view, and don't want to accept that their opinion is rejected (although it's obvious that they're wrong)?</p>\n<p>In my opinion, it's because they think that everything must make sense and have reasons behind it. And the reason is must fit in their mind. But unfortunately everyone's mind is different, because everyone goes through different experiences and takes different lessons.</p>\n<p>When there are two conflicting opinions, it is not uncommon for these two opinions are both right and make sense. If so, it means that you can't just use common sense anymore, you have to look at it from another point of view, there is <strong>empathy</strong> and <strong>religion</strong>.</p>\n<p>If both make sense, we'll see which one makes more sense based on our feelings and empathy as humans. See also based on religion, which one is allowed, which one is not, which one is more recommended. But it is much better if we use religion as the first glasses.</p>\n<p>Why? In Islam, it is explained that Allah the Exalted created our brains with all the limitations, then it is natural that there are many things in this world that we cannot understand, and if we follow His instructions and his willing, we will be safe.</p>\n",
      "date_published": "2020-07-09T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/akal-addict/",
      "url": "https://mufidu.com/akal-addict/",
      "title": "Akal Addict",
      "content_html": "<pre class=\"language-js\"><code class=\"language-js\"><span class=\"token keyword\">const</span> <span class=\"token punctuation\">{</span> get<span class=\"token punctuation\">,</span> set<span class=\"token punctuation\">,</span> del<span class=\"token punctuation\">,</span> has <span class=\"token punctuation\">}</span> <span class=\"token operator\">=</span> <span class=\"token function\">require</span><span class=\"token punctuation\">(</span><span class=\"token string\">\"idb-keyval\"</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span><br><span class=\"token keyword\">async</span> <span class=\"token keyword\">function</span> <span class=\"token function\">main</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span><br>  <span class=\"token keyword\">const</span> key <span class=\"token operator\">=</span> <span class=\"token string\">\"my-key\"</span><span class=\"token punctuation\">;</span><br>  <span class=\"token keyword\">const</span> value <span class=\"token operator\">=</span> <span class=\"token string\">\"my-value\"</span><span class=\"token punctuation\">;</span><br>  <span class=\"token keyword\">await</span> <span class=\"token function\">set</span><span class=\"token punctuation\">(</span>key<span class=\"token punctuation\">,</span> value<span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span><br>  <span class=\"token keyword\">const</span> result <span class=\"token operator\">=</span> <span class=\"token keyword\">await</span> <span class=\"token function\">get</span><span class=\"token punctuation\">(</span>key<span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span><br>  console<span class=\"token punctuation\">.</span><span class=\"token function\">log</span><span class=\"token punctuation\">(</span>result<span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span><br>  <span class=\"token keyword\">await</span> <span class=\"token function\">del</span><span class=\"token punctuation\">(</span>key<span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span><br><span class=\"token punctuation\">}</span><br><span class=\"token function\">main</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span></code></pre>\n<p><img src=\"/img/sebastian-herrmann-mkQsoiskWSg-unsplash.webp\" alt=\"debat\"></p>\n<p>Salah satu yang paling bikin males main <em>socmed</em> adalah banyak ributnya. Apa aja diributin. Semua hal ada aja yang bahas. Tiap ada yang bahas ada aja yang bantah. Bahas, bantah, repeat. Kenapa pada ribut gini?</p>\n<p>Penyebab paling gede munculnya keributan adalah beda pendapat, yang disebabin beda sudut pandang. Kenapa orang-orang banyak yang mati-matian bela pendapat dan sudut pandangnya, gamau nerima kalo pendapatnya ditolak apalagi disalahin?</p>\n<p>Menurut saya karena mereka punya adiksi sama akal. Mereka nganggep akal adalah segalanya, bahwa segala sesuatunya harus masuk akal, tapi cuman akal mereka doang. Tapi sayangnya akal tiap orang kan beda-beda, karena tiap orang ngelewatin pengalaman dan ngambil pelajaran yang beda-beda juga.</p>\n<p>Ketika ada dua pendapat yang ribut, ga jarang kalo ternyata dua pendapat ini gada yang salah, sama-sama bisa bener, masuk akal juga dua-duanya. Kalo udah gini berarti udah gabisa sekedar pake akal lagi, harus diliat dari sudut pandang lain, ada <strong>empati</strong> dan <strong>keagamaan</strong>.</p>\n<p>Kalo dua-duanya sama-sama masuk akal, kita liat mana yang lebih masuk akal berdasarkan perasaan dan empati kita sebagai manusia. Liat juga berdasarkan agama, mana yang boleh, mana yang ngga, mana yang lebih dianjurin. Tapi jauh lebih baik kalo agama ini kita pake sebagai kacamata pertama.</p>\n<p>Kenapa? Di Islam, dijelasin kalau Allah Ta'ala menciptakan otak kita dengan segala keterbatasan, maka wajar kalo banyak hal di dunia ini yang gabisa kita pahamin, dan kalo kita ngikutin petunjuk-Nya, insyaallah kita bakal selamat.</p>\n",
      "date_published": "2020-07-09T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/humble/",
      "url": "https://mufidu.com/humble/",
      "title": "Be Humble!",
      "content_html": "<p><img src=\"/img/hands-people-friends-communication-45842.webp\" alt=\"humble\"></p>\n<p>Sometimes, we meet people who need help but have bad attitudes; an ojek who asking for direction without greeting first, or beggars who beg rudely. It indeed makes us feel uncomfortable afterwards so we then don't bother to help them.</p>\n<p>I used to be like that too, especially since I often read books about self improvement that emphasizing attitude, so I know generally what is good and polite, and what isn't.</p>\n<p>It's also uncomfortable to see people who don't even think about attitude. But over time, my perspective began to change. I realize that <mark>apparently not everyone is given the opportunity to also read the books that I've read</mark> and many people grow and live in an environment that doesn't care about self-improvement, where the need for surviving life is much more important.</p>\n<p>Ojek and beggars are apparently part of them. They most likely don't have time and chance to read Dale Carnegie's books. If they ever read that, then there is very little chance that they will become ojek and beggars.</p>\n<p>After realizing that, I began to understand the philosophy of rice,</p>\n<blockquote>\n<p>&quot;Be like the rice stalk, as it is laden with ripening grains, it bows down&quot;.</p>\n</blockquote>\n<p>If we have an advantage over other people, it doesn't mean we can blame or demean people who don't understand.</p>\n<p>In my opinion, it is our duty to understand them and treat everyone according to their standards and according to their class.</p>\n<p>So if there is an ojek who suddenly asks for direction without asking permission, just help them out, they are in a hurry. If there are beggars who ask for more money, just give them. They are hungry.</p>\n<p>Only if there is a CEO who wears a suit but is still rude to his subordinates in front of everyone, we are permitted to be uncomfortable and not accept it. Because he, at the level of a CEO, shouldn't be doing things that are usually done by grocery owners.</p>\n<p>Just be humble, my friends.</p>\n",
      "date_published": "2020-07-06T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/baik/",
      "url": "https://mufidu.com/baik/",
      "title": "Jadi Orang Baik!",
      "content_html": "<p><img src=\"/img/hands-people-friends-communication-45842.webp\" alt=\"humble\"></p>\n<p>Sering ketika kita ketemu ato ngadepin orang yang bad attitude, kaya misalnya nanya jalan ga permisi dulu, ketemu pengemis yang mintanya ga sopan, kita bakal risih dan bahkan ga bantuin.</p>\n<p>Dulu saya juga gitu, apalagi saya termasuk sering baca-baca buku tentang self improvement yang sangat mengedepankan attitude jadi saya tau lah garis besarnya gimana yang baik, sopan, mana yang ngga.</p>\n<p>Risih juga liat orang-orang yang ga mikirin attitude. Tapi lama kelamaan cara pandang saya mulai berubah. Saya sadar bahwa ternyata <mark>ga semua orang diberi kesempatan membaca buku-buku yang saya baca</mark> dan banyak orang yang memang gede dan tinggal di lingkungan yang ga mentingin self improvement, dimana kebutuhan untuk bisa hidup jauh lebih mendesak.</p>\n<p>Tukang ojek, pengemis, mana mungkin baca buku-bukunya Dale Carnegie. Kalau mereka pernah baca itu, kecil banget kemungkinannya mereka bakal jadi tukang ojek dan pengemis.</p>\n<p>Abis sadar itu, saya mulai paham filosofi padi <em>&quot;makin berisi makin merunduk&quot;</em>. Kalau kita punya suatu kelebihan ilmu dibanding orang lain, bukan berarti kita boleh menyalahkan atau merendahkan orang-orang yang ga paham.</p>\n<p>Tapi menurut saya udah jadi kewajiban kita untuk memahami mereka dan memperlakukan semua orang sesuai standarnya, sesuai kelasnya.</p>\n<p>Jadi kalau ada tukang ojek yang tiba-tiba nanya alamat tanpa permisi dulu, kasih tau aja, mereka buru-buru. Kalau ada pengemis yang minta duitnya rada maksa, kasih aja. Mereka kelaparan.</p>\n<p>Baru kalau misalnya ada CEO yang pake jas tapi masih ngatain bawahannya dengan kasar di depan semua orang, kita boleh risih dan ga terima. Karena ga seharusnya selevel CEO ngelakuin hal yang biasa dilakuin juragan kelontong.</p>\n<p>Be humble deh pokonya.</p>\n",
      "date_published": "2020-07-06T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/obey/",
      "url": "https://mufidu.com/obey/",
      "title": "Do (not) Obey",
      "content_html": "<p><img src=\"/img/shallow-focus-photo-of-road-sign-on-pole-3162073.webp\" alt=\"\"></p>\n<p>To make it easier for humans to achieve a goal, we made rules. So that it will be clear what should and should not be done in order to achieve the goal. Rules also distinguish humans from animals who simply live according to the laws of nature.</p>\n<p>Therefore, the makers of the rules should really understand the environment affected by their rules, so that anyone in that environment who follows the rules should also be safe until they reach their destination. Because the rules (should) not just be made, right? There is a reason behind everything. There's a &quot;why&quot; behind it.</p>\n<p>But we are still in an era where everything is growing exponentially. Everything suddenly changes, the rules that have been made for a long time are often no longer relevant.</p>\n<p>It may still be able to reach the goal, but it is less effective because it does not take advantage of the existing grown situation. The rules tend to ignore, even become hostile and assume that growth and changes that occur will only hinder us from our goals.</p>\n<p>In fact, growth and changes can help in all aspects, depending on whether we want to use it or not.</p>\n<p>And if we are aware that we are in a situation where we have to choose, follow the rules or dump them for the sake of time, energy, and cost efficiency, go ahead. Rules cannot adapt themselves.</p>\n<p>Unfortunately, the rule makers are usually too comfortable with the rules they make so they don't want to change them and reject any changes that they assume untested and fragile.</p>\n<p>They don't want to sacrifice their comfort and their battle tested rules, because of fear.</p>\n<p>If a goal can be achieved more efficiently without using that rule, in my opinion, that's fine to disobey, as long as nothing goes wrong. <mark>Do not let the rules actually hinder and make us close our eyes and refuse to follow the existing growth</mark>, especially in tech.</p>\n<p>After all, there will definitely someone who comes forward, if not us, then it will be someone else. So, choose wisely.</p>\n",
      "date_published": "2020-07-04T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/patuh/",
      "url": "https://mufidu.com/patuh/",
      "title": "Do (not) Obey",
      "content_html": "<p><img src=\"/img/shallow-focus-photo-of-road-sign-on-pole-3162073.webp\" alt=\"\"></p>\n<p>Untuk mempermudah manusia mencapai suatu tujuan, dibuatlah aturan sehingga jelas apa saja yang harus dan jangan dilakukan demi tujuan tercapai. Aturan juga membedakan manusia dengan hewan yang sekedar hidup berdasarkan hukum alam.</p>\n<p>Makanya, pembuat aturan harusnya udah paham banget lingkungan yang dicakup oleh aturannya sehingga seharusnya siapa pun di lingkungan itu yang mengikuti aturan dia juga seharusnya selamat sampai tujuan. Karena aturan (harusnya) ga sekadar dibuat kan. Ada alasan dibalik semuanya. Ada &quot;why&quot; dibaliknya.</p>\n<p>Tapi kita lagi ada di zaman yang perkembangan segalanya terjadi secara eksponensial. Semuanya tiba-tiba berubah, aturan yang sudah lama dibuat pun seringnya jadi ga relevan lagi.</p>\n<p>Mungkin masih bisa sampai ke tujuan, tapi kurang efektif karena ga memanfaatkan situasi perkembangan yang ada, cenderung mengabaikan, malah memusuhi dan menganggap bahwa  perkembangan dan perubahan yang terjadi hanya menghambat.</p>\n<p>Padahal nyatanya perkembangan itu bisa membantu di segala aspek, tergantung kitanya mau memanfaatkan atau ngga.</p>\n<p>Dan kalau kita sadar ada di situasi harus milih, ngikut aturan atau mbelok demi keefisienan waktu, tenaga, dan biaya, belok aja. Aturan gabisa mengadaptasi dirinya sendiri.</p>\n<p>Sayangnya, pembuatnya biasanya udah terlalu nyaman dengan aturan buatannya sehingga ogah menggantinya dan menolak segala perubahan yang mereka anggap belum teruji.</p>\n<p>Mereka gamau ngorbanin kenyamanan mereka dan aturan mereka yang sudah teruji berhasil, karena takut.</p>\n<p>Bila suatu tujuan bisa tercapai dengan lebih efisien tanpa pakai aturan itu, menurut gua gapapa, selama gada yang salah. <mark>Jangan sampai aturan itu justru ngehambat dan ngebuat kita tutup mata dan menolak mengikuti perkembangan-perkembangan yang ada</mark>, khususnya teknologi.</p>\n<p>Gimanapun, pasti bakal ada yang maju, kalau bukan kita, ya orang lain. Jadi, pilih aja.</p>\n",
      "date_published": "2020-07-04T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/detox/",
      "url": "https://mufidu.com/detox/",
      "title": "Why You Must Do Dopamine Detox",
      "content_html": "<p><img src=\"/img/pexels-pixabay-371924.webp\" alt=\"\"></p>\n<p>According to <a href=\"https://www.halodoc.com/jangan-salah-inilah-pencepatan-about-dopamine\">Halodoc</a>, Dopamine is a chemical in the brain that increases when a person experiences pleasant sensations. But it turns out that this substance also makes us lazy. How come?</p>\n<p>Why are we so lazy to do hard things, especially those that have long-term benefits, even though we know exactly that these things will be useful for us in the future?</p>\n<p>We prefer to spend time enjoying the &quot;present&quot;. We are really lazy if we have to do things that we'll get the benefit <strong>later</strong>, even though the benefits are far greater and meaningful than temporary pleasures in &quot;present&quot;.</p>\n<p>According to Andrew Kirby in his video below, it's because the brain is designed to encourage us to choose the things that produce the most dopamine for the brain, <strong>at the time</strong>, not later.</p>\n<p>\nhttps://www.youtube.com/watch?v=_vcGF3HqZXg\n</p>\n<p>That's why we prefer to watching movies than study, prefer to eat tasty fast-food than eat healthy, etc. Because those are the things that produce the most dopamine for us, at least at that time.</p>\n<p>Well, actually we can manipulate our brains, set it up to think that things like watching movies actually harm us later, and that the hard-but-beneficial things will benefit us later, so that we can produce much more dopamine.</p>\n<p>For example, we will feel happy if we succeed in doing everything in our daily todolist, right? If so, we will be much happier if our big goals and vision are achieved.</p>\n<p>But before that, first we must have a clear goal and vision, which we really want, and we are willing to work hard for it, because <strong>we</strong> want it, not our parents, friends, or the neighborhood.</p>\n<p>It's really hard to find a goal like this. But once we find our purpose, it will be clearer what our life purpose is.</p>\n<p>For now, there is a trend called Dopamine Detox, which makes us lower our dopamine standards which are usually already very high.</p>\n<p>Here is the concept, every day we've used all kinds of social media, and we don't feel satisfied even though we've been scrolling for hours. <mark>That's because our dopamine standards are already high, and it makes us hard to be satisfied</mark>.</p>\n<p>Moreover, it's human nature that we can't be satisfied. We have to lower the standard so we don't get too addicted to those things.</p>\n<p>The trick is, we escape from social media or maybe even our phone, at least a few hours or a day. After that, our dopamine standards will definitely decrease, even if a little. Like for example, if we don't eat all day, just looking at ordinary food seems to be really delicious, right?</p>\n<p>Do this every few days, and we will feel a little (or much more) relieved because it's no longer necessary to have to scroll through Instagram every minute.</p>\n",
      "date_published": "2020-07-02T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/detoks/",
      "url": "https://mufidu.com/detoks/",
      "title": "Pentingnya Dopamine Detox",
      "content_html": "<p><img src=\"/img/pexels-pixabay-371924.webp\" alt=\"\"></p>\n<p>Menurut <a href=\"https://www.halodoc.com/jangan-salah-inilah-penjelasan-tentang-dopamin\">Halodoc</a>, Dopamine adalah zat kimia di dalam otak yang bisa meningkat kadarnya saat seseorang mengalami sensasi yang menyenangkan. Tapi ternyata zat ini yang bikin kita males. Kok bisa?</p>\n<p>Kenapa kita males banget ngerjain hal-hal berat, apalagi yang manfaatnya itu jangka panjang, walaupun kita tau persis kalo hal-hal itu bakal bermanfaat bagi kita nantinya?</p>\n<p>Kita lebih milih ngabisin waktu untuk menikmati &quot;saat ini&quot;, dan males banget kalo harus melakukan hal-hal yang manfaatnya baru bisa dirasakan nanti, kapan-kapan, walaupun manfaatnya jauh lebih besar dan berarti dari kesenangan sementara di &quot;saat ini&quot;.</p>\n<p>Menurut Andrew Kirby di videonya di bawah, itu karena otak memang di desain untuk mendorong kita memilih hal-hal yang menghasilkan dopamine paling besar bagi otak, di saat itu, <strong>bukan nanti-nanti</strong>.</p>\n<p><a href=\"https://www.youtube.com/watch?v=_vcGF3HqZXg\">https://www.youtube.com/watch?v=_vcGF3HqZXg</a></p>\n<p>Makanya kita lebih milih nonton daripada belajar, lebih milih makan enak daripada makan sehat, dll. Karena hal-hal itulah yang ngehasilin dopamine paling besar buat kita, paling ga di saat itu.</p>\n<p>Nah, sebenernya kita bisa memanipulasi otak kita, setting bahwa hal-hal kaya nonton itu sebenernya ngerugiin kita, dan bahwa hal-hal yang berat itu nguntungin kita nantinya, sehingga bisa ngasilin dopamine yang jauh lebih besar.</p>\n<p>Contohnya kita bakal ngerasa seneng kan kalo misalnya berhasil ngerjain semua yang ada di todolist harian. Coba apalagi kalo tujuan besar, goals, visi kita tercapai nantinya.</p>\n<p>Tapi sebelumnya, kita juga harus punya tujuan dan visi yang jelas, yang emang bener-bener kita pengenin, dan kita rela kerja keras untuk itu, karena <strong>kita</strong> yang pengen, bukan orangtua, teman, atau lingkungan.</p>\n<p>Nyari tujuan kaya gini emang susah, sih. Tapi begitu udah nemu tujuan kita, bakal lebih jelas kita hidup buat apa.</p>\n<p>Buat sekarang, lagi tren banget yang namanya Dopamine Detox, atau detoksifikasi dopamine, yang ngebuat kita nurunin standar dopamine kita yang biasanya udah tinggi.</p>\n<p>Konsepnya gini, tiap hari kita udah buka social media segala macem, dan kita ngerasa ga puas-puas walau udah scrolling berjam-jam. <mark>Itu karena standar dopamine kita udah tinggi, dan ngebuat kita susah puas</mark>.</p>\n<p>Apalagi emang udah jadi kodrat manusia kita gabisa puas. Jadi kita harus nurunin standar itu biar ga terlalu addict sama hal-hal itu.</p>\n<p>Caranya, kita lepas diri dari social media atau mungkin handphone, minimal beberapa jam atau sehari. Setelah itu pasti standar dopamine kita bakal nurun, walaupun sedikit. Kaya misalnya kalo kita ga makan seharian, liat makanan biasa aja kayanya jadi enak banget, kan.</p>\n<p>Lakuin ini beberapa hari sekali, dan kita bakal ngerasa sedikit lega, lega karena udah gada lagi itu bawaan harus scroll Instagram setiap menit.</p>\n",
      "date_published": "2020-07-02T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/human-vs-ai/",
      "url": "https://mufidu.com/human-vs-ai/",
      "title": "Human Pride",
      "content_html": "<p><img src=\"/img/pexels-alex-knight-2599244.webp\" alt=\"robot\"></p>\n<blockquote>\n<p>Everything that exists or happens on earth, is judged to be good or bad depending on its effect on humans, not on animals, plants, nor even the earth itself.</p>\n</blockquote>\n<p>Should we be proud to be human?</p>\n<h2 id=\"industrial-revolution\">Industrial Revolution <a class=\"direct-link\" href=\"#industrial-revolution\">#</a></h2>\n<p>Recently, before the outbreak of the epidemic, one of the most widely discussed issues was the <strong>Industrial Revolution 4.0</strong> and all its details; <em>big data, AI, machine learning,</em> etc. This is indeed worth discussing because it has and will continue to completely change our lives, opening up as wide as possible all opportunities and ideas that have never been thought of before.</p>\n<p>When James Watt started the world's first steam engine in 1776 (1.0), when the Ford factory started using electricity and conveyor belts in its factories (2.0), when Alan Turing managed to complete the first computer to crack Nazi ciphers (3.0), and when everything started to connect to the <em>Internet of Things</em> (4.0), what happened was almost certain. Everyting is getting better, faster, cheaper, and more efficient.</p>\n<p>Well, if you look closely, <strong>Industrial Revolution 4.0</strong> which is still going on right now is moving the main role from <strong>industry</strong> into the hands of <strong>information</strong>.</p>\n<p>Now, there are many jobs that are taken over or automated by machines and robots, most of them are repetitive jobs, such as cashier, toll gate guard, beverage seller, etc. This is because machines and robots can and will certainly do these jobs better and faster. And recently, even cognitive work, which requires intelligence, can be done by robots. On February 17, 1996 the world was shocked by the loss of world chess champion Garry Kasparov to Deep Blue, an IBM AI that was able to predict 200 million moves per second.</p>\n<p>So in general all human jobs can and/or will be replaced by robots, from cashiers to maybe rocket designers, and all of these robots are connected on the <em>Internet of Things</em> network. They will be able to record all the things we experience, do, and feel, then save it to a giant database that we know as <em>Big Data</em>.</p>\n<h2 id=\"industry-%E2%9E%A1%EF%B8%8F-information\">Industry ➡️ Information <a class=\"direct-link\" href=\"#industry-%E2%9E%A1%EF%B8%8F-information\">#</a></h2>\n<p>The birth of <em>Artificial Intelligence</em> and <em>Big Data</em> causes us as humans to inevitably give up industrial tasks to be done by robots. Our task now is to utilize the information network in this huge <em>Big Data</em>, so that it can be useful and make our lives easier. This is a job that is predicted to be <a href=\"https://becominghuman.ai/data-scientist-and-their-future-is-seen-bright-for-job-analysts-7b646864e14c\">one of job with the brightest prospect</a> in the future, <em>Data Scientist</em>. Examples of their work are recommendations for our needs in <em>e-commerce</em> and another movie recommendation in online streaming services which is based on what we've watched.</p>\n<p>However, human capabilities are very limited and it is impossible to process the millions of available data, while it is very unfortunate if this <em>Big Data</em> is not utilized. Therefore, scientists are developing a super network/<em>supernet</em>, which consists of computational algorithms¹ created by humans which thanks to AI can develop their own algorithms independently without human intervention, which will be able to process Big Data correctly and will certainly be millions of times smarter than humans.</p>\n<p>Update: <a href=\"https://www.infoworld.com/article/3596894/todays-data-science-roles-wont-exist-in-10-years.html\">It's happening.</a></p>\n<h2 id=\"welcome-to-the-new-era\">Welcome to The New Era <a class=\"direct-link\" href=\"#welcome-to-the-new-era\">#</a></h2>\n<p><em>Supernet</em>² – with its gigantic information management – ​​will be very helpful to humans if it is actually realized. It will know us better than ourselves and know what is the best for us. Making important decisions in life will depend on what the <em>supernet</em> says, and we will believe it because we believe the <em>supernet</em> knows everything. At this point, it is very possible for someone to become an atheist, because for them the Qur'an and the Bible are no longer relevant to today's life, and on the <em>supernet</em> they depend. <em>Na'udzubillahi min zaalik</em>.</p>\n<p>The signs of the emergence and superiority of <em>supernet</em> are visible now. Millions of people give up their privacy to be known by Google and Facebook in order to be able to participate in the flow of <em>Big Data</em> and feel the great benefits.</p>\n<p>Furthermore, it is not impossible for <em>supernet</em> to treat humans, as just another complex algorithm. <em>Supernet</em> may feel that its level is above humans because the its algorithm is much more complex than humans.</p>\n<p>Well, from 70,000 years ago, since Homo sapiens started walking on earth – according to Darwin's theory – humans have always been the most meaningful, most important, and most influential creatures on earth. Humans are in the center of everything, as mentioned in the opening statement,</p>\n<blockquote>\n<p>Everything that exists or happens on earth, is judged to be good or bad depending on its effect on humans, not for animals, plants, even the earth itself.</p>\n</blockquote>\n<p>This is because humans have <strong>intelligence</strong> and <strong>consciousness</strong>. Some animals might be called smart, such as dolphins, chimpanzees, or dogs. But none of the animals <strong>realized</strong> that they could do anything great. If there is, maybe the elephant is the ruler of the world now.</p>\n<p>However, if intelligence and awareness, our two crucial abilities as humans, are only considered as complex algorithms, while the <em>supernet</em> is the owner of the best algorithm, then the <em>supernet</em> will become the next most meaningful, most important, and most influential creature.</p>\n<p>It might seem impossible because the <em>supernet</em> will be intangible, but so are countries and organizations. These two things are intangible but countless of people are willing to sacrifice their lives for these intangible things.</p>\n<h2 id=\"what's-next%3F\">What's next? <a class=\"direct-link\" href=\"#what's-next%3F\">#</a></h2>\n<p>So far, we can provide two possibilities.</p>\n<p>First, the <em>supernet</em> will be self-serving. Because it was created by <em>AI</em> and <em>machine learning</em> so that it can be cognitively better than humans and humans can't even understand it, the <em>supernet</em> can assume that the system is the priority, and humans are just objects. If the lower classes of humans would only slow down progress if rescued, then the <em>supernet</em> would prefer to eliminate them. Sound not good for me.</p>\n<p>Second, the <em>supernet</em> will care about humans. Even though it is better than humans in many way and it awares of that, it is also possible that the <em>supernet</em> remains loyal to humans. It will do, produce, and give everything we have never thought of for the evolution of mankind. <em>Supernet</em> can take ownership of assets, so that inequality can be erased and prosperity can be enjoyed by everyone. This will be the pinnacle of human success. Related to this, Prof. Harari – a history professor – said that with technology, <em>Homo sapiens</em> would turn into <em>Homo deus</em>.</p>\n<hr>\n<p>¹Algorithm: A sequence of how to do something that is usually very complicated. Cooking recipes are examples of algorithms.</p>\n<p>²Supernet is just a personal term for example.</p>\n<hr>\n<p>References:</p>\n<p>Harari, Yuval Noah. 2015. <em>Homo Deus</em>.<br>\n      London : Harvill Secker</p>\n",
      "date_published": "2020-04-01T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/manusia-vs-ai/",
      "url": "https://mufidu.com/manusia-vs-ai/",
      "title": "Bangga Jadi Manusia?",
      "content_html": "<p><img src=\"/img/pexels-alex-knight-2599244.webp\" alt=\"robot\"></p>\n<blockquote>\n<p>Segala sesuatu yang ada atau yang terjadi di bumi, dinilai baik atau buruknya tergantung dari efeknya bagi manusia, bukan bagi para hewan, tumbuhan, bahkan bumi itu sendiri.</p>\n</blockquote>\n<p>Haruskah kita bangga menjadi manusia?</p>\n<h2 id=\"revolusi-industri\">Revolusi Industri <a class=\"direct-link\" href=\"#revolusi-industri\">#</a></h2>\n<p>Belakangan ini, sebelum wabah merebak, salah satu isu yang paling marak dibicarakan adalah <strong>Revolusi Industri 4.0</strong> dan segala tetek bengeknya; <em>big data, AI, machine learning,</em> dll. Hal ini memang pantas dibahas karena memang sudah dan akan terus merubah total hidup kita, membuka seluas-luasnya seluruh peluang dan ide-ide yang belum pernah terpikirkan sebelumnya.</p>\n<p>Ketika James Watt menyalakan mesin uap pertama kali di dunia pada 1776, ketika pabrik Ford mulai menggunakan listrik dan <em>conveyor belt</em> di pabriknya, ketika Alan Turing berhasil menyelesaikan komputer pertama untuk memecahkan sandi Nazi, dan ketika semuanya mulai terhubung ke <em>Internet of Things</em>, segalanya hampir pasti selalu menjadi lebih baik, lebih cepat, lebih murah, lebih efisien, dan serbalebih lainnya.</p>\n<p>Nah, bila dicermati, <strong>Revolusi Industri 4.0</strong> yang masih berlangsung sekarang ini sedang memindahkan peran utama <strong>industri</strong> ke tangan <strong>informasi</strong>.</p>\n<p>Sekarang ada banyak pekerjaan yang diambil alih atau diotomasi oleh mesin dan robot, sebagian besar pekerjaan yang bersifat repetisi, seperti kasir, penjaga gerbang tol, penjual minuman, dsb. Ini karena mesin dan robot bisa dan pasti akan mengerjakan pekerjaan-pekerjaan ini dengan serbalebih tadi. Bahkan baru-baru ini pekerjaan bersifat kognitif pun, yang memerlukan kecerdasan, sudah bisa dikerjakan oleh robot. Pada 17 Februari 1996 dunia dihebohkan oleh kalahnya juara dunia catur Garry Kasparov oleh Deep Blue, <em>AI</em> buatan IBM yang mampu memprediksi 200 juta gerakan/detik.</p>\n<p>Jadi secara umum seluruh pekerjaan manusia bisa dan/atau akan digantikan oleh robot, mulai dari kasir hingga mungkin desainer roket, dan semua robot-robot ini terhubung di jaringan <em>Internet of Things</em>. Mereka akan bisa merekam seluruh hal yang kita alami, kerjakan, dan rasakan, lalu menyimpannya ke sebuah database raksasa yang kita kenal dengan nama <em>Big Data</em>.</p>\n<h2 id=\"industri-%E2%9E%A1%EF%B8%8F-informasi\">Industri ➡️ Informasi <a class=\"direct-link\" href=\"#industri-%E2%9E%A1%EF%B8%8F-informasi\">#</a></h2>\n<p>Lahirnya <em>Artificial Intelligence</em> dan <em>Big Data</em> menyebabkan kita sebagai manusia mau tidak mau merelakan tugas-tugas industri untuk dikerjakan oleh para robot. Tugas kita sekarang adalah memanfaatkan jaringan informasi di <em>Big Data</em> yang sangat besar ini agar bisa bermanfaat dan mempermudah kehidupan kita. Inilah pekerjaan yang digadang-gadang akan menjadi salah satu <a href=\"https://becominghuman.ai/data-scientist-and-their-future-is-seen-bright-for-job-analysts-7b646864e14c\">pekerjaan berprospek tercerah</a> di masa depan, <em>Data Scientist</em>. Contoh hasil kerjanya adalah rekomendasi barang kebutuhan kita di <em>e-commerce</em> dan rekomendasi tontonan di layanan <em>streaming online</em>, yang berdasarkan apa yang sudah kita tonton.</p>\n<p>Namun, kemampuan manusia sangat terbatas dan tidak mungkin bisa mengolah jutaan data yang tersedia, sedangkan amat disayangkan bila <em>Big Data</em> ini tidak dimanfaatkan. Oleh karena itu, para ilmuwan sedang mengembangkan suatu jaringan super/<em>supernet</em>, yang terdiri dari algoritma¹ komputasi ciptaan manusia yang berkat <em>AI</em> bisa mengembangkan algoritmanya sendiri secara mandiri tanpa campur tangan manusia lagi, yang akan mampu mengolah <em>Big Data</em> dengan tepat dan tentunya akan menjdi jutaan kali lebih cerdas dari manusia.</p>\n<p>Update: <a href=\"https://www.infoworld.com/article/3596894/todays-data-science-roles-wont-exist-in-10-years.html\">Ini sudah mulai terjadi.</a></p>\n<h2 id=\"selamat-datang-di-era-baru\">Selamat Datang di Era Baru <a class=\"direct-link\" href=\"#selamat-datang-di-era-baru\">#</a></h2>\n<p><em>Supernet</em>² –dengan pengelolaan informasi raksasa yang dimilikinya– akan sangat membantu manusia bila benar-benar terealisasikan. Ia akan mengenali diri kita melebihi kita sendiri dan tahu segala sesuatu yang terbaik bagi kita. Pengambilan keputusan-keputusan penting dalam kehidupan akan bergantung pada apa kata <em>supernet</em>, dan kita akan percaya karena kita yakin <em>supernet</em> tahu segalanya. Di titik ini, akan sangat memungkinkan bagi seseorang untuk menjadi ateis, karena bagi mereka Al-Qur'an dan Bible sudah tidak relevan dengan kehidupan sekarang, dan kepada <em>supernet</em>lah mereka bergantung. <em>Na'udzubillahi min dzaalik</em>.</p>\n<p>Tanda-tanda kemunculan dan superioritas <em>supernet</em> sudah terlihat sekarang. Jutaan manusia merelakan privasi mereka diketahui oleh Google dan Facebook demi bisa ikut andil dalam aliran <em>Big Data</em> dan merasakan manfaat besarnya.</p>\n<p>Selanjutnya, bukan tidak mungkin bagi <em>supernet</em> kita, manusia, hanyalah sebuah algoritma kompleks lainnya. <em>Supernet</em> mungkin merasa derajatnya ada diatas manusia karena algoritmanya sendiri jauh lebih kompleks dari manusia.</p>\n<p>Nah, dari 70.000 tahun lalu semenjak <em>Homo sapiens</em> mulai berjalan di bumi –menurut teori Darwin– manusia selalu menjadi makhluk paling berarti, paling penting, dan paling berpengaruh di muka bumi. Segala sesuatu terjadi dan manusia berada di pusatnya, sebagaimana disebut di pernyataan pembuka,</p>\n<blockquote>\n<p>Segala sesuatu yang ada atau yang terjadi di bumi, dinilai baik atau buruknya tergantung dari efeknya bagi manusia, bukan bagi para hewan, tumbuhan, bahkan bumi itu sendiri.</p>\n</blockquote>\n<p>Ini semua karena manusia memiliki <strong>kecerdasan</strong> dan <strong>kesadaran</strong>. Beberapa hewan mungkin bisa disebut cerdas, seperti lumba-lumba, simpanse, atau anjing. Tapi tak ada satupun hewan yang <strong>sadar</strong> bahwa mereka bisa melakukan sesuatu yang besar. Bila ada, mungkin gajahlah penguasa dunia sekarang.</p>\n<p>Tapi, bila kecerdasan dan kesadaran, dua hal kemampuan krusial kita sebagai manusia, hanya dianggap sebagai algoritma kompleks belaka, sedangkan <em>supernet</em>lah pemilik algoritma terbaik, maka <em>supernet</em> akan menjadi makhluk paling berarti, paling penting, dan paling berpengaruh selanjutnya.</p>\n<p>Mungkin terasa mustahil karena <em>supernet</em> tidak berwujud, tapi begitu pula negara dan organisasi. Kedua hal ini tak berwujud tapi tak terhitung manusia yang rela mengorbankan nyawa demi hal-hal yang tak berwujud ini.</p>\n<h2 id=\"apa-selanjutnya%3F\">Apa Selanjutnya? <a class=\"direct-link\" href=\"#apa-selanjutnya%3F\">#</a></h2>\n<p>Sejauh ini, kita bisa memberikan dua kemungkinan.</p>\n<p>Pertama, <em>supernet</em> akan mementingkan dirinya sendiri. Karena ia diciptakan oleh <em>AI</em> dan <em>machine learning</em> sehingga secara kognitif bisa lebih baik dari manusia dan manusia tidak bisa memahaminya, <em>supernet</em> bisa menganggap bahwa sistemlah yang harus didahulukan, dan manusia hanyalah sebuah objek. Bila kelas rendahan manusia hanya akan memperlambat kemajuan bila diselamatkan, maka <em>supernet</em> akan lebih memilih untuk melenyapkan mereka.</p>\n<p>Kedua, <em>supernet</em> akan mementingkan manusia. Walau serbalebih dari manusia dan sadar akan itu, bisa jadi juga <em>supernet</em> tetap loyal kepada manusia. Ia akan melakukan, menghasilkan, dan memberikan segala sesuatu yang belum pernah terpikirkan oleh kita demi perkembangan umat manusia. <em>Supernet</em> bisa mengambil alih kepemilikan atas aset-aset, sehingga kesenjangan bisa dihapuskan dan kesejahteraan dinikmati oleh semua orang. Ini akan menjadi puncak kejayaan umat manusia. Terkait hal ini, Prof. Harari –profesor sejarah– mengatakan bahwa dengan teknologi, <em>Homo sapiens</em> akan berubah menjadi Homo deus.</p>\n<hr>\n<p>¹Algoritma: Urutan cara kerja melakukan sesuatu yang biasanya sangat rumit. Resep masak adalah contoh algoritma</p>\n<p>²Supernet hanya istilah pribadi untuk permisalan.</p>\n<hr>\n<p>Referensi:</p>\n<p>Harari, Yuval Noah. 2015. <em>Homo Deus</em>.<br>\n      London : Harvill Secker</p>\n",
      "date_published": "2020-04-01T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/gocar-convo/",
      "url": "https://mufidu.com/gocar-convo/",
      "title": "Convo with Gocar Driver",
      "content_html": "<p><img src=\"/img/photo-of-yellow-taxi-parked-near-sidewalk-2399254.webp\" alt=\"\"></p>\n<p>Sorry, I am not translating this. But <a href=\"https://translate.google.com/?sl=id&amp;tl=en&amp;text=%23%23%20one%20day%2C%0A%0A**d**%3A%20tanggal%2010%20juli%20nanti%20kayanya%20bakal%20susah%20nyari%20driver%20ya%20mas%0A%0A**w**%3A%20kenapa%20emangnya%20pak%3F%0A%0A**d**%3A%20kita%20driver%20mau%20unjuk%20rasa%0A%0A**w**%3A%20oh%2C%20kenapa%20pak%3F%0A%0A**d**%3A%20kita%20mau%20nunjukin%20rasa%20ga%20suka%20aja%2C%20mulai%20banyak%20soalnya%20peraturan%20yang%20bikin%20susah%20kita%0A%0Ayang%20driver%0A%0A**w**%3A%20emang%20apa%20aja%20pak%3F%0A%0A**d**%3A%20ada%20regulasi%20dari%20pemerintah%2C%20setiap%20driver%20harus%20punya%20sk%20masing-masing%2C%20buat%20dapet%20sk-nya%20harus%20bayar%205%20juta%2Ftahun%2Fmobil%2C%20sedangkan%20kita%20dapet%20bonus%20perhari%20paling%20180k%2C%20ya%20ga%20bakal%20ketutup%20lah%2C%20sekarang%20ga%20kaya%20dulu%20tahun%202016%20saya%20bisa%20dapet%2017jt%2Fbulan%2C%0A%0A**w**%3A%20oh%20lumayan%20dulu%20ya%2C%20itu%20biar%20banyak%20yang%20tertarik%20jadi%20driver%20ya%20pak%0A%0A**d**%3A%20iya%2C%20bakar%20duit%20lah%20istilahnya%20pertama-tama%20tu.%20belum%C2%A0lagi%20kita%20kenanya%20pajak%20mobil%20pribadi%203-4%20juta%2C%20bukannya%20umum%20yang%20cuman%20600k%2C%20juga%C2%A0sekarang%20kita%20saingan%20sama%20blueberd%2C%20mereka%20tuh%20bisa%20nerima%20orderan%20juga%20dari%20gojec%2C%20dan%20kalo%20ada%20selisih%20tarif%2C%20gojecnya%20yang%20bayarin%20bukan%20penumpang%2C%20makanya%20lagi%20enak%20banget%20tuh%20driver%20blue%20berd%0A%0A**w**%3A%20wah%2C%20buat%20nutup%20sk%20nya%20aja%20udah%20berat%20ya%20pak%0A%0A**d**%3A%20iya%2C%20terus%20kan%20gara%20gara%20banyak%20yang%20gabisa%20bayar%20sk%2C%20jadinya%20yang%20punya%20uang%2C%20yang%20udah%20kaya%20dari%20awal%20yang%20menang%2C%20mereka%20bisa%20nyediain%20mobil%20banyak%20dan%20sk%20drivernya%20juga%2C%20terus%20kita%20driver%20yang%20gabisa%20bayar%20sk%20ya%20harus%20kerja%20sama%20mereka%2C%20jadi%20jatuhnya%20kerja%20sama%20orang%2C%20ga%20bebas%2C%20ga%20mandiri%20lagi%2C%20kaya%20blueberd%20lah.%0A%0A**w**%3A%20oh%2C%20tapi%20bonus%20harian%20cukup%20lah%20pak%20ya%2C%20buat%20sehari-hari%0A%0A**d**%3A%20alhamdulillah%20cukup%2C%20walau%20udah%20dipotong%20sama%20aplikator%20nya%2020%25%2C%20yang%20mereka%20potong%20langsung%20dari%20saldo%20deposit%20awal%20saya%20kalo%20abis%20ada%20orderan%0A%0A**w**%3A%20oh%2C%20mereka%20motong%20langsung%20gitu%20juga%2C%20ya.%20padahal%20mereka%20udah%20dapet%20untung%20kan%20dari%20yang%20masang%20iklan%20di%20aplikasi%20gojecnya%0A%0A**d**%3A%20iya%2C%20terus%20juga%20harusnya%20pemerintah%20tuh%20neken%20supaya%20gojec%20jadi%20perusahaan%20transportasi%20sekalian%2C%20bukan%20cuman%20ada%20aplikasinya%20aja%20kaya%20sekarang%2C%20biar%20gaada%20lagi%20regulasi%20sk%20dkk%2C%20tapi%20gojecnya%20gamau%2C%20ya%20jadi%20yang%20diteken%20kita%20orang-orang%20kecil%0A%0A**w**%3A%20ya%20gitu%20lah%20pak%2C%20kapitalisme.%20kita%20juga%20yang%20masih%20siswa%20ngerasa%20gitu%2C%20sekolah%20gaguna!%0A%0A**d**%3A%20lah%2C%20kenapa%3F%0A%0A**w**%3A%20gini%20pak%2C%20kita%20belajar%20dari%20tk%20sampe%20lulus%20kuliah%20nanti%2C%20intinya%20itu%20cuman%20mindahin%20isi%20buku%20ke%20kertas%20ujian%2C%20isinya%20cuman%20teori%20gada%20praktek%20sama%20sekali%2C%20belajar%20harus%20textbook%2C%20pantang%20banget%20sama%20yang%20namanya%20inovasi.%0A%0Ainovasi%20dalam%20cara%20penyelesaian%20masalah%20atau%20kreatif%20nyiptain%20solusi%20baru%20yang%20lebih%20efektif%20dibilang%20salah%2C%20gapernah%20diajarin%20cara%20ngomong%2C%20cara%20nego%2C%20dll%20yang%20padahal%20diperluin%20banget%20nanti%20kalo%20udah%20lulus.%0A%0Akita%C2%A0jadinya%20ngerasa%20dari%20tk%20udah%20didesain%20buat%20jadi%20karyawan%20yang%20bisa%20ngejalanin%20mesin-mesinnya%20mereka%20para%20pemilik%20modal%20yang%20udah%20kaya%20dari%20awal%2C%20udah%20didesain%20biar%20nanti%20gedenya%20jadi%20kaya%20orang-orang%20yang%20setiap%20hari%20bangun%20jam%205%2C%20berangkat%20kerja%2C%20baru%20pulang%20jam%207%20malem%2C%20ngulang%20gitu%20terus%20selama%2030%20tahun%2C%20gada%20harapan%20ningkatin%20kesejahteraan%20hidup%20karena%20emang%20ga%20didesain%20buat%20gituan%20dari%20awal.%0A%0Amakanya%20saya%20pas%20kelas%2011%20getol%20banget%20di%20osis%2C%20pen%20ngejar%20ketinggalan%2C%20secara%20saya%20dari%20tk%20anti%20banget%20maju%20di%20depan%2C%20ngomong.%20sekarang%20alhamdulillah%20saya%20mulai%20berani%20ngomong%20depan%20audience.%0A%0A**d**%3A%20haha%2C%20gitu%20ya%2C%20baru%20tau%20saya.%20eh%20ini%20rumahnya%20yang%20mana%3F%0A%0A**w**%3A%20itu%20pak%2C%20yang%20pagarnya%20stainless%20sebelah%20kanan%2C%20muter%20langsung%20aja%20sini%20pak.%0A%0A**d**%3A%20oh%20ok.%20mesjid%20disitu%20kan%3F%20saya%20mau%20sekalian%20ke%20sana.%0A%0A**m**%3A%20sip.%2030k%20kan%3F%20ini%20pak%0A%0A**d**%3A%20makasih%20banyak..%20hati-hati%20ya%0A%0A---%0A%0Agabut%20dong%20ya%2C%20kalo%20pas%20naik%20taksi%20online%20cuman%20diem-dieman%20aja%20di%20mobil.%20apalagi%20buat%20para%20drivernya%20yang%20hariannya%20memang%20nyupirin%20orang-orang%20dari%20berbagai%20kalangan.%0A%0Auntungnya%20udah%20jadi%20kewajaran%20kalo%20para%20driver%20ini%20selalu%20inisiatif%20mulai%20percakapan%2C%20yang%20kadang%20isinya%20bermanfaat%20bat%20dan%20gabisa%20didapetin%20di%20tempat%20lain.%20_respect!_%0A%0A_%5C*editedforyourconvenience_&amp;op=translate\">here you go</a>, if you want to.</p>\n",
      "date_published": "2019-06-28T07:00:00+07:00"
    },{
      "id": "https://mufidu.com/gocar-ngobrol/",
      "url": "https://mufidu.com/gocar-ngobrol/",
      "title": "Ngobrol di Gocar",
      "content_html": "<p><img src=\"/img/photo-of-yellow-taxi-parked-near-sidewalk-2399254.webp\" alt=\"\"></p>\n<h2 id=\"one-day%2C\">one day, <a class=\"direct-link\" href=\"#one-day%2C\">#</a></h2>\n<p><strong>d</strong>: tanggal 10 juli nanti kayanya bakal susah nyari driver ya mas</p>\n<p><strong>w</strong>: kenapa emangnya pak?</p>\n<p><strong>d</strong>: kita driver mau unjuk rasa</p>\n<p><strong>w</strong>: oh, kenapa pak?</p>\n<p><strong>d</strong>: kita mau nunjukin rasa ga suka aja, mulai banyak soalnya peraturan yang bikin susah kita</p>\n<p>yang driver</p>\n<p><strong>w</strong>: emang apa aja pak?</p>\n<p><strong>d</strong>: ada regulasi dari pemerintah, setiap driver harus punya sk masing-masing, buat dapet sk-nya harus bayar 5 juta/tahun/mobil, sedangkan kita dapet bonus perhari paling 180k, ya ga bakal ketutup lah, sekarang ga kaya dulu tahun 2016 saya bisa dapet 17jt/bulan,</p>\n<p><strong>w</strong>: oh lumayan dulu ya, itu biar banyak yang tertarik jadi driver ya pak</p>\n<p><strong>d</strong>: iya, bakar duit lah istilahnya pertama-tama tu. belum lagi kita kenanya pajak mobil pribadi 3-4 juta, bukannya umum yang cuman 600k, juga sekarang kita saingan sama blueberd, mereka tuh bisa nerima orderan juga dari gojec, dan kalo ada selisih tarif, gojecnya yang bayarin bukan penumpang, makanya lagi enak banget tuh driver blue berd</p>\n<p><strong>w</strong>: wah, buat nutup sk nya aja udah berat ya pak</p>\n<p><strong>d</strong>: iya, terus kan gara gara banyak yang gabisa bayar sk, jadinya yang punya uang, yang udah kaya dari awal yang menang, mereka bisa nyediain mobil banyak dan sk drivernya juga, terus kita driver yang gabisa bayar sk ya harus kerja sama mereka, jadi jatuhnya kerja sama orang, ga bebas, ga mandiri lagi, kaya blueberd lah.</p>\n<p><strong>w</strong>: oh, tapi bonus harian cukup lah pak ya, buat sehari-hari</p>\n<p><strong>d</strong>: alhamdulillah cukup, walau udah dipotong sama aplikator nya 20%, yang mereka potong langsung dari saldo deposit awal saya kalo abis ada orderan</p>\n<p><strong>w</strong>: oh, mereka motong langsung gitu juga, ya. padahal mereka udah dapet untung kan dari yang masang iklan di aplikasi gojecnya</p>\n<p><strong>d</strong>: iya, terus juga harusnya pemerintah tuh neken supaya gojec jadi perusahaan transportasi sekalian, bukan cuman ada aplikasinya aja kaya sekarang, biar gaada lagi regulasi sk dkk, tapi gojecnya gamau, ya jadi yang diteken kita orang-orang kecil</p>\n<p><strong>w</strong>: ya gitu lah pak, kapitalisme. kita juga yang masih siswa ngerasa gitu, sekolah gaguna!</p>\n<p><strong>d</strong>: lah, kenapa?</p>\n<p><strong>w</strong>: gini pak, kita belajar dari tk sampe lulus kuliah nanti, intinya itu cuman mindahin isi buku ke kertas ujian, isinya cuman teori gada praktek sama sekali, belajar harus textbook, pantang banget sama yang namanya inovasi.</p>\n<p>inovasi dalam cara penyelesaian masalah atau kreatif nyiptain solusi baru yang lebih efektif dibilang salah, gapernah diajarin cara ngomong, cara nego, dll yang padahal diperluin banget nanti kalo udah lulus.</p>\n<p>kita jadinya ngerasa dari tk udah didesain buat jadi karyawan yang bisa ngejalanin mesin-mesinnya mereka para pemilik modal yang udah kaya dari awal, udah didesain biar nanti gedenya jadi kaya orang-orang yang setiap hari bangun jam 5, berangkat kerja, baru pulang jam 7 malem, ngulang gitu terus selama 30 tahun, gada harapan ningkatin kesejahteraan hidup karena emang ga didesain buat gituan dari awal.</p>\n<p>makanya saya pas kelas 11 getol banget di osis, pen ngejar ketinggalan, secara saya dari tk anti banget maju di depan, ngomong. sekarang alhamdulillah saya mulai berani ngomong depan audience.</p>\n<p><strong>d</strong>: haha, gitu ya, baru tau saya. eh ini rumahnya yang mana?</p>\n<p><strong>w</strong>: itu pak, yang pagarnya stainless sebelah kanan, muter langsung aja sini pak.</p>\n<p><strong>d</strong>: oh ok. mesjid disitu kan? saya mau sekalian ke sana.</p>\n<p><strong>m</strong>: sip. 30k kan? ini pak</p>\n<p><strong>d</strong>: makasih banyak.. hati-hati ya</p>\n<hr>\n<p>gabut dong ya, kalo pas naik taksi online cuman diem-dieman aja di mobil. apalagi buat para drivernya yang hariannya memang nyupirin orang-orang dari berbagai kalangan.</p>\n<p>untungnya udah jadi kewajaran kalo para driver ini selalu inisiatif mulai percakapan, yang kadang isinya bermanfaat bat dan gabisa didapetin di tempat lain. <em>respect!</em></p>\n<p><em>*editedforyourconvenience</em></p>\n",
      "date_published": "2019-06-28T07:00:00+07:00"
    }
  ]
}
