{"id":101,"date":"2020-12-02T05:55:00","date_gmt":"2020-12-02T05:55:00","guid":{"rendered":"https:\/\/blog.mufidu.com\/2020\/12\/otak-kedua.html"},"modified":"2021-06-22T06:57:47","modified_gmt":"2021-06-21T23:57:47","slug":"otak-kedua","status":"publish","type":"post","link":"https:\/\/blog.mufidu.com\/otak-kedua\/","title":{"rendered":"Otak Kedua"},"content":{"rendered":"\n<p>Artikel gua kemarin, <a rel=\"noreferrer noopener\" href=\"https:\/\/blog.mufidu.com\/insight-dari-lean-startup\/\" target=\"_blank\">insight lean startup<\/a> kayanya ga terlalu bisa dibilang sukses (ga runut, poinnya ga dirangkum sampai selesai). Sebenernya itu mungkin karena gua gamau nulis yang biasa aja si, kaya hal-hal basi yang semua orang udah tau. Jadi cukup yang penting-pentingnya aja yang bener-bener bisa nambah insight. Seperti biasa semua gua tulis di Evernote.<\/p>\n\n\n\n<!--more-->\n\n\n\n<p>Kemarin gua baru install Evernote versi aplikasinya. Biasanya gua pake versi web, yang diinstall lewat Microsoft Edge, tapi sekarang gua install langsung Evernotenya, biar bisa dapet semua advantage aplikasi yang ada.<\/p>\n\n\n\n<p>Tapi, ada satu bug yang jelek banget, yaitu spell check yang cuman bisa bahasa inggris dan gabisa dimatiin, jadinya di setiap tulisan gua yang selalu pake bahasa indonesia, selalu ada underscore merah hampir di setiap katanya, dan itu menurut gua ganggu banget.<\/p>\n\n\n\n<p>Akhirnya gua mulai searching di Google buat ngatasin masalah ini, tapi ternyata emang belum diatasin sama developernya. Jadi terpaksa gua harus terbiasa dulu sama garis-garis merah di setiap tulisan. Walaupun gitu, abis searching kemarin gua nemu satu hal yang cukup menarik di Evernote.<\/p>\n\n\n\n<p>Ternyata banyak orang yang gunain Evernote ini untuk jadi tempat pribadi mereka buat nyimpen segala informasi yang mereka dapet di internet, dan karena Evernote punya sistem Search yang bagus, Evernote ini bahkan bisa jadi Google pribadi buat mereka. Kita jadi bisa nyari lagi apa-apa yang pernah kita temuin di internet, tanpa harus nyari dari semua sumber lagi, karena semuanya udah dikumpulin disini.<\/p>\n\n\n\n<p>Kalo kata gua itu keren banget, nyesel gua baru sadar sekarang. Secara otak manusia emang terbatas banget, emang ga selayaknya kita nyimpen semua informasi di otak kita. Otak kita didesain buat mikir dan ngolah informasi yang ada, bukan nyimpen. Bisa sih, buat nyimpen, tapi terbatas, dan nyimpen terlalu banyak informasi di otak bisa ngehambat kita ngolah informasi. Pernah kan, kita mikirin sesuatu hal itu terus gabisa pindah mikirin hal lain. Itu karena yang di otak kita terlanjur numpuk.<\/p>\n\n\n\n<p>Informasi-informasi yang banyak itu bisa kita simpen salah satunya di note-taking app kaya Evernote ini, biar otak kita ga terbebani sama informasi yang bejibun. Kalo dimisalin sama komputer, otak kita itu bisa jadi RAM sementara SSDnya ya Evernote (udah ga jaman harddisk haha).<\/p>\n\n\n\n<p>Selain informasi-informasi dari internet, kita juga bisa nyimpen ide-ide kita di Evernote. Ga jarang kita tiba-tiba kepikiran ide bagus apapun itu, dan takut ide itu hilang saking bagusnya, jadi kepikiran itu terus sampe bisa ngelaksanain ide itu. Nah, kalo kita nulis ide-ide kita di Evernote misalnya, otak kita bakal jadi lebih gampang nyiptain ide-ide keren lainnya, karena ga lagi nyimpen ide-ide lama. Dan ide-ide lama bisa disimpen dulu di Evernote sampai nanti tiba waktunya dikeluarin lagi kalo ada kesempatan.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Artikel gua kemarin, insight lean startup kayanya ga terlalu bisa dibilang sukses (ga runut, poinnya ga dirangkum sampai selesai). Sebenernya itu mungkin karena gua gamau nulis yang biasa aja si, kaya hal-hal basi yang semua orang udah tau. Jadi cukup yang penting-pentingnya aja yang bener-bener bisa nambah insight. Seperti biasa semua gua tulis di Evernote.<\/p>\n","protected":false},"author":1,"featured_media":102,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"neve_meta_sidebar":"","neve_meta_container":"","neve_meta_enable_content_width":"","neve_meta_content_width":0,"neve_meta_title_alignment":"","neve_meta_author_avatar":"","neve_post_elements_order":"","neve_meta_disable_header":"","neve_meta_disable_footer":"","neve_meta_disable_title":""},"categories":[18,21],"tags":[],"amp_enabled":true,"_links":{"self":[{"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/posts\/101"}],"collection":[{"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/comments?post=101"}],"version-history":[{"count":1,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/posts\/101\/revisions"}],"predecessor-version":[{"id":816,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/posts\/101\/revisions\/816"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/media\/102"}],"wp:attachment":[{"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/media?parent=101"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/categories?post=101"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/tags?post=101"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}