{"id":152,"date":"2020-07-22T13:56:00","date_gmt":"2020-07-22T13:56:00","guid":{"rendered":"https:\/\/blog.mufidu.com\/2020\/07\/berkarya-dan-berpendapat.html"},"modified":"2021-06-22T06:57:51","modified_gmt":"2021-06-21T23:57:51","slug":"berkarya-dan-berpendapat","status":"publish","type":"post","link":"https:\/\/blog.mufidu.com\/berkarya-dan-berpendapat\/","title":{"rendered":"Berkarya dan Berpendapat"},"content":{"rendered":"\n<p>Belakangan ini kalo liat di Twitter, lagi banyak banget yang diributin. Banyak. Karena gua lagi mau ngadepin UTBK, gua rasa gua harus banyakin positive vibes, jadi gua pindahin region explore ke US, yang trendingnya keren-keren dan gada ributnya, damai. <\/p>\n\n\n\n<!--more-->\n\n\n\n<p>Gua juga ngefilter beberapa keywords yang mancing ribut. Asli, trending indo toxic banget. Mana kita toxicnya kolektif.<\/p>\n\n\n\n<p>Gua mulai cari-cari orang yang ngeblog dan blognya bagus, dan ketemu <a rel=\"noreferrer noopener\" href=\"https:\/\/gitasav.com\/\" target=\"_blank\">Gita Savitri<\/a>. Isinya bagus banget, kritis, dan jelas. Dia bisa ngungkapin pikirannya lewat tulisan tanpa rancu dan dapet maksudnya. Keren banget. Dia udah nulis dua buku dan salah satunya udah dibuat filmnya.<\/p>\n\n\n\n<p>Ya tapi gua masih sering buka-buka IG, karena mau ngilangin ni FOMO ga bisa-bisa, masih bertahap lah pelan-pelan. Nah, ada satu temen gua yang gacor banget ngebahas persoalan-persoalan agama gitu, biasanya pertama udah viral di Twitter, tapi dia baru liat karena baru ada yang ngeup di Instagram. Karena gua aktif banget buka Twitter, gua liat storynya ya jadi kaya basi banget.<\/p>\n\n\n\n<p>Pertama, apa yang dia bahas udah sering banget dibahas sama public figure yang followersnya ribuan. Dan dia nekeninnya kaya dia yang baru pertama ngebahas itu haha. Gua ga maksud ngerendahin atau ngelarang orang buat menyuruh ke kebaikan gitu apa gimana ya. Karena gimanapun gausah nunggu sempurna untuk bisa menyebarkan kebaikan.<\/p>\n\n\n\n<p>Gua sendiri ga mau ngeluarin pendapat pribadi tentang suatu masalah di social media yang semua orang bisa liat, apalagi sampe ngeyakinin orang buat ngikutin pendapat gua, terutama di hal-hal yang ga gua kuasain banget.&nbsp;<\/p>\n\n\n\n<p>Baru kalo misalnya gua dimintain pendapat tentang hal-hal yang emang gua kuasain banget, gua mau maju. Kelas 12 kemaren gua sering banget ditanyain urusan OSIS sama anak-anak OSIS yang baru, kadang diminta ikut ngumpul dan bahas masalah bareng. Kalo itu gua ayo aja. <\/p>\n\n\n\n<p>Gua mau maju, karena gua emang ngerti banget urusan OSIS. Kelas 11 kita punya tim yang banyak banget ngadain acara, event, dan program kerja. Banyak yang berhasil, alhamdulillah, ada juga yang gagal. Tapi dari yang berhasil dan yang gagal semua bisa diambil pelajarannya.<\/p>\n\n\n\n<p>Di OSIS, gua udah tampil, orang-orang udah tau siapa gua dan apa yang udah gua kerjain, makanya gua berani ngomongin itu. Beda cerita kalau gua komen di social media. Misalnya tentang agama. Gua ga kaya Ustadz Firanda yang emang udah masyhur di masyarakat sebagai salah satu ustadz kibar, gua cuman mantan santri salah satu boarding school dan itupun gada yang tau, ga terkenal sama sekali (guanya, ya).<\/p>\n\n\n\n<p>Gua takut, kalo gua yang bukan siapa-siapa ini ikut-ikutan komentar dan accidentally komentar gua viral, orang-orang bakal kayak, &#8220;Wah, ni orang bukan siapa-siapa tapi ngomentarin beginian, viral lagi, menurut gua salah ni, harus bales komen juga gua.&#8221; <\/p>\n\n\n\n<p>Dan karena mereka nganggep gua yang bukan siapa-siapa aja bisa komentar bahkan sampe viral, mereka juga boleh dong, bersuara. Akhirnya ga jarang terjadilah debat ala-ala Twitter indo yang kalo dibaca cuman bikin gregetan.<\/p>\n\n\n\n<p>Walaupun ga viral juga, tetep mungkin temen-temen kita yang komen, hal-hal yang harusnya dibahas serius jadi bahan becandaan karena kita yang nyampein, atau minimalnya kita dikata sok iye. Gua sih lebih baik gabahas daripada ngundang temen kita becandain hal begituan.<\/p>\n\n\n\n<p>Intinya, kalau kita emang ga nguasain banget suatu hal dan gada karya di bidang itu, ada baiknya kita gausah ikut-ikutan ngebahas biar sekedar edgy. Mending kita kasih waktu dan tempat buat orang yang emang bener-bener paham bidang itu buat ngejelasin.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Belakangan ini kalo liat di Twitter, lagi banyak banget yang diributin. Banyak. Karena gua lagi mau ngadepin UTBK, gua rasa gua harus banyakin positive vibes, jadi gua pindahin region explore ke US, yang trendingnya keren-keren dan gada ributnya, damai.<\/p>\n","protected":false},"author":1,"featured_media":153,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"neve_meta_sidebar":"","neve_meta_container":"","neve_meta_enable_content_width":"","neve_meta_content_width":0,"neve_meta_title_alignment":"","neve_meta_author_avatar":"","neve_post_elements_order":"","neve_meta_disable_header":"","neve_meta_disable_footer":"","neve_meta_disable_title":""},"categories":[12,23],"tags":[],"amp_enabled":true,"_links":{"self":[{"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/posts\/152"}],"collection":[{"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/comments?post=152"}],"version-history":[{"count":1,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/posts\/152\/revisions"}],"predecessor-version":[{"id":833,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/posts\/152\/revisions\/833"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/media\/153"}],"wp:attachment":[{"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/media?parent=152"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/categories?post=152"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/tags?post=152"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}