{"id":185,"date":"2020-07-09T01:49:00","date_gmt":"2020-07-09T01:49:00","guid":{"rendered":"https:\/\/blog.mufidu.com\/2020\/07\/menghargai-waktu.html"},"modified":"2021-06-22T06:57:54","modified_gmt":"2021-06-21T23:57:54","slug":"menghargai-waktu","status":"publish","type":"post","link":"https:\/\/blog.mufidu.com\/menghargai-waktu\/","title":{"rendered":"Menghargai Waktu"},"content":{"rendered":"\n<p>Sering ketika kita melewati waktu yang panjang tapi ternyata ga ngehasilin apa-apa, kita ngerasa gagal. Sebaliknya, ketika kita ngelewatin waktu dan berhasil nyelesain banyak hal, ada rasa bangga ke diri sendiri. <\/p>\n\n\n\n<p>Makanya sering kita rela kerja keras untuk sesuatu, salah satunya karena ngejar perasaan bangga itu. Tapi untuk siapa sebenernya kerja keras kita? <\/p>\n\n\n\n<!--more-->\n\n\n\n<p>Kalo dipikir-pikir, bukan ga mungkin kalo kebanyakan dari kita kerja keras bukan untuk diri sendiri. Emang sih, perasaan bangga bisa nyelesain banyak hal bisa tetep muncul. <\/p>\n\n\n\n<p>Tapi apa hasil dari kerja keras itu bener-bener kita rasain, atau cuman sekedar kerjaan organisasi, kantoran atau apapun yang bahkan sebenernya kita gasuka ngerjainnya?      <\/p>\n\n\n\n<p>Kalo kita suka sih, gada masalah sama sekali. Gapapa kerja keras demi hal-hal yang kita suka, bagus malah. <\/p>\n\n\n\n<p>Tapi untuk kerjaan yang kita sebenernya ga terlalu suka, bakal jauh lebih baik kalo kita mengefisienkan dan mengefektifkan waktu kita disana, bukan tinggalin, tapi efisien, efektif, karena beberapanya walaupun kita gasuka tapi itu udah jadi kewajiban kita. Caranya?<\/p>\n\n\n\n<h2>Pastiin semuanya efisien.<\/h2>\n\n\n\n<p>Efisien berati melakukan sesuatu dengan cara terbaik. Kalau ada cara yang lebih lagi (lebih cepat, lebih murah, lebih bagus, dan lebih lainnya) maka ambil dan pakai cara itu. Tinggalin cara-cara tradisional dan kuno yang udah ga relevan lagi, cari cara yang serbapaling. Misalnya berangkat pakai rute paling cepat, cari supplier yang lebih bagus, dsb.<\/p>\n\n\n\n<h2>Pastiin semuanya efektif<\/h2>\n\n\n\n<p>Efektif berati ngasih efek. Percuma udah efisien tapi ga efektif. Percuma berangkat cepet tapi ternyata bisa selesain dari rumah. Percuma cari supplier bagus ternyata barangnya gampang buat sendiri, dsb. Walaupun udah lama ngabisin tenaga waktu disini, gada salahnya tetep kita tinggalin kalo emang ternyata ga efektif. Better late than never, they said.<\/p>\n\n\n\n<h2>Delegasikan tugas<\/h2>\n\n\n\n<p>Pernah ngedapetin kerjaan yang kita udah bosen kerjainnya dan ternyata banyak orang yang bisa ngerjain itu? Waktunya kita delegasiin kerjaan itu ke orang lain. Bisa jadi kerjaan yang kita bosenin ternyata orang lain suka. Fokus ke hal-hal yang emang kita doang yang bisa atau mahir.<\/p>\n\n\n\n<h2>Beli waktu<\/h2>\n\n\n\n<p>Jangan ragu ngeluarin uang buat hal-hal yang bisa ngehemat waktu, misalnya pesan gofood daripada beli sendiri. Sambil nunggu, kamu bisa kerjain hal-hal lain yang jauh lebih manfaat daripada beli makan sendiri. <\/p>\n\n\n\n<p>Itu juga ngebantu driver gojeknya kan, karena emang mereka dapet penghasilan dari orderan kaya gitu. Kita bisa kerjain hal lain yang emang bidang kita. Apa kita rela ngorbanin berjam-jam antre dan bolak balik rumah cuman demi hemat 20ribuan?   <\/p>\n\n\n\n<hr class=\"wp-block-separator\"\/>\n\n\n\n<p>Nah, setelah kita berhasil bikin waktu kita efisien dan efektif maksimal, tiba-tiba kita jadi punya waktu kosong yang banyak. Jangan sampe waktu kosong ini malah dipake buat hal-hal yang ga bermanfaat, kaya cuman main dan scroll socmed doang.    <\/p>\n\n\n\n<p>Percuma punya waktu kosong tapi ga dimanfaatin. Cari hal-hal yang bermanfaat buat kita. Bisa mulai coba-coba cari pengalaman dan hobi baru, belajar skill-skill baru, perluas wawasan, bangun relasi, travelling sana sini, dan masih banyak lagi.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Sering ketika kita melewati waktu yang panjang tapi ternyata ga ngehasilin apa-apa, kita ngerasa gagal. Sebaliknya, ketika kita ngelewatin waktu dan berhasil nyelesain banyak hal, ada rasa bangga ke diri sendiri. Makanya sering kita rela kerja keras untuk sesuatu, salah satunya karena ngejar perasaan bangga itu. Tapi untuk siapa sebenernya kerja keras kita?<\/p>\n","protected":false},"author":1,"featured_media":186,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"neve_meta_sidebar":"","neve_meta_container":"","neve_meta_enable_content_width":"","neve_meta_content_width":0,"neve_meta_title_alignment":"","neve_meta_author_avatar":"","neve_post_elements_order":"","neve_meta_disable_header":"","neve_meta_disable_footer":"","neve_meta_disable_title":""},"categories":[18],"tags":[],"amp_enabled":true,"_links":{"self":[{"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/posts\/185"}],"collection":[{"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/comments?post=185"}],"version-history":[{"count":1,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/posts\/185\/revisions"}],"predecessor-version":[{"id":844,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/posts\/185\/revisions\/844"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/media\/186"}],"wp:attachment":[{"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/media?parent=185"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/categories?post=185"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/tags?post=185"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}