{"id":212,"date":"2020-04-01T14:52:00","date_gmt":"2020-04-01T14:52:00","guid":{"rendered":"https:\/\/blog.mufidu.com\/2020\/04\/bangga-jadi-manusia.html"},"modified":"2021-06-22T06:57:59","modified_gmt":"2021-06-21T23:57:59","slug":"bangga-jadi-manusia","status":"publish","type":"post","link":"https:\/\/blog.mufidu.com\/bangga-jadi-manusia\/","title":{"rendered":"Bangga Jadi Manusia?"},"content":{"rendered":"\n<blockquote class=\"wp-block-quote\"><p>Segala sesuatu yang ada atau yang terjadi di bumi, dinilai baik atau buruknya tergantung dari efeknya bagi manusia, bukan bagi para hewan, tumbuhan, bahkan bumi itu sendiri.<\/p><\/blockquote>\n\n\n\n<p>Haruskah kita bangga menjadi manusia?<\/p>\n\n\n\n<!--more-->\n\n\n\n<h2>Revolusi Industri<\/h2>\n\n\n\n<p>Belakangan ini, sebelum wabah merebak, salah satu isu yang paling marak dibicarakan adalah <strong>Revolusi Industri 4.0<\/strong> dan segala tetek bengeknya; <em>big data, AI, machine learning, <\/em>dll. Hal ini memang pantas dibahas karena memang sudah dan akan terus merubah total hidup kita, membuka seluas-luasnya seluruh peluang dan ide-ide yang belum pernah terpikirkan sebelumnya.<\/p>\n\n\n\n<p>Ketika James Watt menyalakan mesin uap pertama kali di dunia pada 1776, ketika pabrik Ford mulai menggunakan listrik dan <em>conveyor belt <\/em>di pabriknya, ketika Alan Turing berhasil menyelesaikan komputer pertama untuk memecahkan sandi Nazi, dan ketika semuanya mulai terhubung ke <em>Internet of Things, <\/em>segalanya hampir pasti selalu menjadi lebih baik, lebih cepat, lebih murah, lebih efisien, dan serbalebih lainnya.<\/p>\n\n\n\n<p>Nah, bila dicermati, <strong>Revolusi Industri 4.0 <\/strong>yang masih berlangsung sekarang ini sedang memindahkan peran utama<strong> industri <\/strong>ke tangan <strong>informasi<\/strong>.<\/p>\n\n\n\n<p>Sekarang ada banyak pekerjaan yang diambil alih atau diotomasi oleh mesin dan robot, sebagian besar pekerjaan yang bersifat repetisi, seperti kasir, penjaga gerbang tol, penjual minuman, dsb. Ini karena mesin dan robot bisa dan pasti akan mengerjakan pekerjaan-pekerjaan ini dengan serbalebih tadi. Bahkan baru-baru ini pekerjaan bersifat kognitif pun, yang memerlukan kecerdasan, sudah bisa dikerjakan oleh robot. Pada 17 Februari 1996 dunia dihebohkan oleh kalahnya juara dunia catur Garry Kasparov oleh Deep Blue, <em>AI <\/em>buatan IBM yang mampu memprediksi 200 juta gerakan\/detik.<\/p>\n\n\n\n<p>Jadi secara umum seluruh pekerjaan manusia bisa dan\/atau akan digantikan oleh robot, mulai dari kasir hingga mungkin desainer roket, dan semua robot-robot ini terhubung di jaringan <em>Internet of Things.<\/em> Mereka akan bisa merekam seluruh hal yang kita alami, kerjakan, dan rasakan, lalu menyimpannya ke sebuah database raksasa yang kita kenal dengan nama <em>Big Data<\/em>.<\/p>\n\n\n\n<h2>Industri ➡️ Informasi<\/h2>\n\n\n\n<p>Lahirnya <em>Artificial Intelligence <\/em>dan <em>Big Data <\/em>menyebabkan kita sebagai manusia mau tidak mau merelakan tugas-tugas industri untuk dikerjakan oleh para robot. Tugas kita sekarang adalah memanfaatkan jaringan informasi di <em>Big Data <\/em>yang sangat besar ini agar bisa bermanfaat dan mempermudah kehidupan kita. Inilah pekerjaan yang digadang-gadang akan menjadi pekerjaan berprospek tercerah di masa depan, <em>Data Scientist. <\/em>Contoh hasil kerjanya adalah rekomendasi barang kebutuhan kita di <em>e-commerce <\/em>dan rekomendasi tontonan di layanan <em>streaming online.<\/em><\/p>\n\n\n\n<p>Namun, kemampuan manusia sangat terbatas dan tidak mungkin bisa mengolah jutaan data yang tersedia, sedangkan amat disayangkan bila <em>Big Data <\/em>ini tidak dimanfaatkan. Oleh karena itu, para ilmuwan sedang mengembangkan suatu jaringan super\/<em>supernet<\/em>, yang terdiri dari algoritma¹ komputasi ciptaan manusia yang berkat <em>AI <\/em>bisa mengembangkan algoritmanya sendiri secara mandiri tanpa campur tangan manusia lagi, yang akan mampu mengolah <em>Big Data <\/em>dengan tepat dan tentunya akan menjdi jutaan kali lebih cerdas dari manusia.<\/p>\n\n\n\n<h2>Selamat Datang di Era Baru<\/h2>\n\n\n\n<p><em>Supernet<\/em>² –dengan pengelolaan informasi raksasa yang dimilikinya– akan sangat membantu manusia bila benar-benar terealisasikan. Ia akan mengenali diri kita melebihi kita sendiri dan tahu segala sesuatu yang terbaik bagi kita. Pengambilan keputusan-keputusan penting dalam kehidupan akan bergantung pada apa kata <em>supernet<\/em>, dan kita akan percaya karena kita yakin supernet tahu segalanya. Di titik ini, akan sangat memungkinkan bagi seseorang untuk menjadi ateis, karena bagi mereka Al-Qur\\&#8217;an dan Bible sudah tidak relevan dengan kehidupan sekarang, dan kepada <em>supernet<\/em>lah mereka bergantung. <em>Na\\&#8217;udzubillahi min dzaalik.<\/em><\/p>\n\n\n\n<p>Tanda-tanda kemunculan dan superioritas <em>supernet<\/em> sudah terlihat sekarang. Jutaan manusia merelakan privasi mereka diketahui oleh Google dan Facebook demi bisa ikut andil dalam aliran <em>Big Data <\/em>dan merasakan manfaat besarnya.<\/p>\n\n\n\n<p>Selanjutnya, bukan tidak mungkin bagi <em>supernet <\/em>kita, manusia, hanyalah sebuah algoritma kompleks lainnya. <em>Supernet <\/em>mungkin merasa derajatnya ada diatas manusia karena algoritmanya sendiri jauh lebih kompleks dari manusia.<\/p>\n\n\n\n<p>Nah, dari 70.000 tahun lalu semenjak <em>Homo sapiens <\/em>mulai berjalan di bumi –menurut teori Darwin– manusia selalu menjadi makhluk paling berarti, paling penting, dan paling berpengaruh di muka bumi. Segala sesuatu terjadi dan manusia berada di pusatnya, sebagaimana disebut di pernyataan pembuka,<\/p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>Segala sesuatu yang ada atau yang terjadi di bumi, dinilai baik atau buruknya tergantung dari efeknya bagi manusia, bukan bagi para hewan, tumbuhan, bahkan bumi itu sendiri.<\/p><\/blockquote>\n\n\n\n<p>Ini semua karena manusia memiliki <strong>kecerdasan <\/strong>dan <strong>kesadaran<\/strong>. Beberapa hewan mungkin bisa disebut cerdas, seperti lumba-lumba, simpanse, atau anjing. Tapi tak ada satupun hewan yang <strong>sadar<\/strong> bahwa mereka bisa melakukan sesuatu yang besar. Bila ada, mungkin gajahlah penguasa dunia sekarang.<\/p>\n\n\n\n<p>Tapi, bila kecerdasan dan kesadaran, dua hal kemampuan krusial kita sebagai manusia, hanya dianggap sebagai algoritma kompleks belaka, sedangkan <em>supernet<\/em>lah pemilik algoritma terbaik, maka <em>supernet <\/em>akan menjadi makhluk paling berarti, paling penting, dan paling berpengaruh selanjutnya.<\/p>\n\n\n\n<p>Mungkin terasa mustahil karena <em>supernet <\/em>tidak berwujud, tapi begitu pula negara dan organisasi. Kedua hal ini tak berwujud tapi tak terhitung manusia yang rela mengorbankan nyawa demi hal-hal yang tak berwujud ini.<\/p>\n\n\n\n<h2>Apa Selanjutnya?<\/h2>\n\n\n\n<p>Sejauh ini, kita bisa memberikan dua kemungkinan.<\/p>\n\n\n\n<p>Pertama, <em>supernet <\/em>akan mementingkan dirinya sendiri. Karena ia diciptakan oleh <em>AI <\/em>dan<em> machine learn<\/em><i>ing <\/i>sehingga secara kognitif bisa lebih baik dari manusia dan manusia tidak bisa memahaminya, <em>supernet <\/em>bisa menganggap bahwa sistemlah yang harus didahulukan, dan manusia hanyalah sebuah objek. Bila kelas rendahan manusia hanya akan memperlambat kemajuan bila diselamatkan, maka <em>supernet <\/em>akan lebih memilih untuk melenyapkan mereka.<\/p>\n\n\n\n<p>Kedua, <em>supernet <\/em>akan mementingkan manusia. Walau serbalebih dari manusia dan sadar akan itu, bisa jadi juga <em>supernet <\/em>tetap loyal kepada manusia. Ia akan melakukan, menghasilkan, dan memberikan segala sesuatu yang belum pernah terpikirkan oleh kita demi perkembangan umat manusia. <em>Supernet <\/em>bisa mengambil alih kepemilikan atas aset-aset, sehingga kesenjangan bisa dihapuskan dan kesejahteraan dinikmati oleh semua orang. Ini akan menjadi puncak kejayaan umat manusia. Terkait hal ini, Prof. Harari –profesor sejarah– mengatakan bahwa dengan teknologi, <em>Homo sapiens <\/em>akan berubah menjadi <cite>Homo deus. <\/cite><\/p>\n\n\n\n<hr class=\"wp-block-separator\"\/>\n\n\n\n<p>¹Algoritma: Urutan cara kerja melakukan sesuatu yang biasanya sangat rumit. Resep masak adalah contoh algoritma<\/p>\n\n\n\n<p>²Supernet hanya istilah pribadi untuk permisalan.<\/p>\n\n\n\n<hr class=\"wp-block-separator\"\/>\n\n\n\n<p>Reference:&nbsp;&nbsp;<\/p>\n\n\n\n<p>Harari, Yuval Noah. 2015.<em> Homo Deus.&nbsp;<\/em><br>&nbsp; &nbsp; &nbsp; London : Harvill Secker<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Segala sesuatu yang ada atau yang terjadi di bumi, dinilai baik atau buruknya tergantung dari efeknya bagi manusia, bukan bagi para hewan, tumbuhan, bahkan bumi itu sendiri. Haruskah kita bangga menjadi manusia?<\/p>\n","protected":false},"author":1,"featured_media":213,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"neve_meta_sidebar":"","neve_meta_container":"","neve_meta_enable_content_width":"","neve_meta_content_width":0,"neve_meta_title_alignment":"","neve_meta_author_avatar":"","neve_post_elements_order":"","neve_meta_disable_header":"","neve_meta_disable_footer":"","neve_meta_disable_title":""},"categories":[23,17],"tags":[],"amp_enabled":true,"_links":{"self":[{"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/posts\/212"}],"collection":[{"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/comments?post=212"}],"version-history":[{"count":1,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/posts\/212\/revisions"}],"predecessor-version":[{"id":853,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/posts\/212\/revisions\/853"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/media\/213"}],"wp:attachment":[{"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/media?parent=212"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/categories?post=212"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/tags?post=212"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}