{"id":215,"date":"2019-12-21T22:25:00","date_gmt":"2019-12-21T22:25:00","guid":{"rendered":"https:\/\/blog.mufidu.com\/2019\/12\/merangkul-keberagaman.html"},"modified":"2021-06-22T06:58:00","modified_gmt":"2021-06-21T23:58:00","slug":"merangkul-keberagaman","status":"publish","type":"post","link":"https:\/\/blog.mufidu.com\/merangkul-keberagaman\/","title":{"rendered":"Merangkul Keberagaman"},"content":{"rendered":"\n<p>👩🏻: &#8220;Liat, deh. Itu pengemis ganggu banget, ya. Semua yang lewat disamperin, dimintain duit.&#8221;<\/p>\n\n\n\n<p>🧑: &#8220;Ya wajar lah kan emang dia pengemis.&#8221;<\/p>\n\n\n\n<!--more-->\n\n\n\n<p>👩🏻: &#8220;Iya, sih. Tapi kan harusnya dia beretika lah, kan siapa tau orangnya lagi buru-buru, coba ngemisnya tuh pinter dikit, komunikasinya dimainin, kan enak.&#8221;<\/p>\n\n\n\n<p>🧑: &#8220;Lah, kamu liat dari sudut pandang dia juga dong. Kalo dia jago etika, pinter, jago komunikasi juga, ngabakal dia jadi pengemis, mending jadi pengacara.&#8221;<\/p>\n\n\n\n<hr class=\"wp-block-separator\"\/>\n\n\n\n<p>Perbedaan pendapat adalah suatu kelumrahan yang fix terjadi di zaman ini, mengikuti beragamnya sudut pandang orang-orang terhadap segala sesuatu.<\/p>\n\n\n\n<p>Setiap manusia memiliki sudut pandangnya masing-masing, yang terbentuk oleh beragam pengalaman yang dialaminya selama menjalani kehidupan.<\/p>\n\n\n\n<p>Misalnya, seorang pengusaha sukses pasti memandang ilmu tak penting, yang penting praktek, karena dia telah melihat bahwa teman-temannya yang gagal berbisnis adalah mereka yang hanya pandai teori dan tak pernah praktik.<\/p>\n\n\n\n<p>Tapi, seorang ilmuwan akan memandang praktik tanpa ilmu adalah omong kosong bahkan berbahaya, karena mereka telah melihat bahwa teman-temannya yang gagal dalam eksperimen adalah mereka yang tidak memahami objeknya dan hanya asal coba saja.<\/p>\n\n\n\n<p>Nah, karena setiap manusia menjalani kehidupan yang berbeda-beda juga memiliki pengalaman dan wawasan yang beragam, maka tak akan bisa terhitung banyaknya sudut pandang yang bisa diambil untuk melihat kehidupan; peristiwa, tragedi, pengalaman, kejadian, kehebohan.<\/p>\n\n\n\n<p>Kita sering melihat manusia-manusia memperdebatkan fenomena-fenomena tertentu, memperjuangkan sudut pandangnya agar menjadi yang paling benar.<br>Bisa dari segi agama, segi ekonomis, dan dari segisegi lainnya.<\/p>\n\n\n\n<p>Lalu, kita dibuat bingung.<\/p>\n\n\n\n<p>Sudut pandang manakah yang benar?<\/p>\n\n\n\n<p>Bila kita menginginkan kebenaran, cara yang paling mungkin adalah dengan mengikuti sudut pandang orang yang paling paham dengan hal-hal terkait masalah tersebut.<\/p>\n\n\n\n<p>Ketika berbicara masalah agama, ikuti pendapat para ulama.<\/p>\n\n\n\n<p>Ketika berbicara masalah pendidikan, ikuti pendapat para cendekiawan.<\/p>\n\n\n\n<p>Ketika berbicara masalah teknologi, ikuti pendapat para teknisi.<\/p>\n\n\n\n<p>Terlebih di zaman ini sering kali tersebar hoax dan post-truth, maka dibutuhkan usaha yang lebih untuk mengungkap kebenaran dari balik kabut.<br>Sumber-sumber yang salah dan menyimpang jangan dijadikan acuan.<\/p>\n\n\n\n<p>Setelah mendapat kebenaran, akan kita temui orang-orang yang berbeda pandangan. Pandangan mereka sama sekali berbeda, namun bukan tak mungkin mengandung nilai kebenaran yang sama. Dimulailah adu kata untuk menguji apakah pantas pandangan itu dibela.<\/p>\n\n\n\n<p>Padahal, bila sudah demikian, mungkin sudah saatnya untuk saling membuka pikiran. Dengan melihat dari sudut pandang lawan, rasa jengkel, iri, dan kesal akan terganti dengan rasa hormat, respek dan segan.<\/p>\n\n\n\n<p>Meraih kebenaran dengan menggabungkan pemikiran, bukan saling menjatuhkan, karena kelebihan dan kekurangan dimiliki setiap orang. Selesailah masalah perbedaan.<\/p>\n\n\n\n<p>Terakhir,<br>Mari kita sebut ini dengan keberagaman alih-alih perbedaan, karena ini bukanlah perbedaan yang memancing pertikaian, melainkan keberagaman yang membentuk kesempurnaan.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>👩🏻: &#8220;Liat, deh. Itu pengemis ganggu banget, ya. Semua yang lewat disamperin, dimintain duit.&#8221; 🧑: &#8220;Ya wajar lah kan emang dia pengemis.&#8221;<\/p>\n","protected":false},"author":1,"featured_media":216,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"neve_meta_sidebar":"","neve_meta_container":"","neve_meta_enable_content_width":"","neve_meta_content_width":0,"neve_meta_title_alignment":"","neve_meta_author_avatar":"","neve_post_elements_order":"","neve_meta_disable_header":"","neve_meta_disable_footer":"","neve_meta_disable_title":""},"categories":[23],"tags":[],"amp_enabled":true,"_links":{"self":[{"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/posts\/215"}],"collection":[{"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/comments?post=215"}],"version-history":[{"count":1,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/posts\/215\/revisions"}],"predecessor-version":[{"id":854,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/posts\/215\/revisions\/854"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/media\/216"}],"wp:attachment":[{"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/media?parent=215"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/categories?post=215"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/tags?post=215"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}