{"id":46,"date":"2021-02-09T08:03:00","date_gmt":"2021-02-09T08:03:00","guid":{"rendered":"https:\/\/blog.mufidu.com\/2021\/02\/rangkuman-cs50x.html"},"modified":"2021-06-22T06:57:45","modified_gmt":"2021-06-21T23:57:45","slug":"rangkuman-cs50x","status":"publish","type":"post","link":"https:\/\/blog.mufidu.com\/rangkuman-cs50x\/","title":{"rendered":"Rangkuman CS50x"},"content":{"rendered":"\n<p>CS50x adalah sebuah online course yang disediakan oleh Harvard melalui platform edX. Course ini bisa menjadi bahan pertama sebelum mendalami programming lebih lanjut, karena di sini dipelajari bagaimana komputer bekerja, kita juga belajar beberapa bahasa pemrograman, yaitu C (yang utama), Python, SQL, dan sedikit JavaScript. Flask, sebuah library untuk web development juga dibahas di sini.<\/p>\n\n\n\n<!--more-->\n\n\n\n<p>Saya mengikuti kelas <a href=\"https:\/\/learning.edx.org\/course\/course-v1:HarvardX+CS50+X\">CS50x<\/a>&nbsp;ini&nbsp;mulai tanggal 6 Januari 2021. Dan selesai 9 Februari 2021.<\/p>\n\n\n\n<p>Saya memutuskan mengikutinya untuk memperdalam pemahaman saya tentang dasar-dasar Computer Science, bagaimana sebuah komputer bisa bekerja dan berkomunikasi dengan kita para programmer.<\/p>\n\n\n\n<p>Sebelumnya saya sudah menyelesaikan kelas <a href=\"https:\/\/www.udemy.com\/course\/complete-python-bootcamp\/\">2021 Complete Python Bootcamp<\/a>, sehingga saya seharusnya sudah cukup menguasai Python, tapi saya merasa harus memperdalam dulu pemahaman dasarnya sebelum melangkah lebih jauh.<\/p>\n\n\n\n<p>Kelas ini diajar oleh salah satu professor Harvard yang sudah bertahun-tahun mengajar materi ini, yaitu David J. Malan. Di akhir kelas, diberikan sertifikat untuk mereka yang mengumpulkan semua Problem Sets dengan nilai masing-masing minimal 70%.<\/p>\n\n\n\n<p>Saya menulis ini sebagai untuk mencatat apa-apa yang sudah saya pelajari di kelas ini sebagai refleksi setiap ada pelajaran yang bisa saya ambil. Kelas ini berbentuk video rekaman yang berdurasi sekitar dua jam per minggunya, ditambah beberapa video pendek.<\/p>\n\n\n\n<h1><a href=\"https:\/\/cs50.harvard.edu\/x\/2021\/notes\/0\/\">Week 0<\/a><\/h1>\n\n\n\n<p>Di minggu pertama ini David menjelaskan dasar-dasar cara komputer berkomunikasi dengan programmer.<\/p>\n\n\n\n<p>Programmer memang menulis program seperti Python, Java, C, dan lain-lain untuk menugasi komputer dengan berbagai task yang diperlukan, tapi komputer sebenarnya masih tidak mengerti bahasa pemrograman yang kita tulis itu.<\/p>\n\n\n\n<p>Lalu, bahasa pemrograman yang ditulis programmer dicompile atau diterjemahkan menjadi satu-satunya bahasa yang dimengerti oleh komputer, yaitu binary.<\/p>\n\n\n\n<h3>Binary<\/h3>\n\n\n\n<p>Binary adalah angka 0 dan 1. <strong>0 menunjukkan off dan 1 menunjukkan on<\/strong>. Komputer bisa mengerti bahasa binary karena dalam kelistrikan, kita bisa menyalakan dan mematikan sesuatu, seperti menekan saklar untuk menyalakan dan mematikan lampu.<\/p>\n\n\n\n<p>Komputer bisa memahami ribuan kombinasi 0 dan 1 yang merepresentasikan berbagai huruf, angka, warna, atau apapun yang ditampilkan di layar. Satu angka 0 atau satu inilah yang biasa kita sebut <strong>bit<\/strong>.<\/p>\n\n\n\n<p>Satu kelompok bits berjumlah 8 bits, dan biasa kita sebut <strong>byte<\/strong>.<\/p>\n\n\n\n<p>Apa bedanya 32-bit dan 64-bit? Sistem 32-bit berarti sistem tersebut merepresentasikan sesuatu per 32 bits, dan sistem 64-bit berarti sistem yang merepresentasikan sesuatu per 64 bits.<\/p>\n\n\n\n<h3>Binary ke Text<\/h3>\n\n\n\n<p>Kita bisa merepresentasikan binary ke teks menggunakan kombinasi angka yang telah semua manusia sepakati bersama. Misalnya kita menggunakan angka &#8220;65&#8221; untuk merepresentasikan huruf A, dan \\&#8221;66\\&#8221; untuk merepresentasikan huruf B.<\/p>\n\n\n\n<p>Total kombinasi yang dihasilkan dari satu byte atau 8 bit adalah 2 pangkat 8, yaitu <strong>256 kombinasi<\/strong>.<\/p>\n\n\n\n<p>Semua kombinasi itu telah dipetakan oleh kita manusia puluhan tahun lalu dan biasa disebut <a href=\"https:\/\/en.wikipedia.org\/wiki\/ASCII\">ASCII<\/a>, American Standard Code for Information Interchange.<\/p>\n\n\n\n<h3>Binary ke Warna<\/h3>\n\n\n\n<p>Kita juga bisa merepresentasikan bit ke warna dengan sistem <strong>RGB<\/strong>. Satu pixel mengandung kombinasi byte untuk warna merah, satu byte untuk hijau, dan satu byte untuk biru. Maka satu pixel mengandung 3 byte.<\/p>\n\n\n\n<p>Satu byte memiliki rentang dari 0 sampai 255 (total 256 karena mulai dari 0). Misalnya 72, 73, dan 33 berarti warnanya adalah sekitar sepertiga merah, sepertiga hijau, dan sedikit biru. Hasilnya adalah warna di bawah.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><a href=\"https:\/\/www.blog.mufidu.com\/wp-content\/uploads\/2021\/02\/5bbed-image.png\"><img src=\"https:\/\/www.blog.mufidu.com\/wp-content\/uploads\/2021\/02\/5bbed-image.png\" alt=\"\"\/><\/a><\/figure>\n\n\n\n<div class=\"separator\" style=\"clear: both; text-align: center;\"><\/div>\n\n\n\n<p>Resolusi gambar bergantung ke jumlah pixel yang dikandung suatu gambar, maka semakin jelas suatu gambar, maka makin besar resolusinya ,makin besar bytes yang dikandungnya, dan makin besar juga sizenya.<\/p>\n\n\n\n<h3>Algoritma<\/h3>\n\n\n\n<p>Algoritma adalah step-by-step melakukan sesuatu. Kita sering memakai algoritma di kehipan sehari-hari, misalnya ketika mengikuti resep, wikihow, dan lain-lain.<\/p>\n\n\n\n<p>Kita bisa menyelesaikan masalah menggunakan komputer dengan cara memasukkan suatu <strong>input<\/strong>, lalu komputer akan mengolahnya dengan algoritma yang telah kita buat, dan komputer akan mengeluarkan hasilnya atau <strong>output<\/strong>.<\/p>\n\n\n\n<p>Algoritma biasanya ditulis menggunakan bahasa pemrograman seperti Python dan kawan-kawan, kemudian dicompile agar bisa dimengerti oleh komputer. Kita harus menulis algoritama dengan jelas tanpa ambigu supaya tidak menyebabkan bug\/error pada program.<\/p>\n\n\n\n<h3>Scratch<\/h3>\n\n\n\n<p>Terakhir, David mendemonstrasikan sebuah aplikasi simple yang menggunakan konsep algoritma di pemrograman, yaitu <a href=\"https:\/\/scratch.mit.edu\/\">Scratch<\/a> yang dikembangkan oleh MIT.<\/p>\n\n\n\n<p>David menjelaskan beberapa konsep yang biasa digunakan di pemrograman, yaitu functions, conditions, Boolean expressions, loops, variables, events, dan threads.<\/p>\n\n\n\n<p>Ada satu konsep yang cukup menarik yaitu <strong>abstraction<\/strong>, yaitu membuat simpel sesuatu yang kompleks. Manfaatnya adalah kita tidak perlu tahu bagaimana suatu function di program dibuat asalkan kita mengerti bagaimana menggunakannya.<\/p>\n\n\n\n<h1><a href=\"https:\/\/cs50.harvard.edu\/x\/2021\/notes\/1\/\">Week 1<\/a><\/h1>\n\n\n\n<p>Di Week 1 David menjelaskan bahasa pemrograman pertama di CS50, bahasa C. Secara garis besar, kita tinggal menerjemahkan apa yang di Scratch ke C. Struktur dan konsepnya sama, cuman sekarang kita hanya bisa menggunakan keyboard saja, tidak bisa lagi drop n drag seperti di Scratch.<\/p>\n\n\n\n<p>Interface di C juga jauh kurang menarik dibandingkan Scratch, karena hanya ada terminal dan tempat menulis code nya yang hampir semuanya berwarna hitam.<\/p>\n\n\n\n<p>Dalam menuliskan code, kita harus memerhatikan 3 poin, yaitu,<\/p>\n\n\n\n<ol><li><strong>Correctness<\/strong>, yaitu apakah kode kita sudah benar dan menghasilkan output yang kita inginkan.<\/li><li><strong>Design,<\/strong> kita harus menulis code dengan efisien dan elegan agar lebih mudah dibaca, tanpa ada repetisi yang tidak diperlukan.<\/li><li><strong>Style<\/strong>, code kita juga harus estetik, mengikuti peraturan yang ada tentang indentasi dan simbol-simbol lain yang biasa dipakai. Memang tidak memengaruhi output code kita, tapi sangat membantu kita untuk membacanya dan menganalisisnya bila nanti ada kesalahan.<\/li><\/ol>\n\n\n\n<p>Sisanya, David menjelaskan step-by-step penulisan code dalam bahasa C di Integrated Development Environment (IDE) yang khusus dibuat untuk CS50, yaitu <a href=\"https:\/\/ide.cs50.io\">CS50 IDE<\/a>.<\/p>\n\n\n\n<p>Mulai dari cara menulis boilerplate, mengcompile code agar komputer bisa mengerti program kita, dan tools serta library yang sudah disediakan staff CS50 untuk mempermudah kita.<\/p>\n\n\n\n<p>Syntax dan logic di C sangat mirip dengan Python. Saya tidak akan menulis tentang itu panjang-panjang di sini karena bisa ditemukan di tempat lain yang lebih baik.<\/p>\n\n\n\n<p>Satu hal yang mungkin menarik, yaitu 1\/10 di C bila kita menggunakan variabel bertipe float, maka hasilnya adalah 0.10000000149011611938476562500000000000000000000000, ini karena keterbatasan kemampuan komputasi komputer sehingga tidak bisa sempurna presisi.<\/p>\n\n\n\n<p>Keterbatasan bits juga akan menyebabkan kita kehabisan bits tidak lama lagi. Puluhan tahun lalu para ilmuwan komputer menyepakati untuk menggunakan sistem 32-bit untuk menghitung detik terhitung mulai tanggal 1 Januari 1970, yang bila dihitung, akan habis di 19 Januari 2038.<\/p>\n\n\n\n<h1><a href=\"https:\/\/cs50.harvard.edu\/x\/2021\/notes\/2\/#arrays\">Week 2<\/a><\/h1>\n\n\n\n<p>Kali ini kita memperdalam Array, masih di bahasa C. Sebelumnya David menjelaskan lebih lanjut tentang compile mengcompile di C, yang di minggu lalu kita menggunakan <code>make<\/code>. Ternyata <code>make<\/code> ini hanyalah salah satu dari penerapan konsep Abstraction, jadi make itu mengautomasi langkah-langkah mengcompile code.<\/p>\n\n\n\n<p>Bila dilakukan secara manual, bukan menggunakan make, maka kita harus menggunakan command <code>clang<\/code>. Selebihnya bisa dicek <a href=\"https:\/\/cs50.harvard.edu\/x\/2021\/notes\/2\/\">di sini<\/a>.<\/p>\n\n\n\n<p>Lalu kita juga dijelaskan tentang debugging dan penggunaan memory masing-masig variabel.<\/p>\n\n\n\n<p>Baru kemudian pembahasan utama yaitu array. Array di C sangat mirip dengan di python hanya saja syntaxnya agak lebih ribet. Konsep string keduanya juga sama, jadi kita bisa mengakses satu per satu karakter di string dengan indexing.<\/p>\n\n\n\n<p>Satu hal yang menarik yang dijelaskan Mr. Malan, kita bisa bisa mengetahui panjang suatu string dengan menggunakan function strlen(), atau dengan cara manualnya yaitu melakukan iterasi sampai ditemukan char yang mempunyai value 0.<\/p>\n\n\n\n<p>Jadi di C, ketika kita membuat sebuah string, maka C akan otomatis menambahkan satu byte di akhir yang isinya 0 semua (8 bits). Itu untuk menandai bahwa disitulah akhir sebuah string.<\/p>\n\n\n\n<p>Uniknya, tidak seperti di Python, kita bisa mengakses memori yang berada di luar jangkauan index string kita. Misalnya jika kita membuat string bernama str dan berisi &#8220;Hi!&#8221;, kita bisa mengakses str[3] dan bahkan str[1000]. Lalu kita akan melihat simbol-simbol atau value yang berada di memori tersebut. C memang memberikan kita kemampuan untuk melakukan itu.<\/p>\n\n\n\n<h1><a href=\"https:\/\/cs50.harvard.edu\/x\/2021\/notes\/3\/\">Week 3<\/a><\/h1>\n\n\n\n<p>Kali ini kita banyak membahas tentang <strong>algoritma<\/strong>. Ada dua jenis algoritma yang dibahas, yaitu <strong>searching algorithm<\/strong> dan <strong>sorting algorithm<\/strong>.<\/p>\n\n\n\n<p>Setiap algoritma memiliki kelebihan dan kekurangannya masing-masing, ada yang lebih cepat tapi boros memori, dan ada yang jauh lebih lambat tapi cenderung ringan dijalankan.<\/p>\n\n\n\n<p>Kecepatan suatu algoritma biasa disimbolkan dengan big O (banyak langkah di kemungkinan terburuk), omega (banyak langkah di kemungkinan terbaik), dan theta (jika big O dan omeganya sama).<\/p>\n\n\n\n<h3>Searching Algorithm<\/h3>\n\n\n\n<p>Adalah algoritma yang digunakan untuk mencari sesuatu dalam kumpulan objek yang ada. Komputer tidak seperti manusia yang bisa melihat banyak objek secara sekilas dan langsung menemukan apa yang dicari. Komputer hanya bisa melihat satu demi satu anggota dari kumpulan objek, misalnya array.<\/p>\n\n\n\n<p>Oleh karena itu, kita membutuhkan algoritma yang menentukan step by step apa saja yang akan dilakukan komputer untuk menemukan yang ingin kita cari. Ada dua algoritma yang bisa kita coba, yaitu,<\/p>\n\n\n\n<ul><li>\n<p>Linear Search<\/p>\n<p>Di sini kita melihat objeknya satu per satu, sampai kita menemukan apa yang kita cari.<\/p>\n<p>Kecepatan algoritma ini Big O(n) di mana kita harus menyusuri semua objek bila objek yang ingin kita cari ternyata ada di urutan terakhir, dan Omega(1) bila ternyata objeknya ada di urutan pertama sehingga kita hanya perlu melihat satu objek.<\/p>\n<\/li><li>\n<p>Binary Search<\/p>\n<p>Bisa dibilang algortima ini lebih baik karena kita tidak perlu melihat satu per satu objeknya. Pertama kita mulai dari tengah, bila valuenya ternyata lebih kecil dari yang kita cari, maka kita cari lagi dari bagian tengah dari setengah bagian kanan. Kalau valuenya lebih besar, maka carinya dari bagian tengah dari setengah bagian kiri. Begitu seterusnya sampai ketemu.<\/p>\n<p>Ada satu syarat sebelum bisa melakukan algoritma binary search ini, yaitu kumpulan objek yang ingin kita telusuri harus sudah berurutan.<\/p>\n<p>Kecepatan algoritma ini adalah Big O(log n) dan Omega(1).<\/p>\n<\/li><\/ul>\n\n\n\n<h3>Sorting Algoritm<\/h3>\n\n\n\n<p>Kita bisa mengurutkan suatu kumpulan objek dengan menggunakan sorting algorithm. Ada 3 yang dibahas di minggu ini, yaitu,<\/p>\n\n\n\n<ul><li>\n<p>Selection Sort<\/p>\n<p>Dengan algoritma ini kita mencari objek terkecil dan menukar posisinya dengan yang ada di posisi pertama, seterusnya sampai semua terurut.<\/p>\n<p>Kecepatan algoritma ini adalah Theta(n kuadrat).<\/p>\n<\/li><li>\n<p>Bubble Sort<\/p>\n<p>Di algoritma ini kita menukar dua pasangan objek yang bersebelahan jika yang kanan lebih besar dari yang kiri (belum terurut).<\/p>\n<p>Kecepatan algoritma ini adalah Big O(n kuadrat) dan Omega(n)<\/p>\n<\/li><li>\n<p>Merge Sort<\/p>\n<p>Ini algoritma yang cukup unik karena di dalamnya ada fungsi yang memanggil fungsi itu sendiri, atau yang biasa disebut rekursif.<\/p>\n<\/li><\/ul>\n\n\n\n<h3>Structs<\/h3>\n\n\n\n<p>Di C, selain menggunakan data type yang sudah ada seperti int, string, float, dan lainnya, kita juga bisa membuat data type atau data structure kita sendiri.<\/p>\n\n\n\n<p>Kita bisa membuat struktur yang mendefinisikan data type atau data structure baru. Structure tersebut harus mempunyai satu atau lebih value. Misalnya kita bisa membuat data type person, yang isinya ada nama orang dan nomor teleponnya, semuanya dikumpulkan di satu data bernama person.<\/p>\n\n\n\n<h1><a href=\"https:\/\/cs50.harvard.edu\/x\/2021\/notes\/4\/\">Week 4<\/a><\/h1>\n\n\n\n<p>Di minggu ini David banyak menjelaskan tentang bagaimana cara kerja memori di komputer kita, pemosisian dan hubungannya dengan kode yang kita buat.<\/p>\n\n\n\n<h3>Hexadecimal<\/h3>\n\n\n\n<p>Dalam pembahasan memori, kita tidak lagi menggunakan binary digit atau bit, tapi hexadecimal, atau bilangan basis 16. Terdiri dari 16 digit, yaitu 0-9 dan 6 digit tambahan dari alfabet, A-F.<\/p>\n\n\n\n<p>Yang spesial dari hexadecimal adalah karena berbasis 16, <strong>satu digit hexadecimal bisa merepresentasikan semua value yang mungkin direpresentasikan oleh 4 bits<\/strong>, karena sama-sama berjumlah 16 value.<\/p>\n\n\n\n<p>Ini sangat mempermudah kita dalam membaca bits yang asalnya hanya sebuah deretan 0 dan 1 yang sangat panjang jadi bisa diringkas 4 kali lipat.<\/p>\n\n\n\n<p>Kalau kita perhatikan, sistem pewarnaan RGB menggunakan hexadecimal. Per dua digitnya merepresentasikan satu warna. FF0000 berarti full warna merah, 00FF00 full warna hijau, dan 0000FF full warna biru. Dengan demikian, berarti 000000 akan menghasilkan hitam dan FFFFFF menghasilkan putih.<\/p>\n\n\n\n<p>Sebagai pembeda, penulisan hexadecimal menggunakan prefix 0x, misalnya 0x0000FF.<\/p>\n\n\n\n<h3>Address<\/h3>\n\n\n\n<p>Kita bisa mengakses lokasi suatu variabel dengan menambahkan &amp; di depan variabel tersebut. Untuk mendeklarasikan variabel berisi address, kita bisa menulis tipe data yang ada di address itu dan ditambah *.<\/p>\n\n\n\n<p>Misal,<\/p>\n\n\n\n<pre class=\"wp-block-code\"><code>int *p = &amp;n;<\/code><\/pre>\n\n\n\n<p>berarti kita mengisikan variabel p dengan address n yang merupakan sebuah integer.<\/p>\n\n\n\n<p>Dalam hal ini, p bisa kita sebut <strong>pointer<\/strong>.<\/p>\n\n\n\n<p>Kita juga bisa mengakses suatu address dengan menambahkan —sayangnya— * juga ke depan address itu.<\/p>\n\n\n\n<p>Dari minggu lalu, kita tahu bahwa string hanyalah array, dan ternyata variabel array yang kita deklarasikan selama ini adalah sebuah pointer yang menuju ke address objek yang menjadi anggota array, atau stringnya.<\/p>\n\n\n\n<p>Dan karena objek dalam suatu array selalu berurutan, maka selain menggunakan bracket (string[0]) kita juga bisa menggunakan <strong>pointer arithmetic<\/strong> (string + 1) untuk melakukan indexing di array.<\/p>\n\n\n\n<h3>Local &amp; Global<\/h3>\n\n\n\n<p>Seperti yang kita tahu, ketika kita mendeklarasikan sebuah variabel di luar fungsi dan mengubah isinya di dalam sebuah fungsi, maka variabel itu aslinya tidak berubah atau hanya berubah di fungsinya saja, setelah fungsi selesai maka kembali lagi ke nilai awal.<\/p>\n\n\n\n<p>Ini karena apa yang terjadi di fungsi, tetap di fungsi. Kecuali bila yang diubah di fungsi adalah variabel aslinya, jadi yang digunakan bukan lagi nilai yang di copy dari variabel asli, tapi address variabel tersebut.<\/p>\n\n\n\n<p>Jadi ketika diubah di dalam fungsi, variabel itu beneran berubah karena kita menggunakan addressnya langsung.<\/p>\n\n\n\n<h3>File Manipulation<\/h3>\n\n\n\n<p>Seperti di bahasa pemrograman lain, di C pun kita bisa mengakses dan memodifikasi file yang tersimpan di komputer kita. File yang disimpan di komputer kita berada di harddisk atau SSD dalam bentuk bits. Maka, semua file juga memiliki addressnya masing-masing.<\/p>\n\n\n\n<p>Dengan mengaksesnya, ada banyak yang bisa kita lakukan terhadap file yang kita buka. Kita bisa memperbesar volume suara audio dengan mengalikan value per 2-byte.<\/p>\n\n\n\n<p>Kita juga bisa merestore file yang sudah kita hapus, karena sebenarnya file yang kita hapus biasanya masih akan tetap ada di memori sampai digantikan oleh memori yang lain. Maka jika kita tahu addressnya, kita bisa dengan mudah merestorenya dengan menyimpannya di file baru.<\/p>\n\n\n\n<p>Ada banyak hal menarik lain yang bisa dilakukan, misalnya dengan file image. Kita bisa membuat filter seperti yang ada di Instagram atau bawaan dari handphone kita, dengan memanipulasi byte di dalam file itu. Misalnya,<\/p>\n\n\n\n<ol><li>\n<p>Grayscale<\/p>\n<p>Kita bisa membuat gambar berwarna menjadi hitam putih dengan merata-ratakan value Red, Green, dan Blue di setiap bit. Sehingga didapatkan tingkat shadow yang bisa merepresentasikan keseluruhan gambar.<\/p>\n<\/li><li>\n<p>Sepia<\/p>\n<p>Sama dengan grayscale, kita bisa mengubah gambar menjadi sepia atau bernuansa vintage dengan mengubah value warna dengan rumus berikut.<\/p>\n<pre><code class=\"language-c\">sepiaRed = .393 * originalRed + .769 * originalGreen + .189 * originalBlue<br>sepiaGreen = .349 * originalRed + .686 * originalGreen + .168 * originalBlue<br>sepiaBlue = .272 * originalRed + .534 * originalGreen + .131 * originalBlue<br><\/code><\/pre>\n<\/li><li>\n<p>Reflection<\/p>\n<p>Untuk mencerminkan suatu gambar, kita bisa menukar pixel yang berada di kanan menjadi berada di kiri dan sebaliknya.<\/p>\n<\/li><li>\n<p>Blur<\/p>\n<p>Salah satu cara membuat sebuah gambar menjadi blur yaitu dengan mengubah tiap value yang ada di pixel dengan rata-rata value yang berada di sekelilingnya.<\/p>\n<\/li><\/ol>\n\n\n\n<h3>Stack Overflow<\/h3>\n\n\n\n<p>Penamaan &#8220;stack overflow&#8221; untuk forum yang menjadi tempat para programmer saling membahas masalah bukanlah tanpa alasan. Stack overflow sendiri merupakan salah satu masalah yang belum ada solusi konkretnya sampai sekarang.<\/p>\n\n\n\n<p>Itu terjadi ketika kita terlalu banyak menggunakan rekursi sehingga memakan memori yang terlalu banyak sampai kita kehabisan memori dan program menembus memori yang seharusnya tidak kita sentuh (maaf kebanyakan &#8220;memori&#8221; :)). Program akan crash dan terjadilah segmentation fault.<\/p>\n\n\n\n<p>Satu solusinya adalah jangan pernah melakukan itu. Hindari sebisa mungkin.<\/p>\n\n\n\n<h1><a href=\"https:\/\/cs50.harvard.edu\/x\/2021\/notes\/5\/\">Week 5<\/a><\/h1>\n\n\n\n<p>Kali ini kita mempelajari hal yang penting bagi programmer, dimana semuanya mulai kerasa pusing haha. Data structure. Bagaimana kita menyimpan data yang ada sedemikian rupa sehingga program kita menjadi seefisien mungkin, dalam waktu dan memori, baik ketika menyimpan, mencari, atau menghapus data tersebut.<\/p>\n\n\n\n<p>Kita sudah mengenal data structure yang paling simple yaitu array, dimana kita bisa mengakses data cukup dengan menggunakan indexing. Tapi kita akan menemui kesulitan di array ketika menghapus atau menambahkan data di posisi tengah. Walaupun mudah untuk diurutkan atau biasanya sudah terurut, objek-objek yang ada di array sudah fix jumlahnya, tidak ada fleksibilitas untuk mengubah jumlah anggota array setelah mendeklarasikannya pertama kali.<\/p>\n\n\n\n<p>Untuk mengatasi kekurangan-kekurangan array, kita bisa menggunakan data structure yang lain. Berikut beberapa data structure yang bisa digunakan,<\/p>\n\n\n\n<h3>Linked List<\/h3>\n\n\n\n<p>Adalah struktur yang memungkinkan kita mengaitkan semua data satu sama lain, dengan cara menambahkan pointer di dalam setiap data yang menunjuk ke data selanjutnya, seperti bergandengan tangan.<\/p>\n\n\n\n<p>Menambahkan data ke linked list akan lebih mudah karena kita tinggal menyusupkan data ke tengah, lalu mengaitkannya dengan yang lain. Begitu juga kalau kita ingin menghapus datanya. Hanya masalahnya ketika mencari data, kita harus menyusurinya satu per satu karena komputer tidak bisa langsung melihat keseluruhan data seperti manusia, kecuali data yang sudah diakses satu per satu itu.<\/p>\n\n\n\n<p>Kita juga kehilangan kemampuan untuk mengurutkan data karena linked list biasanya memasukkan data baru ke awal list, demi mempermudah inserting.<\/p>\n\n\n\n<h3>Hash Table<\/h3>\n\n\n\n<p>Struktur ini seperti dictionary, dimana semua data memiliki kunci dan data disimpan di kunci tersebut. Kita menuliskan sebuah fungsi yang mereturn hash code datanya, dan tinggal menyimpan data di kunci itu. Dengan begitu juga proses mencari dan menghapus data di hash table akan mudah dilakukan dan waktunya relatif kecil.<\/p>\n\n\n\n<p>Apa yang terjadi kalau satu data mempunyai key yang sama? Ada beberapa cara untuk mengatasinya, tapi yang paling efektif adalah kita mengubah key jadi bukan hanya menyimpan sebuah data, melainkan sebuah linked list. Jadi kita menggabungkan dua data structure di sini, hash table dan linked list.<\/p>\n\n\n\n<p>Sayangnya, sama seperti linked list, kita tidak bisa mengurutkan data di hash table.<\/p>\n\n\n\n<h3>Trie<\/h3>\n\n\n\n<p>Mungkin ini adalah data structure terbaik di list ini kalau kita memandang dari fungsionalitasnya. Untuk menyimpan data dalam sebuah <a href=\"https:\/\/en.wikipedia.org\/wiki\/Trie\">trie<\/a>, misalnya data yang ingin kita simpan adalah sebuah string, maka kita menyimpan huruf per huruf dari string tersebut sehingga membentuk sebuah pohon yang memiliki root.<\/p>\n\n\n\n<p>Dengan begitu, kita bisa mendapatkan kecepatan yang optimal saat menginput, mencari, dan menghapus data di trie. Semua data juga sudah terurut karena kita bisa mengurutkan data seiring dengan membuatnya, seperti di array.<\/p>\n\n\n\n<p>Namun, untuk semua fitur dan fungsionalitas yang kita dapatkan dalam apapun di programming, selalu ada yang harus kita bayar, bisa waktu kita sebagai manusia, waktu jalannya program, memori di komputer yang terkuras, kompleksitas, uang, dan lainnya.<\/p>\n\n\n\n<p>Dalam trie, harganya adalah space yang cukup banyak. Trie memakan space yang tidak sedikit bahkan jika data yang kita simpan hanya sedikit. Maka, kalau space diutamakan, kita sebaiknya menggunakan data structure yang lain.<\/p>\n\n\n\n<h1><a href=\"https:\/\/cs50.harvard.edu\/x\/2021\/notes\/6\/\">Week 6<\/a><\/h1>\n\n\n\n<p>Di minggu ini kita menconvert semua yang sudah kita pelajari di C ke bahasa Python. Sekilas, hampir semua syntax di Python memiliki struktur yang sama dengan syntax di C. Hanya saja di Python banyak yang menjadi lebih singkat.<\/p>\n\n\n\n<p>Python lebih banyak menggunakan syntax bahasa Inggris daripada menggunakan simbol, seperti or, and, while, if, dsb.<\/p>\n\n\n\n<p>Di Python juga sudah tidak ada lagi syntax yang terkesan seperti formalitas dan hanya sering membuat code jadi typo, seperti titik koma di akhir statement dan kurung siku di setiap condition. Syntax yang aneh itu digantikan oleh indentasi, yang sebenarnya juga membantu code agar lebih mudah dibaca. Namun, ingat bahwa indentasi styling di Python hukumnya mutlak, code akan error kalau kita lupa.<\/p>\n\n\n\n<p>Perbedaannya lagi adalah ketika menjalankan code Python, kita tidak perlu lagi mengcompile setiap ada perubahan baru karena Python menggunakan interpreter, yang menerjemahkan code Python yang kita tulis ke bahasa binary agar bisa dimengerti oleh komputer.<\/p>\n\n\n\n<p>Sayangnya, karena menggunakan interpreter setiap menjalankan program, baris per baris, Python bisa jadi memiliki waktu running time yang lebih panjang dibandingkan C. Seperti yang sudah kita bahas sebelumnya, setiap fitur dan fungsionalitas yang kita gunakan pasti ada harganya.<\/p>\n\n\n\n<p>Karena simplenya coding di Python, sekarang Python termasuk bahasa pemrograman yang paling sering digunakan dalam dunia modern, seperti machine learning, data science, artificial intelligence, dan lainnya. C sudah mulai ditinggalkan karena Python jauh lebih efisien dan efektif.<\/p>\n\n\n\n<h1><a href=\"https:\/\/cs50.harvard.edu\/x\/2021\/notes\/7\/\">Week 7<\/a><\/h1>\n\n\n\n<p>Di minggu ini kita mempelajari bahasa baru yang khusus untuk mengolah relational database yang berbentuk table. SQL.<\/p>\n\n\n\n<p>Dalam mengolah tabel, ternyata akan jauh lebih efisien dan lebih mudah bila menggunakan SQL dibanding Python, karena syntax di SQL lebih cocok untuk pengolahan relational database itu.<\/p>\n\n\n\n<p>SQL punya 4 tipe operasi syntax, yaitu,<\/p>\n\n\n\n<ul><li><code>CREATE<\/code><\/li><li><code>READ<\/code><\/li><li><code>UPDATE<\/code><\/li><li><code>DELETE<\/code><\/li><\/ul>\n\n\n\n<p>Biasa disingkat CURD, tapi READ di SQL syntaxnya diganti dengan SELECT. Simple tapi fungsional. Pengolahan tabel yang awalnya bisa makan belasan baris di Python jadi bisa sebaris saja di SQL.<\/p>\n\n\n\n<p>Di minggu ini baru difokuskan untuk membaca data menggunakan SELECT, dengan menggabungkan tabel-tabel yang ada di satu data agar bisa mengolah keseluruhan data di semua tabel secara serentak dengan mengambil informasi yang diinginkan setelah data difilter.<\/p>\n\n\n\n<p>Sebelumnya data dinormalize atau dibersihkan dengan menghilangkan semua redundant atau data-data yang tidak dibutuhkan.<\/p>\n\n\n\n<p>Untuk melihat semua tabel dalam suatu data, bisa menggunakan syntax .schema di command line. Outputnya adalah semua command yang digunakan untuk membuat tabel-tabel di data.<\/p>\n\n\n\n<p>Kalau nau membuat atau menambahkan data ke tabel, kita bisa menambah row untuk menambah data, dan menambah column untuk menambahkan atribut \/ properti ke data di tabel.<\/p>\n\n\n\n<h1><a href=\"https:\/\/cs50.harvard.edu\/x\/2021\/notes\/8\/\">Week 8<\/a><\/h1>\n\n\n\n<p>Setelah sebelumnya mempelajari beberapa bahasa pemrograman, sekarang kita mulai merepresentasikan semuanya ke bentuk yang bisa dirasakan panca indra, dimulai dari web programming.<\/p>\n\n\n\n<p>Pertama kita harus memahami terlebih dulu bagaimana cara kerja internet.<\/p>\n\n\n\n<h2>Internet<\/h2>\n\n\n\n<p>Sebenarnya internet bukanlah sesuatu yang menghubungkan semuanya, tapi internet adalah jaringan itu sendiri, yang terdiri dari semua komputer yang terhubung di dalamnya. Berkomunikasi satu sama lain, saling berbagi data dalam bentuk 0 dan 1.<\/p>\n\n\n\n<h3>Routers<\/h3>\n\n\n\n<p>Untuk menghubungkan semua komputer ini, dibutuhkan alat yang merupakan sebuah komputer yang juga memiliki CPU dan memori tapi bertujuan khusus untuk mentransmisikan data melalui kabel atau wireless. Semua aliran data terjadi di sini.<\/p>\n\n\n\n<h3>Protocols<\/h3>\n\n\n\n<p>Untuk menjamin orisinalitas data yang dikirim dan diterima, ada konvensi standar yang berlaku yang mengatur semuanya dalam suatu <strong>protocol<\/strong>. Protocol bisa mengatur kemana router seharusnya mengirim data agar data bisa sampai ke tujuan.<\/p>\n\n\n\n<h3>IP Address<\/h3>\n\n\n\n<p>Semua komputer memiliki address masing-masing yang berbeda satu sama lain, seperti alamat rumah. Terdiri dari 4 x 8 bits (32 bits), yang menghasilkan sekitar 4 miliar IP Address, dikenal dengan IPv4.<\/p>\n\n\n\n<p>Tapi itu tidak cukup, maka diciptakan IPv6 yang terdiri dari 8 x 16 bits (128 bits) yang bisa menghasilkan 3.4 x 10^38 address yang berbeda.<\/p>\n\n\n\n<h3>DNS<\/h3>\n\n\n\n<p>Akan sulit bila kita harus mengetikkan alamat IP komputer yang kita tuju, maka diciptakanlah DNS agar kita bisa menuliskan URL seperti yang biasa kita lakukan. DNS akan mengkonversi URL yang kita ketik ke IP address komputer yang kita tuju.<\/p>\n\n\n\n<p>Tidak ada DNS pusat yang menyimpan semua URL dan IP address di dunia. Semuanya tersebar di DNS-DNS lokal, sebagaimana tidak ada buku telepon yang menyimpan semua nomor telepon di dunia.<\/p>\n\n\n\n<h3>TCP<\/h3>\n\n\n\n<p>Transmission Control Protocol memastikan semua data yang diminta sampai ke tujuan. Bila data tidak sempurna, maka TCP bisa meminta server untuk mengirim ulang bagian data yang hilang.<\/p>\n\n\n\n<p>Sebelumnya, data yang dikirim umumnya telah dibagi ke beberapa packet. Kalau filenya besar, net neutrality secara otomatis akan memutuskan untuk memecahnya menjadi beberapa paket kecil.<\/p>\n\n\n\n<p>Lalu TCP menyediakan port yang bisa diisi dengan service yang dipakai oleh data itu, misalnya 25 untuk email dan 80 untuk web HTTP.<\/p>\n\n\n\n<p>Setelah semua paket sampai dan datanya komplit, TCP menyusun ulang data sesuai urutan yang ditulis di data itu.<\/p>\n\n\n\n<p>Karena hampir selalu berjalan bersamaan, penulisan TCP biasanya dibarengi dengan IP menjadi TCP\/IP.<\/p>\n\n\n\n<p>Kita mungkin pernah mendengar ada layanan yang bisa memprioritaskan kita dalam suatu jaringan, dan itu bisa terjadi karena net neutrality juga bisa memprioritaskan pelanggan yang membayar lebih.<\/p>\n\n\n\n<h2>Web Development<\/h2>\n\n\n\n<p>Dalam mengakses web, kita sebenarnya melakukan HTTP request.<\/p>\n\n\n\n<p>HTTP atau Hypertext Transfer Protocol adalah salah satu cara bagaimana web browser dan web server bisa berkomunikasi lewat TCP\/IP.<\/p>\n\n\n\n<p>HTTPS adalah versi secure \/ aman dari HTTP. Untuk bisa mendapatkan sertifikat SSL dan memperoleh HTTPS, pemilik website harus mengajukan beberapa hal untuk verifikasi. Web yang sudah mendukung HTTPS biasanya akan langsung mengalihkan kita kesana walau yang kita akses adalah HTTP.<\/p>\n\n\n\n<p>Ada dua command di HTTP; GET yaitu meminta data ke server, dan POST yang berarti server mengirimkan data yang diminta.<\/p>\n\n\n\n<p>Contoh HTTP request:<\/p>\n\n\n\n<pre class=\"wp-block-code\"><code>HTTP\/1.1 200 OK<br>Content-Type: text\/html<br>...<br><\/code><\/pre>\n\n\n\n<p>Kalau berjalan lancar, maka server akan membalas dengan:<\/p>\n\n\n\n<pre class=\"wp-block-code\"><code>HTTP\/1.1 200 OK<br>Content-Type: text\/html<br>...<br><\/code><\/pre>\n\n\n\n<p>200 adalah kode yang menunjukkan kalau semuanya lancar. Data yang diminta ada dan berhasil dikirimkan. Ada beberapa kode lain yang menunjukkan macam-macam alasan kenapa data gagal diberikan, yaitu:<\/p>\n\n\n\n<ul><li><code>301 Moved Permanently<\/code><\/li><li><code>304 Not Modified<\/code>\n<ul>\n<li>This allows the browser to use its cache, or local copy, of some resource like an image, instead of having the server send it back again.<\/li>\n<\/ul>\n<\/li><li><code>307 Temporary Redirect<\/code><\/li><li><code>401 Unauthorized<\/code><\/li><li><code>403 Forbidden<\/code><\/li><li><code>404 Not Found<\/code><\/li><li><code>418 I\\'m a Teapot<\/code><\/li><li><code>500 Internal Server Error<\/code>\n<ul>\n<li>Buggy code on a server might result in this status code.<\/li>\n<\/ul>\n<\/li><li><code>503 Service Unavailable<\/code><\/li><\/ul>\n\n\n\n<h2>HTML<\/h2>\n\n\n\n<p>Hypertext Markup Language (HTML) bukanlah suatu bahasa pemrograman, karena tidak ada pendeklarasian variabel, conditioning, dan lainnya yang seharusnya bisa kita temukan di bahasa pemrograman.<\/p>\n\n\n\n<p>Kalau kita melakukan HTTP request, data yang kita terima berbentuk HTML, yang memberitahu browser kita apa saja konten yang ada dan bagaimana menampilkannya.<\/p>\n\n\n\n<h2>CSS<\/h2>\n\n\n\n<p>Cascading Stylesheet juga bukan bahasa pemrograman, ini bisa disebut pelengkap untuk HTML yang bisa meningkatkan keestetikan web. Tersedia banyak syntax yang bisa menampilkan konten dengan berbagai style.<\/p>\n\n\n\n<p>Ada juga framework yang cukup terkenal di CSS yaitu <a href=\"https:\/\/getbootstrap.com\/\">Bootstrap<\/a>, yang menyediakan berbagai template untuk komponen-komponen di HTML, CSS, dan Javascript.<\/p>\n\n\n\n<h2>JavaScript<\/h2>\n\n\n\n<p>Untuk membuat web responsif dan bisa berinteraksi dengan pengguna, dibutuhkan suatu bahaas pemrograman yang bisa bekerja sama dengan HTML, yaitu JavaScript.<\/p>\n\n\n\n<p>Javascript termasuk Clientside Programming, yang berarti programnya dijalankan menggunakan resource user. Bukan di cloud. User menerima filenya, lalu mengolahnya di device yang digunakan dan menampilkan hasilnya di browser.<\/p>\n\n\n\n<p>Seperti CSS, JavaScript juga melengkapi HTML. Bisa ditulis satu file dengan HTML, atau dengan file terpisah lalu dilink di tag, dibungkus tag .<\/p>\n\n\n\n<p>JavaScript bisa membungkus keseluruhan web ke dalam satu objek, yaitu DOM, Document Object Model, lalu kita bisa memanipulasi objek yang ada, tanpa harus mengubah langsung dari HTMLnya.<\/p>\n\n\n\n<p>Pengubahan ini bisa diatur berdasarkan aktivitas pengguna, misalnya kalau tombol ini diklik, akan memunculkan sebuh prompt. Ini bisa menjadi dasar awal responsivitas website.<\/p>\n\n\n\n<h1><a href=\"https:\/\/cs50.harvard.edu\/x\/2021\/notes\/9\/\">Week 9<\/a><\/h1>\n\n\n\n<p>Minggu ini adalah saatnya menggabungkan semua yang sudah kita pelajari ke satu pengaplikasian. Sekarang kita mulai mengenal satu library yang biasa digunakan untuk web development, yang berbasis Python, yaitu Flask. Flask juga merupakan sebuah framework, jadi library ini punya beberapa aturan yang menjelaskan bagaimana seharusnya ini ditulis.<\/p>\n\n\n\n<p>Di Flask, pengorganisasian file adalah sebagai berikut.<\/p>\n\n\n\n<p><code>application.py requirements.txt static\/ templates\/<\/code><\/p>\n\n\n\n<ul><li><code>application.py<\/code>&nbsp;will have the Python code for our web server.<\/li><li><code>requirements.py<\/code>&nbsp;includes a list of required libraries for our application.<\/li><li><code>static\/<\/code>&nbsp;is a directory of static files, like CSS and JavaScript files.<\/li><li><code>templates\/<\/code>&nbsp;is a directory for files that will be used to create our final HTML.<\/li><\/ul>\n\n\n\n<p>Flask mengimplementasikan suatu konsep design pattern yaitu MVC (Model View Controller) yang mengatur bagaimana code dan program berjalan.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><a href=\"https:\/\/mufidu.files.wordpress.com\/2021\/05\/b7c27-image.png\"><img src=\"https:\/\/mufidu.files.wordpress.com\/2021\/05\/b7c27-image.png\" alt=\"\"\/><\/a><\/figure>\n\n\n\n<div class=\"separator\" style=\"clear: both; text-align: center;\"><\/div>\n\n\n\n<p>Secara umum, kita menuliskan code yang berisi aplikasi web kita di application.py. Lalu kita mengatur apa saja yang ditampilkan dan dilakukan program per page nya. Misalnya index akan menampilkan index.html bila requestnya GET dan akan mengirim dan menyimpan suatu form kalau requestnya POST.<\/p>\n\n\n\n<p>Kita bisa mensinergikan SQL di application.py dan fungsi-fungsi Python di HTML yang merepresentasikan page website kita. Tapi Python di Flask dalam bentuk <a href=\"https:\/\/jinja.palletsprojects.com\/\">Jinja<\/a>.<\/p>\n\n\n\n<p>Untuk menyimpan suatu sesi, sehingga website bisa berinteraksi dengan user yang sudah register\/login, kita bisa memakai variabel Session yang sudah disediakan. Ini akan menyimpan data user di cookies sehingga user bisa mengakses konten khusus yang disediakan bagi yang sudah login dan tidak perlu login lagi.<\/p>\n\n\n\n<p>Kita juga bisa menggunakan AJAX untuk mengupdate sebagian web kita tanpa merefresh seluruh page, sesuai dengan interaksi yang dilakukan user, atau jika memang diperlukan. Seperti misalnya live score pertandingan sepakbola di suatu situs berita.<\/p>\n\n\n\n<p>Ini semua adalah dasar web development yang diperlukan untuk membangun suatu web yang responsif dan fungsional.<\/p>\n\n\n\n<p>Setelah menyelesaikan semua Lab dan Problem Set dengan minimal nilai 70% di setiap tugas, saya mendapatkan sertifikat yang bisa dilihat <a href=\"https:\/\/certificates.cs50.io\/eb995a53-6bd5-461b-b88a-3decd3365027.pdf?size=A4\" target=\"_blank\" rel=\"noopener\">di sini<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Rangkuman dari materi CS50x, kelas online yang diadakan oleh Harvard tentang dasar-dasar pemrograman.<\/p>\n","protected":false},"author":1,"featured_media":663,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"neve_meta_sidebar":"","neve_meta_container":"","neve_meta_enable_content_width":"","neve_meta_content_width":0,"neve_meta_title_alignment":"","neve_meta_author_avatar":"","neve_post_elements_order":"","neve_meta_disable_header":"","neve_meta_disable_footer":"","neve_meta_disable_title":""},"categories":[8],"tags":[],"amp_enabled":true,"_links":{"self":[{"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/posts\/46"}],"collection":[{"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/comments?post=46"}],"version-history":[{"count":1,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/posts\/46\/revisions"}],"predecessor-version":[{"id":774,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/posts\/46\/revisions\/774"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/media\/663"}],"wp:attachment":[{"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/media?parent=46"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/categories?post=46"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blog.mufidu.com\/wp-json\/wp\/v2\/tags?post=46"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}